{"legislative_session": "2025A", "identifier": "SB25-119", "title": "Measures to Modify the Department of Early Childhood", "from_organization": "~{\"classification\": \"upper\"}", "classification": ["bill"], "subject": [], "abstracts": [{"note": "summary", "abstract": "Current law authorizes the executive director of the department of early childhood (department) to adopt all rules for the administration of the department, for the execution and administration of department functions, and for the programs and services managed by the department. The bill repeals the executive director's rule-making authority and creates the state board of early childhood services (state board). The bill authorizes the state board to adopt all rules for the administration of the department, for the execution and administration of department functions, and for the programs and services managed by the department.\nCurrent law allows a local coordinating organization (LCO) to participate in the Colorado universal preschool program (program) by allocating funding to school- and community-based preschool providers (preschool providers), ensuring a mixed delivery system of preschool providers, and coordinating with preschool providers and the early childhood and family support programs and services. On June 1, 2026, LCOs will no longer participate in the program, but LCOs will continue to support families who apply for early childhood and family support programs and services, coordinate with county departments and tribal agencies, and work with early child care providers to increase recruitment and retention of individuals in the early child care workforce.\n\nThe bill requires the department to modify the unified application to grant administrative access to a preschool provider who participates in the program to help families enroll their children in the program and to assist families with their administrative needs, including with the completion of their first program application and maintaining the continued enrollment of their children who have been receiving preschool services from the preschool provider. Administrative units will also have access to the unified application to help families enroll children with disabilities in the program and to assist families with their administrative needs.\n\nCurrent law requires the executive director to adopt rules for the maximum allowable educator-to-child ratios and group sizes (ratios and group sizes) in alignment with national best practices. The bill requires the state board to adopt rules for ratios and group sizes in alignment with state licensing standards. When the department adjusts ratios and group sizes, and prior to adopting rules for the preschool program, the department is required to coordinate with preschool providers to determine the ratios and group sizes.\n\nThe bill requires the department to distribute funding to preschool providers in advance of services provided throughout the school year based on enrollment data.\n(Note: This summary applies to this bill as introduced.)"}], "other_titles": [], "other_identifiers": [], "actions": [{"description": "Senate Committee on Education Postpone Indefinitely", "date": "2025-03-05T07:00:00+00:00", "organization_id": "~{\"classification\": \"upper\"}", "classification": [], "related_entities": [{"name": "Education", "entity_type": "organization", "organization_id": null}]}, {"description": "Senate Committee on Education Lay Over Amended", "date": "2025-02-26T07:00:00+00:00", "organization_id": "~{\"classification\": \"upper\"}", "classification": [], "related_entities": [{"name": "Education", "entity_type": "organization", "organization_id": null}]}, {"description": "Introduced In Senate - Assigned to Education", "date": "2025-02-04T07:00:00+00:00", "organization_id": "~{\"classification\": \"upper\"}", "classification": ["introduction"], "related_entities": [{"name": "Education", "entity_type": "organization", "organization_id": null}]}], "sponsorships": [{"name": "Barbara Kirkmeyer", "classification": "primary", "entity_type": "person", "primary": true, "person_id": "~{\"chamber\": \"upper\", \"name\": \"Barbara Kirkmeyer\"}", "organization_id": null}, {"name": "Lori Garcia Sander", "classification": "primary", "entity_type": "person", "primary": true, "person_id": "~{\"chamber\": \"lower\", \"name\": \"Lori Garcia Sander\"}", "organization_id": null}, {"name": "Eliza Hamrick", "classification": "primary", "entity_type": "person", "primary": true, "person_id": "~{\"chamber\": \"lower\", \"name\": \"Eliza Hamrick\"}", "organization_id": null}], "related_bills": [], "versions": [{"note": "Introduced (02/04/2025)", "links": [{"url": "https://leg.colorado.gov/sites/default/files/documents/2025A/bills/2025a_119_01.pdf", "media_type": "application/pdf"}], "date": "", "classification": ""}, {"note": "Committee Amendment", "links": [{"url": "https://leg.colorado.gov/sites/default/files/2025a_sb119_s_ed_001.pdf", "media_type": "application/pdf"}], "date": "", "classification": ""}], "documents": [{"note": "Fiscal Note FN1 (02/21/2025)", "links": [{"url": "https://leg.colorado.gov/sites/default/files/documents/2025A/bills/fn/2025a_sb119_00.pdf", "media_type": "application/pdf"}], "date": "", "classification": ""}], "citations": [], "sources": [{"url": "https://leg.colorado.gov/bills/sb25-119", "note": ""}], "extras": {}, "jurisdiction": {"id": "ocd-jurisdiction/country:us/state:co/government", "name": "Colorado", "classification": "state", "division_id": "ocd-division/country:us/state:co"}, "scraped_at": "2025-05-21T00:09:35+00:00", "_id": "e0c0053c-35d7-11f0-8e0b-32d15865c953"}