{"legislative_session": "2025A", "identifier": "HB25-1120", "title": "Septic-System Replacement Enterprise", "from_organization": "~{\"classification\": \"lower\"}", "classification": ["bill"], "subject": [], "abstracts": [{"note": "summary", "abstract": "The bill creates the septic-system replacement enterprise (enterprise), which operates as a government-owned business imposing and collecting a fee charged on septic-system permits and using the fee revenue to provide loans to replace failing septic systems (loan program).\n\nThe enterprise is governed by a board that consists of 7 members appointed by the governor as follows:\n\n\nOne member who is a county commissioner in a county that has rural areas;\nOne member who is a member of a county board of health in a county that has rural areas;\nOne member who is a member of a governing body of a municipality that has septic systems;\nOne member who represents the department of public health and environment (department);\nOne member who represents the department of local affairs;\nOne member who represents an association of counties within Colorado and who lives in a rural area; and\nOne member who is a rural homeowner with a septic system.\n\n\nEach member of the board serves at the pleasure of the governor. The term of appointment is 4 years, with some members having staggered terms. Members of the board serve without compensation but are entitled to receive reimbursement for actual and necessary expenses incurred in the performance of the members' duties on the board. The board will meet as necessary.\n\nThe enterprise will impose a fee on septic-system permits and administer the collection of the fee, and the enterprise may issue revenue bonds, buy and sell property, enter into contracts, sue or be sued, hire employees, set up an office, place liens on property, adopt rules, and take any action necessary to implement the bill.\n\nStarting January 15, 2027, and by January 15 each year through 2029, the enterprise will submit a written report to the governor, the joint budget committee, the house of representatives transportation, housing, and local government committee, and the senate local government and housing committee. The report must include:\n\n\nAn accounting of the number of loans made under the loan program, the total amount of the loans, the average amount of a loan, and the number of septic systems replaced as a result of the loan program;\nAn evaluation of the loan program; and\nAny legislative recommendations for the loan program.\n\n\nThe enterprise will impose a septic-system enterprise fee on each permit to install or replace a septic system. The fee is:\n\n\n$10 if the fee for the septic-system permit is less than $500;\n$50 if the fee for the septic-system permit is $500 or more but less than $1,000;\n$100 if the fee for the septic-system permit is $1,000 or more but less than $1,400; and\n$200 if the fee for the septic-system permit is $1,400 or more.\n\n\nThe enterprise must consult with and coordinate with the water quality control commission (commission) and local boards of health that issue septic-system permits. The division of administration within the department and the local government that issues the permit may retain up to 5% of the fee to cover administrative costs. When the fee revenue is projected to exceed the amount reasonably necessary to implement the loan program and administer the bill, the enterprise shall adjust the amount of the fee so that the revenue will equal the amount of money needed to reasonably administer the loan program. The commission may adopt rules to implement the division of administration's collection of the fee.\n\nThe fee will be used by the enterprise to establish the loan program, which makes interest-free or low-interest loans to low-income or low-credit-score households to replace failing septic systems.\n\nThe enterprise will contract with at least 2 community development financial institutions (financial institutions) to administer the loan program. Standards are set for a financial institution to qualify to administer the loan program. The financial institution must enter into a contract with the enterprise. The bill sets contract standards, including authorization for a financial institution to include an administration fee in an amount reasonably calculated to cover the costs to implement the contract.\n\nA financial institution will use the money collected from the fee to make loans to eligible homeowners in low-income or low-credit-score households for the purpose of replacing septic systems. The financial institution may establish reasonable standards and procedures to make loans in compliance with the bill and the contract.\n\nThe enterprise or the department may seek, accept, and expend gifts, grants, or donations from private or public sources to fund the bill.\n(Note: This summary applies to this bill as introduced.)"}], "other_titles": [], "other_identifiers": [], "actions": [{"description": "House Committee on Appropriations Lay Over Unamended - Amendment(s) Failed", "date": "2025-05-13T06:00:00+00:00", "organization_id": "~{\"classification\": \"lower\"}", "classification": [], "related_entities": [{"name": "Appropriations", "entity_type": "organization", "organization_id": null}]}, {"description": "House Committee on Finance Refer Unamended to Appropriations", "date": "2025-03-03T07:00:00+00:00", "organization_id": "~{\"classification\": \"lower\"}", "classification": ["referral-committee"], "related_entities": [{"name": "Appropriations", "entity_type": "organization", "organization_id": null}, {"name": "Finance", "entity_type": "organization", "organization_id": null}]}, {"description": "House Committee on Energy & Environment Refer Amended to Finance", "date": "2025-02-13T07:00:00+00:00", "organization_id": "~{\"classification\": \"lower\"}", "classification": ["referral-committee"], "related_entities": [{"name": "Finance", "entity_type": "organization", "organization_id": null}]}, {"description": "Introduced In House - Assigned to Energy & Environment", "date": "2025-01-28T07:00:00+00:00", "organization_id": "~{\"classification\": \"lower\"}", "classification": ["introduction"], "related_entities": [{"name": "Energy & Environment", "entity_type": "organization", "organization_id": null}]}], "sponsorships": [{"name": "Lesley Smith", "classification": "primary", "entity_type": "person", "primary": true, "person_id": "~{\"chamber\": \"lower\", \"name\": \"Lesley Smith\"}", "organization_id": null}, {"name": "Dylan Roberts", "classification": "primary", "entity_type": "person", "primary": true, "person_id": "~{\"chamber\": \"upper\", \"name\": \"Dylan Roberts\"}", "organization_id": null}], "related_bills": [], "versions": [{"note": "Introduced (01/28/2025)", "links": [{"url": "https://leg.colorado.gov/sites/default/files/documents/2025A/bills/2025a_1120_01.pdf", "media_type": "application/pdf"}], "date": "", "classification": ""}, {"note": "PA1 (02/14/2025)", "links": [{"url": "https://leg.colorado.gov/sites/default/files/documents/2025A/bills/2025a_1120_h_ene_01.pdf", "media_type": "application/pdf"}], "date": "", "classification": ""}, {"note": "Committee Amendment", "links": [{"url": "https://leg.colorado.gov/sites/default/files/2025a_hb1120_h_fin_001.pdf", "media_type": "application/pdf"}], "date": "", "classification": ""}], "documents": [{"note": "Fiscal Note FN1 (02/11/2025)", "links": [{"url": "https://leg.colorado.gov/sites/default/files/documents/2025A/bills/fn/2025a_hb1120_00.pdf", "media_type": "application/pdf"}], "date": "", "classification": ""}, {"note": "Fiscal Note SA1 (03/12/2025)", "links": [{"url": "https://leg.colorado.gov/sites/default/files/documents/2025A/bills/fn/2025a_hb1120_hse.pdf", "media_type": "application/pdf"}], "date": "", "classification": ""}], "citations": [], "sources": [{"url": "https://leg.colorado.gov/bills/hb25-1120", "note": ""}], "extras": {}, "jurisdiction": {"id": "ocd-jurisdiction/country:us/state:co/government", "name": "Colorado", "classification": "state", "division_id": "ocd-division/country:us/state:co"}, "scraped_at": "2025-05-21T00:17:13+00:00", "_id": "f1a0352e-35d8-11f0-8e0b-32d15865c953"}