{"legislative_session": "2025A", "identifier": "SB25-148", "title": "Modifications to Campaign Finance Requirements", "from_organization": "~{\"classification\": \"upper\"}", "classification": ["bill"], "subject": [], "abstracts": [{"note": "summary", "abstract": "The bill modifies campaign finance requirements contained in the \"Fair Campaign Practices Act\" that are related to prohibitions on lobbyist contributions and reporting and disclosure requirements for independent expenditures, electioneering communications, federal committees, and nonprofit entities. Prohibition on lobbyist contributions ( section 2 of the bill). A lobbyist is prohibited from soliciting, making, or promising to make a contribution to an elected official or candidate for the following state offices: members of the general assembly, the governor or lieutenant governor, the secretary of state, the state treasurer, or the attorney general. Current law applies this prohibition only when the general assembly is in regular session or when any measure adopted by the general assembly in a regular session is pending before the governor for approval or disapproval. The bill changes current law so that the prohibition on lobbyist contributions applies throughout the year, regardless of whether the general assembly is in session, and also extends this prohibition to cover any individual who has been a professional lobbyist within the preceding 6 months. Reporting and disclosure requirements for independent expenditures, electioneering communications, federal committees, and nonprofit entities. The state constitution defines an \"electioneering communication\" to mean certain communication that unambiguously refers to a candidate and that is disseminated to the public within 30 days before a primary election or within 60 days before a general election. Senate Bill 19-086, enacted in 2019, expanded the definition of this term for purposes of campaign finance disclosures to include any communication that satisfies all other requirements specified in the state constitution but that is disseminated between the primary election and the general election. The bill further expands this definition for purposes of campaign finance disclosures to include any communication that satisfies all other requirements specified in the state constitution but that is disseminated within 90 days prior to a primary election ( sections 1 , 4 , and 7 ).\nThe state constitution defines an \"independent expenditure\" to mean any purchase, payment, distribution, loan, advance, deposit, or gift of money by any person for the purpose of expressly advocating the election or defeat of a candidate or supporting or opposing a ballot issue or ballot question and that is not controlled by or coordinated with a candidate or agent of a candidate. Under existing law, any person making an independent expenditure in excess of $1,000 within 30 days before a primary, general, or regular biennial school election is required to file a report within 48 hours after obligating money for the independent expenditure. The bill expands this requirement to cover the 90 days before a primary, general, or regular biennial school election and the period between the primary and general elections and shortens the time for the filing of this report to within 24 hours after obligating money for the independent expenditure ( section 3 ).\nExisting law requires a disclosure on any communication that constitutes an expenditure in excess of $1,000. This disclosure must include the name of the person paying for the communication and, if the person paying for the communication is not a natural person, must identify a natural person who is the registered agent of the nonnatural person. The bill requires that this disclosure statement also identify the names of the 3 persons that have contributed the most money to the person identified as paying for the communication for the purpose of making the communication ( section 3 ).\nThe bill also requires a written affirmation from any committee registered with the federal election commission (federal committee) that contributes, donates, or transfers $1,000 or more to any committee that is required to report or register under the \"Fair Campaign Practices Act\" ( section 6 ). The bill prohibits any committee from accepting such a contribution, donation, or transfer unless the federal committee provides a written affirmation that includes, as applicable:\n\n\nThe name, address, and identification number of the federal committee;\nThe name and address of the treasurer of the federal committee;\nThe amount and recipient of the contribution, donation, or transfer; and\nA list of any person that transferred $1,000 or more to the federal committee, which includes the person's name and address and, if the person is a natural person, the person's occupation and employer.\n\n\nIn addition, the bill requires a written affirmation from any nonprofit entity that contributes, donates, or transfers $1,000 or more to an issue committee, independent expenditure committee, or political organization ( section 5 ). The bill prohibits any such committee or organization from accepting a contribution, donation, or transfer from a nonprofit entity unless the nonprofit entity provides a written affirmation that includes, as applicable:\n\nThe name and address of the nonprofit entity;\nThe name and address of the registered agent of the nonprofit entity;\nThe amount and recipient of the contribution, donation, or transfer; and\nA list of any person that is not a natural person and that donated $1,000 or more to the nonprofit entity, which includes the person's name and address.(Note: This summary applies to this bill as introduced.)"}], "other_titles": [], "other_identifiers": [], "actions": [{"description": "Senate Committee on State, Veterans, & Military Affairs Postpone Indefinitely", "date": "2025-03-27T06:00:00+00:00", "organization_id": "~{\"classification\": \"upper\"}", "classification": [], "related_entities": [{"name": "State, Veterans, & Military Affairs", "entity_type": "organization", "organization_id": null}]}, {"description": "Introduced In Senate - Assigned to State, Veterans, & Military Affairs", "date": "2025-02-05T07:00:00+00:00", "organization_id": "~{\"classification\": \"upper\"}", "classification": ["introduction"], "related_entities": [{"name": "State, Veterans, & Military Affairs", "entity_type": "organization", "organization_id": null}]}], "sponsorships": [{"name": "Mike Weissman", "classification": "primary", "entity_type": "person", "primary": true, "person_id": "~{\"chamber\": \"upper\", \"name\": \"Mike Weissman\"}", "organization_id": null}], "related_bills": [], "versions": [{"note": "Introduced (02/05/2025)", "links": [{"url": "https://leg.colorado.gov/sites/default/files/documents/2025A/bills/2025a_148_01.pdf", "media_type": "application/pdf"}], "date": "", "classification": ""}, {"note": "Committee Amendment", "links": [{"url": "https://leg.colorado.gov/sites/default/files/2025a_sb148_s_sa_001.pdf", "media_type": "application/pdf"}], "date": "", "classification": ""}], "documents": [{"note": "Fiscal Note FN1 (03/07/2025)", "links": [{"url": "https://leg.colorado.gov/sites/default/files/documents/2025A/bills/fn/2025a_sb148_00.pdf", "media_type": "application/pdf"}], "date": "", "classification": ""}], "citations": [], "sources": [{"url": "https://leg.colorado.gov/bills/sb25-148", "note": ""}], "extras": {}, "jurisdiction": {"id": "ocd-jurisdiction/country:us/state:co/government", "name": "Colorado", "classification": "state", "division_id": "ocd-division/country:us/state:co"}, "scraped_at": "2025-05-21T00:10:38+00:00", "_id": "06081c80-35d8-11f0-8e0b-32d15865c953"}