{"legislative_session": "2025A", "identifier": "SB25-280", "title": "Data Center Development & Grid Modernization Act", "from_organization": "~{\"classification\": \"upper\"}", "classification": ["bill"], "subject": [], "abstracts": [{"note": "summary", "abstract": "The bill creates the data center development and grid modernization program (program) in the Colorado office of economic development (office). To facilitate efficient data center development and g rid modernization, the program allows tax and utility benefits to a data center operator that applies to the office to have a data center project certified at one of 2 levels and that satisfies certain eligibility criteria for certification.\nThe first level of data center project certification created in the bill is base certification. In connection with base certification, the bill specifies that:\n\n\nTo obtain base certification, a data center operator must commit, through the application process with the office, to making a $250 million minimum capital investment in data center facility construction and equipment within 5 years, creating 25 full-time jobs that satisfy specified criteria, and breaking ground on the data center project within 5 years of obtaining base certification;\nIn addition to the investment and job creation requirements, to obtain base certification a data center operator must also commit to implementing basic grid support capabilities, obtaining certification under one of several energy efficiency standards, implementing water stewardship strategies that optimize operational water management, sourcing at least 50% of the data center project's energy consumption from renewable and clean sources, supporting clean integration by implementing energy storage solutions that align with the data center project's needs and operations, agreeing to certain post-certification requirements, and agreeing to submit annual compliance reports to the office;\nA data center operator must apply to the office, in a form and manner to be determined by the office, for base certification before taking action to satisfy any of the eligibility criteria;\nThe office is required to review a data center operator's application for base certification and award base certification to data center operators that have demonstrated that they will satisfy the base certification criteria;\nA data center operator that obtains base certification for a data center project is eligible for a 100% sales and use tax exemption on the purchase, use, and storage of information technology infrastructure, data center infrastructure, and electrical grid enhancement equipment (qualified purchases) for 20 years from the date that the data center project was certified, so long as the data center project satisfies ongoing compliance requirements; and\nIn addition to the sales and use tax credit, a data center operator that obtains base certification for a data center project is eligible for standard utility rate incentives as negotiated between the data center operator and the utility.\n\n\nThe second level of data center certification created in the bill is enhancement certification. A data center operator that has obtained base certification for a data center project may apply for enhancement certification for the same data center. In connection with enhancement certification, the bill specifies that:\n\n\nTo obtain enhancement certification, a data center operator must invest a minimum of $10 million in grid enhancement and modernization, invest in workforce development or other community benefit programs, agree to certain post-certification requirements, and agree to submit annual compliance reports to the office;\nA data center operator must apply to the office, in a form and manner to be determined by the office, for enhancement certification either before or after making the required minimum grid enhancement and modernization investment;\nThe office is required to review a data center operator's application for enhancement certification and award enhancement certification to data center operators that have demonstrated that they will satisfy the enhancement certification criteria;\nFor income tax years commencing on or after 2026, a data center operator that obtains enhancement certification for a data center project is eligible for an income tax credit in an amount equal to 10% of the amount of any grid enhancement and modernization investment made by the data center operator and an additional amount equal to 5% of the amount of such investment if the investment is made in a rural area (grid enhancement credit);\nA data center operator is not eligible to claim the grid enhancement credit until the data center operator has made the required minimum grid enhancement and modernization investment; and\nIn addition to the grid enhancement credit, a data center operator that obtains enhancement certification for a data center project is eligible for enhanced utility benefits as negotiated between the data center operator and the utility.\n\n\nBefore submitting an application for certification for a data center project, a data center operator is required to conduct and document a preliminary consultation with the utility that will provide electricity for the data center project regarding interconnection feasibility, capacity, and infrastructure requirements and obtain a written feasibility assessment from the utility. A data center operator is required to include the documentation of the consultation and the written feasibility assessment with an application to the office for certification of the data center project, and, if the data center project includes projects requiring review by the public utilities commission (commission), the commission is required to review specified aspects of the application.\n\nA certified data center project that necessitates a new customer load or co-located customer load that satisfies certain criteria (emerging new load) is eligible for targeted resource acquisition if the data center operator satisfies specified requirements. The bill specifies a process by which a utility regulated by the commission may submit a resource acquisition application to the commission to meet emerging new load needs. The bill also specifies how a utility may finance resources and infrastructure needs in connection with emerging new loads.\n\nAfter achieving base certification and enhancement certification, a data center operator may apply to the office for certain benefit extensions for the sales and use tax exemption allowed to data center operators that have obtained base certification, for the grid enhancement credit allowed to data center operators that have obtained enhancement certification, and for the utility benefits negotiated between the data center operator and the utility.\n\nIf the office determines that a data center operator is not fulfilling its obligations and commitments to retain base certification or enhancement certification, the office is required to revoke the certification and the data center operator is required to repay the state for the tax benefits that it received.\n(Note: This summary applies to this bill as introduced.)"}], "other_titles": [], "other_identifiers": [], "actions": [{"description": "Senate Committee on Appropriations Lay Over Unamended - Amendment(s) Failed", "date": "2025-05-08T06:00:00+00:00", "organization_id": "~{\"classification\": \"upper\"}", "classification": [], "related_entities": [{"name": "Appropriations", "entity_type": "organization", "organization_id": null}]}, {"description": "Senate Committee on Transportation & Energy Refer Amended to Appropriations", "date": "2025-04-16T06:00:00+00:00", "organization_id": "~{\"classification\": \"upper\"}", "classification": ["referral-committee"], "related_entities": [{"name": "Appropriations", "entity_type": "organization", "organization_id": null}, {"name": "Transportation & Energy", "entity_type": "organization", "organization_id": null}]}, {"description": "Introduced In Senate - Assigned to Transportation & Energy", "date": "2025-04-04T06:00:00+00:00", "organization_id": "~{\"classification\": \"upper\"}", "classification": ["introduction"], "related_entities": [{"name": "Transportation & Energy", "entity_type": "organization", "organization_id": null}]}], "sponsorships": [{"name": "Nick Hinrichsen", "classification": "primary", "entity_type": "person", "primary": true, "person_id": "~{\"chamber\": \"upper\", \"name\": \"Nick Hinrichsen\"}", "organization_id": null}, {"name": "Paul Lundeen", "classification": "primary", "entity_type": "person", "primary": true, "person_id": "~{\"chamber\": \"upper\", \"name\": \"Paul Lundeen\"}", "organization_id": null}, {"name": "Kyle Brown", "classification": "primary", "entity_type": "person", "primary": true, "person_id": "~{\"chamber\": \"lower\", \"name\": \"Kyle Brown\"}", "organization_id": null}, {"name": "Alex Valdez", "classification": "primary", "entity_type": "person", "primary": true, "person_id": "~{\"chamber\": \"lower\", \"name\": \"Alex Valdez\"}", "organization_id": null}, {"name": "K. Mullica", "classification": "cosponsor", "entity_type": "person", "primary": false, "person_id": "~{\"chamber\": \"upper\", \"name\": \"K. Mullica\"}", "organization_id": null}, {"name": "W. Lindstedt", "classification": "cosponsor", "entity_type": "person", "primary": false, "person_id": "~{\"chamber\": \"lower\", \"name\": \"W. Lindstedt\"}", "organization_id": null}], "related_bills": [], "versions": [{"note": "Introduced (04/04/2025)", "links": [{"url": "https://leg.colorado.gov/sites/default/files/documents/2025A/bills/2025a_280_01.pdf", "media_type": "application/pdf"}], "date": "", "classification": ""}, {"note": "PA1 (04/17/2025)", "links": [{"url": "https://leg.colorado.gov/sites/default/files/documents/2025A/bills/2025a_280_s_tra_01.pdf", "media_type": "application/pdf"}], "date": "", "classification": ""}, {"note": "Committee Amendment", "links": [{"url": "https://leg.colorado.gov/sites/default/files/2025a_sb280_s_tra_001.pdf", "media_type": "application/pdf"}], "date": "", "classification": ""}], "documents": [{"note": "Fiscal Note FN2 (04/29/2025)", "links": [{"url": "https://leg.colorado.gov/sites/default/files/documents/2025A/bills/fn/2025a_sb280_r1.pdf", "media_type": "application/pdf"}], "date": "", "classification": ""}, {"note": "Fiscal Note FN1 (04/11/2025)", "links": [{"url": "https://leg.colorado.gov/sites/default/files/documents/2025A/bills/fn/2025a_sb280_00.pdf", "media_type": "application/pdf"}], "date": "", "classification": ""}], "citations": [], "sources": [{"url": "https://leg.colorado.gov/bills/sb25-280", "note": ""}], "extras": {}, "jurisdiction": {"id": "ocd-jurisdiction/country:us/state:co/government", "name": "Colorado", "classification": "state", "division_id": "ocd-division/country:us/state:co"}, "scraped_at": "2025-05-20T23:59:16+00:00", "_id": "6fb4c374-35d6-11f0-8e0b-32d15865c953"}