{"legislative_session": "2025A", "identifier": "SB25-076", "title": "Intoxicating Substances & Social Equity Business", "from_organization": "~{\"classification\": \"upper\"}", "classification": ["bill"], "subject": [], "abstracts": [{"note": "summary", "abstract": "The bill requires the marijuana enforcement division, the natural medicine division, and the department of public health and environment (department), when regulating marijuana and marijuana products and hemp and hemp products and psilocybin, psilocin, and possibly dimethyltryptamine, ibogaine, and mescaline (natural medicine), to prioritize the public health over private interests in exercising regulatory authority and develop measures designed to prevent these agencies or an agent or employee of these agencies from becoming unduly influenced by licensees or registrants.\n\nCurrent law requires the marijuana enforcement division to adopt rules governing labeling of regulated marijuana and regulated marijuana products. The bill requires the labeling of regulated marijuana and regulated marijuana products to include the amount of total THC per package and a solid color strip on the face of the packaging that indicates THC potency of marijuana or a marijuana product by showing the corresponding color as follows:\n\n\nIf the THC potency is less than 5%, the color strip is blue;\nIf the THC potency is at least 5% but less than 15%, the color strip is yellow;\nIf the THC potency is at least 15% but less than 50%, the color strip is orange; or\nIf the THC potency is at least 50%, the color strip is red.\n\nA marijuana store must post, at all times and at every point of sale, a sign that explains the meaning of the color strips.\n\nInhaled marijuana is required to have the following labeling:\n\n\nThe amount of THC per serving;\nThe amount of THC per package;\nThe number of servings per package; and\nDirections for consumption of a serving.\n\n\nCurrent law authorizes the marijuana enforcement division to seek the assistance of the department when adopting certain rules. The bill requires the marijuana enforcement division to seek this assistance.\n\nCurrent law limits the standard serving size of edible marijuana products to 10 milligrams. The bill adds inhaled marijuana and requires that its serving size is limited to 10 milligrams and the package weight to 500 milligrams.\n\nThe bill forbids a retail marijuana store, a retail marijuana transporter, a marijuana hospitality business, a retail marijuana accelerator store, and a retail marijuana hospitality and sales business from selling, distributing, permitting the sale of, or offering to sell or distribute the following to an individual who is 25 years of age or younger:\n\n\nRetail marijuana that has a THC potency that is higher than 10%; or\nInhaled retail marijuana that contains an added flavor ingredient.\n\n\nThe natural medicine division is required to adopt rules that include:\n\n\nRequirements that labeling of natural medicine or a natural medicine product includes a universal symbol indicating the package contains natural medicine; and\nRequirements and standards for collecting and reporting data about adverse medical or behavioral reactions to natural medicine or natural medicine products.\n\n\nA natural medicine license holder is prohibited from manufacturing, distributing, or transferring natural medicine or a natural medicine product that:\n\n\nIs a candy product, gummy, chocolate, or other confection;\nContains a concentrated form of a natural medicine or natural medicine product;\nIs consumed by or administered by a means other than oral ingestion; or\nContains an added flavor or sweetener.\n\n\nCurrent law creates a social equity program that gives loans, grants, and technical assistance to disadvantaged persons by helping an approved applicant to obtain a marijuana license and start a marijuana business. The funding comes from the marijuana tax cash fund. The bill expands this program to include a person who wants to start any type of business.\n(Note: This summary applies to this bill as introduced.)"}], "other_titles": [], "other_identifiers": [], "actions": [{"description": "Senate Committee on Business, Labor, & Technology Postpone Indefinitely", "date": "2025-03-11T06:00:00+00:00", "organization_id": "~{\"classification\": \"upper\"}", "classification": [], "related_entities": [{"name": "Business, Labor, & Technology", "entity_type": "organization", "organization_id": null}]}, {"description": "Introduced In Senate - Assigned to Business, Labor, & Technology", "date": "2025-01-22T07:00:00+00:00", "organization_id": "~{\"classification\": \"upper\"}", "classification": ["introduction"], "related_entities": [{"name": "Business, Labor, & Technology", "entity_type": "organization", "organization_id": null}]}], "sponsorships": [{"name": "Judy Amabile", "classification": "primary", "entity_type": "person", "primary": true, "person_id": "~{\"chamber\": \"upper\", \"name\": \"Judy Amabile\"}", "organization_id": null}, {"name": "Byron Pelton", "classification": "primary", "entity_type": "person", "primary": true, "person_id": "~{\"chamber\": \"upper\", \"name\": \"Byron Pelton\"}", "organization_id": null}, {"name": "Kyle Brown", "classification": "primary", "entity_type": "person", "primary": true, "person_id": "~{\"chamber\": \"lower\", \"name\": \"Kyle Brown\"}", "organization_id": null}], "related_bills": [], "versions": [{"note": "Introduced (01/22/2025)", "links": [{"url": "https://leg.colorado.gov/sites/default/files/documents/2025A/bills/2025a_076_01.pdf", "media_type": "application/pdf"}], "date": "", "classification": ""}, {"note": "Committee Amendment", "links": [{"url": "https://leg.colorado.gov/sites/default/files/2025a_sb076_s_blt_001.pdf", "media_type": "application/pdf"}], "date": "", "classification": ""}], "documents": [{"note": "Fiscal Note FN1 (02/28/2025)", "links": [{"url": "https://leg.colorado.gov/sites/default/files/documents/2025A/bills/fn/2025a_sb076_00.pdf", "media_type": "application/pdf"}], "date": "", "classification": ""}], "citations": [], "sources": [{"url": "https://leg.colorado.gov/bills/sb25-076", "note": ""}], "extras": {}, "jurisdiction": {"id": "ocd-jurisdiction/country:us/state:co/government", "name": "Colorado", "classification": "state", "division_id": "ocd-division/country:us/state:co"}, "scraped_at": "2025-05-21T00:07:10+00:00", "_id": "8a50cccc-35d7-11f0-8e0b-32d15865c953"}