{"legislative_session": "2025A", "identifier": "SB25-057", "title": "Noncitizen Voter Registration Cancellation", "from_organization": "~{\"classification\": \"upper\"}", "classification": ["bill"], "subject": [], "abstracts": [{"note": "summary", "abstract": "The secretary of state must maintain the computerized statewide voter registration list on as current a basis as possible, including in a manner that ensures that the names of electors who are not eligible to vote are removed from the list. In furtherance of this responsibility, the department of state regularly and securely exchanges information with the department of revenue (DOR), the department of public health and environment (CDPHE), and the department of corrections (DOC) to enable the transfer and verification of voter registration information.\n Section 1  of the bill requires that, on and after July 1, 2025, the secretary of state, on behalf of the department of state, modify its agreements with DOR, CDPHE, and DOC to expressly include access to any available citizenship-related information in the databases already subject to shared access between the department of state and DOR, CDPHE, and DOC, respectively. Section 2 requires the executive director of DOR to furnish 2 separate quarterly reports to the secretary of state of all persons who are not citizens based on:\n\n\nInformation contained in the database of the division of motor vehicles subject to the existing sharing agreement with the department of state as modified in section 1; and\nInformation obtained from the federal commissioner of social security and required to be made accessible to the department of state for verification of a person's name, date of birth, and the last 4 digits of the person's social security number.\n\nSection 2 requires the executive directors of CDPHE and DOC, respectively, to furnish the same type of quarterly report to the secretary of state based on the information in the databases of CDPHE and DOC subject to existing information-sharing agreements with the department of state and as modified in section 1. Section 2 also requires the state court administrator to provide the secretary of state with a quarterly report of all persons who report as ineligible to serve as a trial or grand juror because they are not citizens. Section 2 requires the secretary of state to forward quarterly to each county clerk and recorder the information received from the executive directors of DOR, CDPHE, DOC, and the state court administrator, and requires a county clerk and recorder to cancel the voter registration of any elector who is not a citizen according to the information received from the secretary of state. Additionally, the secretary of state may electronically cancel the voter registration of any elector who is not a citizen and who the secretary of state has received notice of from the executive directors of DOR, CDPHE, or DOC, or the state court administrator.(Note: This summary applies to this bill as introduced.)"}], "other_titles": [], "other_identifiers": [], "actions": [{"description": "Senate Committee on State, Veterans, & Military Affairs Postpone Indefinitely", "date": "2025-02-04T07:00:00+00:00", "organization_id": "~{\"classification\": \"upper\"}", "classification": [], "related_entities": [{"name": "State, Veterans, & Military Affairs", "entity_type": "organization", "organization_id": null}]}, {"description": "Introduced In Senate - Assigned to State, Veterans, & Military Affairs", "date": "2025-01-21T07:00:00+00:00", "organization_id": "~{\"classification\": \"upper\"}", "classification": ["introduction"], "related_entities": [{"name": "State, Veterans, & Military Affairs", "entity_type": "organization", "organization_id": null}]}], "sponsorships": [{"name": "Mark Baisley", "classification": "primary", "entity_type": "person", "primary": true, "person_id": "~{\"chamber\": \"upper\", \"name\": \"Mark Baisley\"}", "organization_id": null}, {"name": "Chris Richardson", "classification": "primary", "entity_type": "person", "primary": true, "person_id": "~{\"chamber\": \"lower\", \"name\": \"Chris Richardson\"}", "organization_id": null}], "related_bills": [], "versions": [{"note": "Introduced (01/21/2025)", "links": [{"url": "https://leg.colorado.gov/sites/default/files/documents/2025A/bills/2025a_057_01.pdf", "media_type": "application/pdf"}], "date": "", "classification": ""}, {"note": "Committee Amendment", "links": [{"url": "https://leg.colorado.gov/sites/default/files/2025a_sb057_s_sa_001.pdf", "media_type": "application/pdf"}], "date": "", "classification": ""}], "documents": [{"note": "Fiscal Note FN1 (01/31/2025)", "links": [{"url": "https://leg.colorado.gov/sites/default/files/documents/2025A/bills/fn/2025a_sb057_00.pdf", "media_type": "application/pdf"}], "date": "", "classification": ""}], "citations": [], "sources": [{"url": "https://leg.colorado.gov/bills/sb25-057", "note": ""}], "extras": {}, "jurisdiction": {"id": "ocd-jurisdiction/country:us/state:co/government", "name": "Colorado", "classification": "state", "division_id": "ocd-division/country:us/state:co"}, "scraped_at": "2025-05-21T00:11:36+00:00", "_id": "28880c66-35d8-11f0-8e0b-32d15865c953"}