{"legislative_session": "2025A", "identifier": "SB25-198", "title": "Transparency Transactions Medical Care Entities", "from_organization": "~{\"classification\": \"upper\"}", "classification": ["bill"], "subject": [], "abstracts": [{"note": "summary", "abstract": "The bill repeals and reenacts, with amendments, the current requirements for providing notice of transactions involving licensed hospitals and requires that the parties to a merger, acquisition, or contracting affiliation of one or more health-care entities, long-term care entities, or veterinary care entities (material change transaction) submit specified notice requirements to the attorney general at least 60 days before the effective date of the material change transaction. If the terms of the material change transaction are altered or modified following the submission of the written notice, the parties must provide notice to the attorney general of the alteration or modification.\nThe attorney general may review a required notice of a material change transaction and may assess whether the proposed material change transaction is contrary to the public interest using factors specified in the bill. The attorney general may convert their review of the material change transaction to an investigation under the \"Colorado State Antitrust Act of 2023\".\n\nThe bill prohibits a material change transaction unless:\n\n\nThe attorney general states that a formal assessment and review of the material change transaction are not necessary;\nThe attorney general issues an assessment that the material change transaction is not likely to be contrary to the public interest;\nA court finds that the material change transaction is not likely to be contrary to the public interest;\n90 days have elapsed since the parties to the material change transaction submitted notice of the material change transaction, and the attorney general has not issued an assessment and has not notified the parties to the material change transaction that more time is required to complete an assessment; or\nThe attorney general has notified the parties that more time is required to complete the assessment, and 45 days have elapsed since the attorney general provided the notice.\n\n\nThe attorney general may bring an action in district court to enjoin or unwind a material change transaction or seek other equitable relief necessary to protect the public interest.\n\nParties to a material change transaction may challenge the attorney general's assessment of a material change transaction in the district court for the city and county of Denver. The reviewing court shall affirm the attorney general's assessment unless a person seeking judicial review proves, by a preponderance of the evidence, specified criteria regarding the attorney general's assessment.\n\nThe bill grants the attorney general authority to seek additional information regarding a material change transaction, including requiring the parties to a material change transaction to:\n\n\nFile a statement or report in writing answering, or to answer in writing, questions propounded by the attorney general as to the facts and circumstances reasonably related to an alleged or potential violation of the bill;\nAppear pursuant to a subpoena or produce relevant documents in aid of an investigation or inquiry; and\nAllow the attorney general to make true copies of documents that may be offered into evidence.\n\n\nIf a person fails to comply with an investigation or inquiry pursuant to a request or subpoena issued by the attorney general, the attorney general may apply to a district court for relief, including a civil penalty of up to $5,000, reasonable costs, and attorney fees or a protective order.\n\nFor at least 5 years after the effective date of a material change transaction, the parties to the material change transaction shall provide the attorney general an annual report meeting specified requirements. The report must be made available to the public on the attorney general's and the parties' websites.\n\nA person that fails to comply with any provision of the bill is subject to a civil penalty of not more than $200 for each day the person remains in violation. Failure of a party to a material change transaction to provide notice of the material change transaction is an independent and sufficient ground for a court to enjoin or unwind the material change transaction.\n\nThe bill requires that, if certain health-care providers refer a patient to an entity for health-care services and the provider, or an immediate family member of the provider, has a financial relationship with the entity, the provider shall disclose the nature of the financial relationship to the patient at the time of the referral.\n(Note: This summary applies to this bill as introduced.)"}], "other_titles": [], "other_identifiers": [], "actions": [{"description": "Senate Committee on Health & Human Services Postpone Indefinitely", "date": "2025-04-17T06:00:00+00:00", "organization_id": "~{\"classification\": \"upper\"}", "classification": [], "related_entities": [{"name": "Health & Human Services", "entity_type": "organization", "organization_id": null}]}, {"description": "Introduced In Senate - Assigned to Health & Human Services", "date": "2025-03-05T07:00:00+00:00", "organization_id": "~{\"classification\": \"upper\"}", "classification": ["introduction"], "related_entities": [{"name": "Health & Human Services", "entity_type": "organization", "organization_id": null}]}], "sponsorships": [{"name": "Cathy Kipp", "classification": "primary", "entity_type": "person", "primary": true, "person_id": "~{\"chamber\": \"upper\", \"name\": \"Cathy Kipp\"}", "organization_id": null}, {"name": "Mike Weissman", "classification": "primary", "entity_type": "person", "primary": true, "person_id": "~{\"chamber\": \"upper\", \"name\": \"Mike Weissman\"}", "organization_id": null}, {"name": "Kyle Brown", "classification": "primary", "entity_type": "person", "primary": true, "person_id": "~{\"chamber\": \"lower\", \"name\": \"Kyle Brown\"}", "organization_id": null}], "related_bills": [], "versions": [{"note": "Introduced (03/05/2025)", "links": [{"url": "https://leg.colorado.gov/sites/default/files/documents/2025A/bills/2025a_198_01.pdf", "media_type": "application/pdf"}], "date": "", "classification": ""}, {"note": "Committee Amendment", "links": [{"url": "https://leg.colorado.gov/sites/default/files/2025a_sb198_s_hhs_001.pdf", "media_type": "application/pdf"}], "date": "", "classification": ""}], "documents": [{"note": "Fiscal Note FN1 (03/14/2025)", "links": [{"url": "https://leg.colorado.gov/sites/default/files/documents/2025A/bills/fn/2025a_sb198_00.pdf", "media_type": "application/pdf"}], "date": "", "classification": ""}], "citations": [], "sources": [{"url": "https://leg.colorado.gov/bills/sb25-198", "note": ""}], "extras": {}, "jurisdiction": {"id": "ocd-jurisdiction/country:us/state:co/government", "name": "Colorado", "classification": "state", "division_id": "ocd-division/country:us/state:co"}, "scraped_at": "2025-05-21T00:18:37+00:00", "_id": "237c6a4a-35d9-11f0-8e0b-32d15865c953"}