{"legislative_session": "2025A", "identifier": "HB25-1032", "title": "Improving Infrastructure to Reduce Homelessness", "from_organization": "~{\"classification\": \"lower\"}", "classification": ["bill"], "subject": [], "abstracts": [{"note": "summary", "abstract": "The bill creates the Colorado interagency council on homelessness (council) within the governor's office. The council's powers and duties include:\n\n\nFacilitating and coordinating homelessness response, resources, and best practices between state and local partners;\nSetting statewide strategy for homelessness resolution and prevention;\nDeveloping an outreach and education campaign to understand and respond to issues related to homelessness;\nIncreasing access to supportive resources for homeless individuals, including income benefits, food benefits, healthcare coverage, and support related to mental health and substance use;\nIdentifying and maximizing housing resources provided by state agencies;\nImproving cross-system policies and procedures for state agencies and homelessness service providers; and\nOrganizing other homelessness response measures as the council sees fit.\n\nThe council is required to meet at least once a month and submit and present an annual report providing a summary of the council's activities and recommendations for legislative action to the general assembly no later than January 26 of each year.\n\nThe council's membership consists of the directors, or the directors' designees, of the following state agencies:\n\n\nThe department of local affairs;\nThe department of education;\nThe department of corrections;\nThe department of health care policy and financing;\nThe behavioral health administration;\nThe department of human services;\nThe department of public health and environment; and\nThe department of public safety.\n\nThe governor may appoint to the council the directors, or the directors' designees, of other state agencies or individuals to represent political subdivisions as the governor sees fit.\n\nThe bill creates an advisory council to the council consisting of members who have experience working on the resolution and prevention of homelessness and with homeless individuals, including the following 11 members appointed by the governor:\n\n\nThe director, or the director's designee, of a nonprofit organization with a mission related to homelessness;\nThe leader of a faith-based organization that is primarily focused on homelessness resolution and prevention;\nA homelessness service provider primarily focused on specialized populations;\nThe director, or the director's designee, of a philanthropic organization that supports homelessness service providers;\nA representative from a continuum of care organization that provides services in an urban area;\nA representative from a continuum of care organization that provides services in a rural area;\nAn elected local government representative;\nAn individual with lived experience of homelessness;\nAn individual with lived experience navigating affordable housing and housing resources;\nAn owner or operator of permanent supportive housing; and\nA housing navigator or representative from an organization that administers housing vouchers.\n\nThe advisory council shall meet at least once a month, shall develop and implement a plan to receive public feedback on statewide strategy related to homelessness prevention and resolution, and shall recommend funding and policies to support homelessness prevention and resolution to the council.\n\nThe bill requires the office of homeless initiatives within the division of housing in the department of local affairs to, at least once every 4 months, convene the state continuum of care organizations for the purposes of implementing state strategies and identifying best practices to prevent and reduce homelessness in Colorado. The continuum of care organizations shall consider methods and practices to:\n\n\nImprove the implementation of the Homeless Management Information System and data reporting;\nImprove the implementation of the OneHome coordinated entry system;\nCoordinate with regional navigation campuses to determine best practices, identify gaps, and make referrals; and\nImprove data reporting within the regional navigation campuses.\n\nThe continuum of care organizations are required to submit and present a report to the general assembly providing a summary of the council's activities from the prior year and recommendations for implementing the methods and practices the organizations considered.\n\nThe bill creates a new type of special district, a regional homelessness response district (district), which is formed by counties and municipalities to reduce and prevent homelessness. The bill details specifics of organizing and dissolving a district, submitting a district service plan, voting in district elections, and the financial and taxing powers of a district.\n\nThe bill allows a county clerk and recorder to designate money collected from documentary filing fees for granting or conveying real property to be transferred to a housing agency for the purpose of developing, preserving, or acquiring affordable housing aligned with demonstrated community needs and for homeless individuals.\n(Note: This summary applies to this bill as introduced.)"}], "other_titles": [], "other_identifiers": [], "actions": [{"description": "House Committee on Appropriations Lay Over Unamended - Amendment(s) Failed", "date": "2025-05-13T06:00:00+00:00", "organization_id": "~{\"classification\": \"lower\"}", "classification": [], "related_entities": [{"name": "Appropriations", "entity_type": "organization", "organization_id": null}]}, {"description": "House Committee on Transportation, Housing & Local Government Refer Amended to Appropriations", "date": "2025-02-19T07:00:00+00:00", "organization_id": "~{\"classification\": \"lower\"}", "classification": ["referral-committee"], "related_entities": [{"name": "Appropriations", "entity_type": "organization", "organization_id": null}, {"name": "Transportation", "entity_type": "organization", "organization_id": null}, {"name": "Local Government", "entity_type": "organization", "organization_id": null}]}, {"description": "Introduced In House - Assigned to Transportation, Housing & Local Government", "date": "2025-01-08T07:00:00+00:00", "organization_id": "~{\"classification\": \"lower\"}", "classification": ["introduction"], "related_entities": [{"name": "Transportation, Housing & Local Government", "entity_type": "organization", "organization_id": null}, {"name": "Transportation", "entity_type": "organization", "organization_id": null}, {"name": "Local Government", "entity_type": "organization", "organization_id": null}]}], "sponsorships": [{"name": "Manny Rutinel", "classification": "primary", "entity_type": "person", "primary": true, "person_id": "~{\"chamber\": \"lower\", \"name\": \"Manny Rutinel\"}", "organization_id": null}], "related_bills": [], "versions": [{"note": "Introduced (01/08/2025)", "links": [{"url": "https://leg.colorado.gov/sites/default/files/documents/2025A/bills/2025a_1032_01.pdf", "media_type": "application/pdf"}], "date": "", "classification": ""}, {"note": "PA1 (02/20/2025)", "links": [{"url": "https://leg.colorado.gov/sites/default/files/documents/2025A/bills/2025a_1032_h_thl_02.pdf", "media_type": "application/pdf"}], "date": "", "classification": ""}, {"note": "Committee Amendment", "links": [{"url": "https://leg.colorado.gov/sites/default/files/2025a_hb1032_h_thl_001.pdf", "media_type": "application/pdf"}], "date": "", "classification": ""}], "documents": [{"note": "Fiscal Note FN2 (04/18/2025)", "links": [{"url": "https://leg.colorado.gov/sites/default/files/documents/2025A/bills/fn/2025a_hb1032_r2.pdf", "media_type": "application/pdf"}], "date": "", "classification": ""}, {"note": "Fiscal Note MEMO1 (02/20/2025)", "links": [{"url": "https://leg.colorado.gov/sites/default/files/documents/2025A/bills/fn/2025a_hb1032_l_001.pdf", "media_type": "application/pdf"}], "date": "", "classification": ""}, {"note": "Fiscal Note FN1 (02/10/2025)", "links": [{"url": "https://leg.colorado.gov/sites/default/files/documents/2025A/bills/fn/2025a_hb1032_00.pdf", "media_type": "application/pdf"}], "date": "", "classification": ""}], "citations": [], "sources": [{"url": "https://leg.colorado.gov/bills/hb25-1032", "note": ""}], "extras": {}, "jurisdiction": {"id": "ocd-jurisdiction/country:us/state:co/government", "name": "Colorado", "classification": "state", "division_id": "ocd-division/country:us/state:co"}, "scraped_at": "2025-05-21T00:06:10+00:00", "_id": "6625eb3e-35d7-11f0-8e0b-32d15865c953"}