{"legislative_session": "2025A", "identifier": "HB25-1323", "title": "Division of Parks & Wildlife Outdoor Recreation", "from_organization": "~{\"classification\": \"lower\"}", "classification": ["bill"], "subject": [], "abstracts": [{"note": "summary", "abstract": "The bill clarifies that the division of parks and wildlife in the department of natural resources (division) is the primary entity responsible for outdoor recreation management and infrastructure planning in the state.\n\nThe bill requires the division to support the planning, development, and maintenance of infrastructure and access projects to enhance outdoor recreation opportunities in the state. In doing so, the division is required to balance and integrate outdoor recreation efforts with statewide conservation efforts. In collaboration with federal, local, and tribal partners, the division is tasked with developing regional outdoor recreation and conservation plans that will, among other endeavors, consider sustainable and climate-resilient strategies for outdoor recreation and conservation planning and employ data-driven management of public lands and regional outdoor recreational resources.\nThe bill also requires the division to develop a river recreation program. To implement the river recreation program, the division is required to, in collaboration with the Colorado water conservation board, the outdoor recreation industry office, and other state agencies or stakeholders:\n\n\nBuild a statewide coalition of river recreation, stewardship, and safety managers;\nCoordinate with river basin roundtables, local governments, and other appropriate stakeholders to align river recreation efforts with existing water management strategies;\nAlign river recreation management with state and regional water planning efforts regarding conservation to address the impact of climate change on aquatic ecosystems;\nIdentify high-priority rivers and recreation areas to support improvements;\nEnhance river data collection, mapping, and public access to information; and\nPromote river safety and stewardship opportunities through initiatives such as hazard removal, signage improvements, and collaborative partnerships.\n\n\nUnder current law, the parks and wildlife commission (commission) is responsible for establishing a state trails system. The bill requires the division to consult and cooperate with appropriate entities to establish a nonmotorized and a year-round motorized trails program to support the planning, development, and stewardship of trail systems that are designed for nonmotorized and motorized use, respectively. The division is required to establish and operate the nonmotorized and motorized trails programs in a manner that protects, preserves, enhances, and manages the natural, scenic, and recreation areas of the state.\n(Note: This summary applies to this bill as introduced.)"}], "other_titles": [], "other_identifiers": [], "actions": [{"description": "House Committee on Agriculture, Water & Natural Resources Postpone Indefinitely", "date": "2025-04-14T06:00:00+00:00", "organization_id": "~{\"classification\": \"lower\"}", "classification": [], "related_entities": []}, {"description": "Introduced In House - Assigned to Agriculture, Water & Natural Resources", "date": "2025-04-04T06:00:00+00:00", "organization_id": "~{\"classification\": \"lower\"}", "classification": ["introduction"], "related_entities": [{"name": "Agriculture, Water & Natural Resources", "entity_type": "organization", "organization_id": null}]}], "sponsorships": [{"name": "Meghan Lukens", "classification": "primary", "entity_type": "person", "primary": true, "person_id": "~{\"chamber\": \"lower\", \"name\": \"Meghan Lukens\"}", "organization_id": null}, {"name": "Rick Taggart", "classification": "primary", "entity_type": "person", "primary": true, "person_id": "~{\"chamber\": \"lower\", \"name\": \"Rick Taggart\"}", "organization_id": null}, {"name": "Dylan Roberts", "classification": "primary", "entity_type": "person", "primary": true, "person_id": "~{\"chamber\": \"upper\", \"name\": \"Dylan Roberts\"}", "organization_id": null}], "related_bills": [], "versions": [{"note": "Introduced (04/04/2025)", "links": [{"url": "https://leg.colorado.gov/sites/default/files/documents/2025A/bills/2025a_1323_01.pdf", "media_type": "application/pdf"}], "date": "", "classification": ""}, {"note": "Committee Amendment", "links": [{"url": "https://leg.colorado.gov/sites/default/files/2025a_hb1323_h_awn_001.pdf", "media_type": "application/pdf"}], "date": "", "classification": ""}], "documents": [{"note": "Fiscal Note FN1 (04/11/2025)", "links": [{"url": "https://leg.colorado.gov/sites/default/files/documents/2025A/bills/fn/2025a_hb1323_00.pdf", "media_type": "application/pdf"}], "date": "", "classification": ""}], "citations": [], "sources": [{"url": "https://leg.colorado.gov/bills/hb25-1323", "note": ""}], "extras": {}, "jurisdiction": {"id": "ocd-jurisdiction/country:us/state:co/government", "name": "Colorado", "classification": "state", "division_id": "ocd-division/country:us/state:co"}, "scraped_at": "2025-05-21T00:01:21+00:00", "_id": "ba0eb7b8-35d6-11f0-8e0b-32d15865c953"}