{"legislative_session": "2025A", "identifier": "HB25-1193", "title": "Vote Transparency Protocol Act", "from_organization": "~{\"classification\": \"lower\"}", "classification": ["bill"], "subject": [], "abstracts": [{"note": "summary", "abstract": "The bill creates new processes for vote verification, voter verification, and audit transparency.\n\nFor vote verification, the bill requires ballots to be assigned vote tracking numbers and voters to be assigned voter identifier numbers. Voters are given both of these numbers and the secretary of state (secretary) publishes these numbers on a publicly accessible vetting transparency ledger and a publicly accessible ballot transparency ledger, respectively. The number of vote tracking numbers on the vetting transparency ledger must equal the number of voter identifier numbers on the ballot transparency ledger. After a ballot is cast, the secretary publishes the information on the ballot on a cast vote transparency ledger along with the corresponding vote tracking number. A voter may challenge the entry on the cast vote transparency ledger associated with their vote tracking number. The secretary shall maintain a challenged vote ledger and shall publish the status to challenges of entries on the cast vote transparency ledger on the challenged vote ledger.\nFor voter verification, the bill requires voters to provide the secretary with the following no less than one month before an election in order to receive a mail ballot for that election:\n\n\nThe voter's mailing address;\nA copy of the voter's relevant identification;\nVerification that the voter satisfies the necessary qualifications to register as a voter;\nA request to receive a mail ballot;\nAcknowledgment of the penalties for committing fraud in connection with casting a vote; and\nVerification that the voter is a human.\n\nA voter can provide this information either on the secretary's website or in connection with the payment of a utility bill. Further, the bill:\n\n\nProhibits the distribution of mail ballots more than 2 weeks before the relevant election;\nRequires the secretary, within 30 days after the effective date of the bill, to withdraw the state from participation in the electronic registration information system; and\nRequires the secretary to annually remove all registration information from the the statewide voter registration system and for that removal to be verified by an entity that is not a state agency.\n\n\nFor audit transparency, the bill requires the secretary to generate for every election a number of randomly generated and assigned audit numbers (RAANs) equal to the amount of electors who voted in the previous election plus one percent. The secretary shall enter each RAAN it generates into a RAAN tracking database. The secretary must randomly assign and attach each RAAN to a ballot. After a ballot is cast:\n\n\nA voter may keep a copy of the RAAN associated with their ballot;\nThe secretary shall enter the first 12 digits of a ballot's RAAN (partial RAAN) in the RAAN tracking database to ensure that the ballot's RAAN was one of the RAANs that the secretary generated for the election;\nThe secretary shall scan the ballot; and\nThe secretary shall enter the ballot's partial RAAN, along with the votes cast with that ballot, in a downloadable, searchable, and publicly accessible cast vote record database.\n\nAfter inputting information for a ballot into the cast vote record database, the secretary shall verify that information against the scan of the ballot. An individual can challenge the information in the cast vote record database associated with a partial RAAN by presenting the complete RAAN to the secretary.\n(Note: This summary applies to this bill as introduced.)"}], "other_titles": [], "other_identifiers": [], "actions": [{"description": "House Committee on State, Civic, Military, & Veterans Affairs Postpone Indefinitely", "date": "2025-03-03T07:00:00+00:00", "organization_id": "~{\"classification\": \"lower\"}", "classification": [], "related_entities": []}, {"description": "Introduced In House - Assigned to State, Civic, Military, & Veterans Affairs", "date": "2025-02-10T07:00:00+00:00", "organization_id": "~{\"classification\": \"lower\"}", "classification": ["introduction"], "related_entities": [{"name": "State, Civic, Military, & Veterans Affairs", "entity_type": "organization", "organization_id": null}]}], "sponsorships": [{"name": "Larry Don Suckla", "classification": "primary", "entity_type": "person", "primary": true, "person_id": "~{\"chamber\": \"lower\", \"name\": \"Larry Don Suckla\"}", "organization_id": null}], "related_bills": [], "versions": [{"note": "Introduced (02/10/2025)", "links": [{"url": "https://leg.colorado.gov/sites/default/files/documents/2025A/bills/2025a_1193_01.pdf", "media_type": "application/pdf"}], "date": "", "classification": ""}, {"note": "Committee Amendment", "links": [{"url": "https://leg.colorado.gov/sites/default/files/2025a_hb1193_h_sa_001.pdf", "media_type": "application/pdf"}], "date": "", "classification": ""}], "documents": [{"note": "Fiscal Note FN1 (02/27/2025)", "links": [{"url": "https://leg.colorado.gov/sites/default/files/documents/2025A/bills/fn/2025a_hb1193_00.pdf", "media_type": "application/pdf"}], "date": "", "classification": ""}], "citations": [], "sources": [{"url": "https://leg.colorado.gov/bills/hb25-1193", "note": ""}], "extras": {}, "jurisdiction": {"id": "ocd-jurisdiction/country:us/state:co/government", "name": "Colorado", "classification": "state", "division_id": "ocd-division/country:us/state:co"}, "scraped_at": "2025-05-21T00:19:41+00:00", "_id": "4a1b3fc8-35d9-11f0-8e0b-32d15865c953"}