{"legislative_session": "2025A", "identifier": "HB25-1331", "title": "Marijuana Special Event & Hotel Delivery", "from_organization": "~{\"classification\": \"lower\"}", "classification": ["bill"], "subject": [], "abstracts": [{"note": "summary", "abstract": "The bill authorizes a social equity license holder to deliver regulated marijuana to a hotel located within the city and county of Denver if the license holder has:\n\n\nA medical marijuana delivery permit;\nA medical marijuana transporter license;\nA retail marijuana delivery permit; or\nA retail marijuana transporter license.\n\n\nIn order for marijuana to be delivered, the following requirements must be satisfied:\n\n\nThe hotel must be registered with the city and county of Denver to receive deliveries;\nThe local jurisdiction must have authorized the delivery of marijuana in accordance with current law;\nThe hotel must have authorized the delivery of marijuana to its premises;\nThe social equity license holder must not deliver to premises licensed to serve alcohol; and\nThe social equity license holder must comply with marijuana law.\n\n\nThe state licensing authority, in coordination with the city and county of Denver, must create a registry of hotels that have authorized the delivery of marijuana to their premises. The state licensing authority may adopt rules necessary for the secure storage and management of deliveries.\n\nThe bill authorizes special event permits for the holder of a social equity license and a marijuana hospitality business license. Other retail license holders may partner with a qualified license holder to hold a special event.\n\nThe state licensing authority or a local licensing authority may set special event permit fees in an amount that offsets the direct and indirect cost to the state or local licensing authority of implementing the bill.\n\nThe marijuana enforcement division (division) or a local licensing authority may deny the issuance of a special event permit upon the grounds that the issuance would be injurious to the public welfare because of the nature of the special event, its location within the community, or the failure of the applicant in a past special event to conduct the event in compliance with applicable laws. Public notice of the proposed permit and the procedures for protesting issuance of the permit must be posted at the proposed location for at least 10 days.\n\nThe state licensing authority or a local licensing authority is required to adopt appropriate rules, ordinances, or resolutions for applying for a special event permit and for protesting an application for a special event permit. If an applicant is denied, a hearing must be set. The application must be approved or denied within 90 days after the application is filed. The permit must specify the location and the time when it is valid. A license holder may be issued a permit for no more than 15 days a year.\n\nIf a violation occurs during a special event and the responsible license holder cannot be identified, the division may send written notice to every license holder identified on the relevant permit applications and may fine each the same dollar amount, not to exceed $25 per license holder or $200 in the aggregate. A joint fine does not apply to the revocation of a license.\n(Note: This summary applies to this bill as introduced.)"}], "other_titles": [], "other_identifiers": [], "actions": [{"description": "House Committee on Business Affairs & Labor Postpone Indefinitely", "date": "2025-04-16T06:00:00+00:00", "organization_id": "~{\"classification\": \"lower\"}", "classification": [], "related_entities": []}, {"description": "Introduced In House - Assigned to Business Affairs & Labor", "date": "2025-04-11T06:00:00+00:00", "organization_id": "~{\"classification\": \"lower\"}", "classification": ["introduction"], "related_entities": [{"name": "Business Affairs & Labor", "entity_type": "organization", "organization_id": null}]}], "sponsorships": [{"name": "Naquetta Ricks", "classification": "primary", "entity_type": "person", "primary": true, "person_id": "~{\"chamber\": \"lower\", \"name\": \"Naquetta Ricks\"}", "organization_id": null}, {"name": "William Lindstedt", "classification": "primary", "entity_type": "person", "primary": true, "person_id": "~{\"chamber\": \"lower\", \"name\": \"William Lindstedt\"}", "organization_id": null}], "related_bills": [], "versions": [{"note": "Introduced (04/11/2025)", "links": [{"url": "https://leg.colorado.gov/sites/default/files/documents/2025A/bills/2025a_1331_01.pdf", "media_type": "application/pdf"}], "date": "", "classification": ""}, {"note": "Committee Amendment", "links": [{"url": "https://leg.colorado.gov/sites/default/files/2025a_hb1331_h_bus_001.pdf", "media_type": "application/pdf"}], "date": "", "classification": ""}], "documents": [{"note": "Fiscal Note FN1 (04/15/2025)", "links": [{"url": "https://leg.colorado.gov/sites/default/files/documents/2025A/bills/fn/2025a_hb1331_00.pdf", "media_type": "application/pdf"}], "date": "", "classification": ""}], "citations": [], "sources": [{"url": "https://leg.colorado.gov/bills/hb25-1331", "note": ""}], "extras": {}, "jurisdiction": {"id": "ocd-jurisdiction/country:us/state:co/government", "name": "Colorado", "classification": "state", "division_id": "ocd-division/country:us/state:co"}, "scraped_at": "2025-05-21T00:09:31+00:00", "_id": "de9524cc-35d7-11f0-8e0b-32d15865c953"}