{"legislative_session": "2025A", "identifier": "SB25-135", "title": "Colorado Government Efficiency Authority", "from_organization": "~{\"classification\": \"upper\"}", "classification": ["bill"], "subject": [], "abstracts": [{"note": "summary", "abstract": "The bill creates the Colorado government efficiency authority (authority). The authority is governed by a board consisting of the following appointees:\n\n\nOne representative of the private sector with business experience with state contracts, appointed by the governor;\nOne representative of the private sector with experience as a chief financial officer or legal advisor, appointed by the speaker of the house of representatives;\nOne representative of the private sector with experience in energy and environmental work, appointed by the president of the senate;\nOne representative of the private sector with experience in transportation, appointed by the minority leader of the house of representatives;\nOne representative of the private sector with experience in health care or real estate, appointed by the minority leader of the senate;\nThe staff director of the joint budget committee, or the staff director's designee, as a nonvoting advisory member;\nThe director of the office of state planning and budgeting, or the director's designee, as a nonvoting advisory member; and\nThe state auditor, or the state auditor's designee, as a nonvoting advisory member.\n\nMembers of the board serve without compensation for any service provided to the authority and do not receive any reimbursement from the board for expenses incurred in furtherance of the board's responsibilities.\n\nThe board is charged with:\n\n\nExamining every state-funded state agency and state department's operations, personnel, and mission to determine whether the state agency or state department is maximizing the efficient use of state money and resources;\nIdentifying efficiencies in state government that would result in cost savings and improved provision of government services;\nWorking with the federal government to implement federal directives designed to increase government efficiency and reduce government costs;\nProviding recommendations to the governor and general assembly about implementing efficiencies in state government, leveraging money from the federal government, and implementing federal directives;\nHolding public hearings that solicit input from the public about increasing efficiencies in state government; and\nDeveloping a process for members of the public to make ongoing recommendations related to state government efficiency, which recommendations will be reviewed by the authority.\n\n\nThe authority may accept gifts, grants, donations, and federal money to pay for the authority's operations. The authority is not funded by a state agency or state department.\n(Note: This summary applies to this bill as introduced.)"}], "other_titles": [], "other_identifiers": [], "actions": [{"description": "Senate Committee on State, Veterans, & Military Affairs Postpone Indefinitely", "date": "2025-02-25T07:00:00+00:00", "organization_id": "~{\"classification\": \"upper\"}", "classification": [], "related_entities": [{"name": "State, Veterans, & Military Affairs", "entity_type": "organization", "organization_id": null}]}, {"description": "Introduced In Senate - Assigned to State, Veterans, & Military Affairs", "date": "2025-02-05T07:00:00+00:00", "organization_id": "~{\"classification\": \"upper\"}", "classification": ["introduction"], "related_entities": [{"name": "State, Veterans, & Military Affairs", "entity_type": "organization", "organization_id": null}]}], "sponsorships": [{"name": "John Carson", "classification": "primary", "entity_type": "person", "primary": true, "person_id": "~{\"chamber\": \"upper\", \"name\": \"John Carson\"}", "organization_id": null}, {"name": "Max Brooks", "classification": "primary", "entity_type": "person", "primary": true, "person_id": "~{\"chamber\": \"lower\", \"name\": \"Max Brooks\"}", "organization_id": null}], "related_bills": [], "versions": [{"note": "Introduced (02/05/2025)", "links": [{"url": "https://leg.colorado.gov/sites/default/files/documents/2025A/bills/2025a_135_01.pdf", "media_type": "application/pdf"}], "date": "", "classification": ""}, {"note": "Committee Amendment", "links": [{"url": "https://leg.colorado.gov/sites/default/files/2025a_sb135_s_sa_001.pdf", "media_type": "application/pdf"}], "date": "", "classification": ""}], "documents": [{"note": "Fiscal Note FN1 (02/19/2025)", "links": [{"url": "https://leg.colorado.gov/sites/default/files/documents/2025A/bills/fn/2025a_sb135_00.pdf", "media_type": "application/pdf"}], "date": "", "classification": ""}], "citations": [], "sources": [{"url": "https://leg.colorado.gov/bills/sb25-135", "note": ""}], "extras": {}, "jurisdiction": {"id": "ocd-jurisdiction/country:us/state:co/government", "name": "Colorado", "classification": "state", "division_id": "ocd-division/country:us/state:co"}, "scraped_at": "2025-05-20T23:57:24+00:00", "_id": "2cd3bc18-35d6-11f0-8e0b-32d15865c953"}