{"legislative_session": "2025A", "identifier": "HB25-1255", "title": "Health-Care Provider Right to Exercise Conscience", "from_organization": "~{\"classification\": \"lower\"}", "classification": ["bill"], "subject": [], "abstracts": [{"note": "summary", "abstract": "The bill creates the \"Medical Ethics Defense Act\" (act). The act recognizes that a health-care professional, health-care institution, and health-care payer (health-care provider) has a right of conscience. The act:\n\n\nDefines \"conscience\" to mean the ethical, moral, or religious beliefs or principles held by a health-care provider and recognizes institutional entities or corporate bodies as also having a conscience as determined by reference to the governing documents of the entity or body; and\nAllows a health-care provider to refuse to participate in or pay for a medical procedure, treatment, or service that violates the health-care provider's conscience.\n\nThe right of conscience is limited to a particular medical procedure, treatment, or service. Further, a health-care payer is prohibited from refusing to pay for services that are specified in the health-care payer's contract. The act shall not be construed to conflict with the requirement to provide emergency medical treatment.\n\nA health-care provider:\n\n\nShall not be discriminated against in any manner as a result of the health-care provider exercising its right of conscience; and\nIs immune from civil, criminal, or administrative liability for exercising its right of conscience.\n\n\nThe act authorizes a religious health-care provider to make employment staffing, contracting, and administrative decisions consistent with its religious beliefs if it holds itself out to the public as religious and has internal operating procedures that implement its religious purpose or mission. The act provides protection against discrimination to a health-care provider that provides information about a violation of the act or other law to an employer or a state or federal agency or official or that testifies or participates in proceedings relating to the violation.\n\nAdditionally, the act prohibits:\n\n\nAdministrative agencies from denying or revoking a license, certification, or registration, or threatening to do so, based upon an individual health-care professional engaging in free speech under the United States constitution (constitution) or section 10 of article II of the state constitution; or\nThe state from contracting with, recognizing, approving, or requiring an individual to obtain certifications or credentials from a specialty board or other recognizing agency that refuses to certify or revokes credentials based upon an individual's engagement in free speech under the constitution.\n\n\nA state entity that regulates the provision of medical treatments, procedures, or services shall promptly notify a health-care provider of any complaint received by the entity that is based on an exercise of free speech and that may result in revocation of the health-care provider's license, certification, or registration.\n\nA party aggrieved by a violation of the act may commence a civil action and, if a violation has occurred, is entitled to injunctive and declaratory relief and an award of monetary damages and attorney fees.\n(Note: This summary applies to this bill as introduced.)"}], "other_titles": [], "other_identifiers": [], "actions": [{"description": "House Committee on Judiciary Postpone Indefinitely", "date": "2025-03-04T07:00:00+00:00", "organization_id": "~{\"classification\": \"lower\"}", "classification": [], "related_entities": [{"name": "Judiciary", "entity_type": "organization", "organization_id": null}]}, {"description": "Introduced In House - Assigned to Judiciary", "date": "2025-02-12T07:00:00+00:00", "organization_id": "~{\"classification\": \"lower\"}", "classification": ["introduction"], "related_entities": [{"name": "Judiciary", "entity_type": "organization", "organization_id": null}]}], "sponsorships": [{"name": "Stephanie Luck", "classification": "primary", "entity_type": "person", "primary": true, "person_id": "~{\"chamber\": \"lower\", \"name\": \"Stephanie Luck\"}", "organization_id": null}], "related_bills": [], "versions": [{"note": "Introduced (02/12/2025)", "links": [{"url": "https://leg.colorado.gov/sites/default/files/documents/2025A/bills/2025a_1255_01.pdf", "media_type": "application/pdf"}], "date": "", "classification": ""}, {"note": "Committee Amendment", "links": [{"url": "https://leg.colorado.gov/sites/default/files/2025a_hb1255_h_jud_001.pdf", "media_type": "application/pdf"}], "date": "", "classification": ""}], "documents": [{"note": "Fiscal Note FN1 (02/27/2025)", "links": [{"url": "https://leg.colorado.gov/sites/default/files/documents/2025A/bills/fn/2025a_hb1255_00.pdf", "media_type": "application/pdf"}], "date": "", "classification": ""}], "citations": [], "sources": [{"url": "https://leg.colorado.gov/bills/hb25-1255", "note": ""}], "extras": {}, "jurisdiction": {"id": "ocd-jurisdiction/country:us/state:co/government", "name": "Colorado", "classification": "state", "division_id": "ocd-division/country:us/state:co"}, "scraped_at": "2025-05-21T00:05:13+00:00", "_id": "448364c0-35d7-11f0-8e0b-32d15865c953"}