{"legislative_session": "104th", "identifier": "HB3422", "title": "CLIMB REPORT ACTION", "from_organization": "~{\"classification\": \"lower\"}", "classification": ["bill"], "subject": [], "abstracts": [{"note": "", "abstract": "Amends the Department of Professional Regulation Law of the Civil Administrative Code of Illinois. Provides that the Department of Professional and Financial Regulation shall conduct a review of each license, certification, or other authority issued or conferred by the Department, including any costs and fees associated with such authorities. Provides that the Department shall create a report based on this review and deliver the report to the General Assembly no later than 12 months prior to the termination of the relevant licensing Act under the Regulatory Sunset Act. Sets forth requirements for the report. Provides that the Department shall conduct a review of each potential new Department license, certification, or authority, including any costs and fees associated with the potential new program. Provides that the Department shall create a report based on this review and deliver the report to the General Assembly no later than 30 days after the filing date of the bill in which the license, certification, or authority is proposed. Sets forth requirements for the report. Provides that the Department shall complete a review and report for any license, certification, or authority reviewed which becomes law 24 months after the effective date of the bill in which the license, certification, or authority was proposed and shall subsequently conduct review and reporting duties according to the provided schedule. Provides that nothing in the amendatory provisions shall be construed to prevent the Department from conducting a review or publishing and delivering a report prior to the filing date of a piece of legislation if the Department reasonably believes a new license, certification, or authority is necessary to meet a demonstrated public safety or welfare interest or the Department has received requests to regulate a previously unregulated profession"}], "other_titles": [], "other_identifiers": [], "actions": [{"description": "Filed with the Clerk by Rep. Tony M. McCombie", "date": "2025-02-07", "organization_id": "~{\"classification\": \"lower\"}", "classification": ["filing"], "related_entities": []}, {"description": "First Reading", "date": "2025-02-18", "organization_id": "~{\"classification\": \"lower\"}", "classification": ["reading-1"], "related_entities": []}, {"description": "Referred to Rules Committee", "date": "2025-02-18", "organization_id": "~{\"classification\": \"lower\"}", "classification": [], "related_entities": []}], "sponsorships": [{"name": "Tony M. McCombie", "classification": "primary", "entity_type": "person", "primary": true, "person_id": "~{\"chamber\": \"lower\", \"name\": \"Tony M. McCombie\"}", "organization_id": null}], "related_bills": [], "versions": [{"note": "Introduced", "links": [{"url": "https://beta.ilga.gov/documents/legislation/104/HB/PDF/10400HB3422.pdf", "media_type": "application/pdf"}, {"url": "https://beta.ilga.gov/Legislation/BillStatus/FullText?LegDocId=201815&DocName=10400HB3422&DocNum=3422&DocTypeID=HB&LegID=162027&GAID=18&SessionID=114&SpecSess=&Session=&Print=1", "media_type": "text/html"}], "date": "", "classification": ""}], "documents": [], "citations": [], "sources": [{"url": "https://beta.ilga.gov/Legislation/BillStatus?DocNum=3422&GAID=18&DocTypeID=HB&LegId=162027&SessionID=114", "note": ""}], "extras": {}, "_id": "27088b18-1729-11f0-9eaa-86812f74cec2"}