{"legislative_session": "104th", "identifier": "HB3274", "title": "GAMING-PRIZE&GIFT KIOSKS", "from_organization": "~{\"classification\": \"lower\"}", "classification": ["bill"], "subject": [], "abstracts": [{"note": "", "abstract": "Amends the Video Gaming Act. Provides that an applicant or licensee is not in violation of the Act or any of the Illinois Gaming Board rules, and shall not be subject to disciplinary action, delay of any Board consideration, or denial of any license for operating a game device if operation of the gaming device is in compliance with and not considered gambling under the Criminal Code of 2012. Amends the Criminal Code of 2012. Provides that a gambling offense involving a specific gambling device is a Class 4 felony. Prohibits a municipality from imposing any restriction or prohibition related to an activity which is lawful under under a provision that set forth activities that a person may not be convicted of gambling for participating. Includes specified vending or other electronic machines or devices in the definition of gambling device. Amends the Prizes and Gifts Act. Provides that it is unlawful for a person to operate on any premises a prize and gift kiosk that fails to meet the specified technical standards. Prohibits a prize and gift kiosk from being connected directly or indirectly to the Internet in order to participate in the game or contest or to receive or retrieve any data related to the kiosk or device unless the connected device is a redemption vault. Provides that is unlawful for a prize and gift kiosk to offer the sale of anything other than a bona fide product. Provides that it is unlawful to operate a prize and gift kiosk without a self contained fill system which permits the operation of the device solely determined on a fee basis or the amount of revenue generated but does not include a system based on time, number of spins or spin equivalent, or other non-revenue based system, and automatically ceases to operate upon the completion of a predetermined cycle. Provides that it is unlawful to operate a prize and gift kiosk without a route boost plus internal monitoring system that accounts and records (i) cash in, (ii) winnings, (iii) entries used, (iv) power failures, disconnections from the monitoring system, and malfunctions, and (v) remote activations and disabling. Requires a prize and gift kiosk to be registered with the Department of Revenue and to remit the annual fee as set by the Department of Revenue. Effective immediately."}], "other_titles": [], "other_identifiers": [], "actions": [{"description": "Filed with the Clerk by Rep. Marcus C. Evans, Jr.", "date": "2025-02-06", "organization_id": "~{\"classification\": \"lower\"}", "classification": ["filing"], "related_entities": []}, {"description": "First Reading", "date": "2025-02-18", "organization_id": "~{\"classification\": \"lower\"}", "classification": ["reading-1"], "related_entities": []}, {"description": "Referred to Rules Committee", "date": "2025-02-18", "organization_id": "~{\"classification\": \"lower\"}", "classification": [], "related_entities": []}, {"description": "Assigned to Gaming Committee", "date": "2025-03-11", "organization_id": "~{\"classification\": \"lower\"}", "classification": ["referral-committee"], "related_entities": []}, {"description": "Rule 19(a) / Re-referred to Rules Committee", "date": "2025-03-21", "organization_id": "~{\"classification\": \"lower\"}", "classification": [], "related_entities": []}], "sponsorships": [{"name": "Marcus C. Evans, Jr.", "classification": "primary", "entity_type": "person", "primary": true, "person_id": "~{\"chamber\": \"lower\", \"name\": \"Marcus C. Evans, Jr.\"}", "organization_id": null}], "related_bills": [], "versions": [{"note": "Introduced", "links": [{"url": "https://beta.ilga.gov/documents/legislation/104/HB/PDF/10400HB3274.pdf", "media_type": "application/pdf"}, {"url": "https://beta.ilga.gov/Legislation/BillStatus/FullText?LegDocId=201550&DocName=10400HB3274&DocNum=3274&DocTypeID=HB&LegID=161762&GAID=18&SessionID=114&SpecSess=&Session=&Print=1", "media_type": "text/html"}], "date": "", "classification": ""}], "documents": [], "citations": [], "sources": [{"url": "https://beta.ilga.gov/Legislation/BillStatus?DocNum=3274&GAID=18&DocTypeID=HB&LegId=161762&SessionID=114", "note": ""}], "extras": {}, "_id": "13cdd242-1729-11f0-9eaa-86812f74cec2"}