{"legislative_session": "104th", "identifier": "HB1562", "title": "DHS-OCCUPATIONAL THERAPY PILOT", "from_organization": "~{\"classification\": \"lower\"}", "classification": ["bill"], "subject": [], "abstracts": [{"note": "", "abstract": "Amends the Department of Human Services Act. Requires the Department of Human Services to establish and administer, no later than January 1, 2026, a 5-year pilot program that integrates an occupational therapy component into the State's home-delivered meals program, commonly known as Meals on Wheels, authorized under the federal Older Americans Act. Provides that under the pilot program, the Department shall award grants funded under the Section 14(c) transition program to eligible community agencies for the purpose of training and employing qualifying workers with disabilities to accompany Meals on Wheels drivers on their regular delivery routes and assist in the delivery of meals to homebound meal recipients who opt to participate in the pilot program. Provides that at the option of a participating homebound meal recipient, a qualifying worker may remain with the recipient for up to 2 hours after meal delivery to provide an opportunity for social engagement and interaction. Provides that a direct support professional shall travel with and supervise all deliveries made by a worker whose disability makes the worker less independent. Sets forth qualification requirements under the program for workers with disabilities. Provides that all workers with disabilities selected to participate in the pilot program shall be compensated at a rate level consistent with those wage standards applied for workers engaged in competitive integrated employment as defined in the federal Workforce Innovation and Opportunity Act and the Rehabilitation Act of 1973. Requires community agencies selected to receive grant funding under the pilot program to have active or pending subminimum wage certificates authorized under Section 14(c) of the federal Fair Labor Standards Act of 1938 and meet any other eligibility requirements established by the Department by rule. Requires the Department to conduct annual surveys during the duration of the pilot program on participating homebound meal recipients and workers with disabilities to gauge such participants' overall satisfaction with the pilot program and to document any other additional benefits to program participants. Effective July 1, 2025."}], "other_titles": [], "other_identifiers": [], "actions": [{"description": "Filed with the Clerk by Rep. Charles Meier", "date": "2025-01-21", "organization_id": "~{\"classification\": \"lower\"}", "classification": ["filing"], "related_entities": []}, {"description": "First Reading", "date": "2025-01-28", "organization_id": "~{\"classification\": \"lower\"}", "classification": ["reading-1"], "related_entities": []}, {"description": "Referred to Rules Committee", "date": "2025-01-28", "organization_id": "~{\"classification\": \"lower\"}", "classification": [], "related_entities": []}, {"description": "Assigned to Appropriations-Health and Human Services Committee", "date": "2025-02-18", "organization_id": "~{\"classification\": \"lower\"}", "classification": ["referral-committee"], "related_entities": []}, {"description": "Rule 19(a) / Re-referred to Rules Committee", "date": "2025-03-21", "organization_id": "~{\"classification\": \"lower\"}", "classification": [], "related_entities": []}], "sponsorships": [{"name": "Charles Meier", "classification": "primary", "entity_type": "person", "primary": true, "person_id": "~{\"chamber\": \"lower\", \"name\": \"Charles Meier\"}", "organization_id": null}], "related_bills": [], "versions": [{"note": "Introduced", "links": [{"url": "https://beta.ilga.gov/documents/legislation/104/HB/PDF/10400HB1562.pdf", "media_type": "application/pdf"}, {"url": "https://beta.ilga.gov/Legislation/BillStatus/FullText?LegDocId=197445&DocName=10400HB1562&DocNum=1562&DocTypeID=HB&LegID=157655&GAID=18&SessionID=114&SpecSess=&Session=&Print=1", "media_type": "text/html"}], "date": "", "classification": ""}], "documents": [], "citations": [], "sources": [{"url": "https://beta.ilga.gov/Legislation/BillStatus?DocNum=1562&GAID=18&DocTypeID=HB&LegId=157655&SessionID=114", "note": ""}], "extras": {}, "_id": "32be0d9e-1728-11f0-9eaa-86812f74cec2"}