{"legislative_session": "104th", "identifier": "HB2411", "title": "TINY HOMES ACT", "from_organization": "~{\"classification\": \"lower\"}", "classification": ["bill"], "subject": [], "abstracts": [{"note": "", "abstract": "Creates the Tiny Homes Act. Prohibits a person, firm, or corporation from establishing, maintaining, or operating a tiny home park without a license from the Illinois Housing Development Authority. Sets forth application and permit requirements. Provides that an annual license fee shall be $500, plus an additional $50 for each tiny home site in the tiny home park. Allows the Authority to revoke or suspend a license granted under the Act. Prohibits a person, firm, corporation, limited liability company, trust, or other business entity from constructing a tiny home park without first obtaining a permit to do so. Describes requirements concerning the maintenance and operation of a tiny home park, including: provisions requiring management of the tiny home park by a responsible individual; drainage and water supply requirements; setback requirements and limits on tiny home size; requirements concerning the provision of safe and sanitary water, sewage disposal service, garbage service, insect and rodent control services, and fire extinguishers; requirements concerning construction of auxiliary rooms; requirements concerning street maintenance; requirements concerning sanitary, electrical, and safety appliances; requirements concerning electrical outlets; and requirements concerning fire safety. Requires the Authority to maintain records of all tiny home parks. Allows counties or municipalities to provide for licensing of tiny homes within their corporate limits in a manner consistent with the Act. Preempts home rule powers. Allows the Authority to enforce the Act. Requires the Authority to inspect each tiny home park at least once a year. Allows the Authority to adopt rules to carry out the Act. Allows the Authority to assess civil penalties for violations of fire safety provisions in the amount of $500 per day. Sets forth hearing procedures for any person who is refused a permit to construct or license to operate a tiny home park or for any person who has had a permit to construct or a license to operate a tiny home park revoked or suspended."}], "other_titles": [], "other_identifiers": [], "actions": [{"description": "Filed with the Clerk by Rep. Joyce Mason", "date": "2025-01-31", "organization_id": "~{\"classification\": \"lower\"}", "classification": ["filing"], "related_entities": []}, {"description": "First Reading", "date": "2025-02-04", "organization_id": "~{\"classification\": \"lower\"}", "classification": ["reading-1"], "related_entities": []}, {"description": "Referred to Rules Committee", "date": "2025-02-04", "organization_id": "~{\"classification\": \"lower\"}", "classification": [], "related_entities": []}, {"description": "Assigned to Housing Committee", "date": "2025-02-25", "organization_id": "~{\"classification\": \"lower\"}", "classification": ["referral-committee"], "related_entities": []}, {"description": "Rule 19(a) / Re-referred to Rules Committee", "date": "2025-03-21", "organization_id": "~{\"classification\": \"lower\"}", "classification": [], "related_entities": []}], "sponsorships": [{"name": "Joyce Mason", "classification": "primary", "entity_type": "person", "primary": true, "person_id": "~{\"chamber\": \"lower\", \"name\": \"Joyce Mason\"}", "organization_id": null}], "related_bills": [], "versions": [{"note": "Introduced", "links": [{"url": "https://beta.ilga.gov/documents/legislation/104/HB/PDF/10400HB2411.pdf", "media_type": "application/pdf"}, {"url": "https://beta.ilga.gov/Legislation/BillStatus/FullText?LegDocId=199935&DocName=10400HB2411&DocNum=2411&DocTypeID=HB&LegID=160148&GAID=18&SessionID=114&SpecSess=&Session=&Print=1", "media_type": "text/html"}], "date": "", "classification": ""}], "documents": [], "citations": [], "sources": [{"url": "https://beta.ilga.gov/Legislation/BillStatus?DocNum=2411&GAID=18&DocTypeID=HB&LegId=160148&SessionID=114", "note": ""}], "extras": {}, "_id": "a4211d0a-1728-11f0-9eaa-86812f74cec2"}