{"legislative_session": "104th", "identifier": "SB2131", "title": "CD CORR-DOC FACILITY OPERATION", "from_organization": "~{\"classification\": \"upper\"}", "classification": ["bill"], "subject": [], "abstracts": [{"note": "", "abstract": "Amends the Unified Code of Corrections. Provides that the Department of Corrections shall furnish at each institution and facility of the Department that has as residents persons committed to the Department a scanner and copier to be placed in a room that is used to receive, sort, distribute, or inspect the mail of persons committed to the Department. Provides that the Department shall require each institution and facility of the Department that has as residents persons committed to the Department to have one or more canine drug detection teams for use in identifying illicit drugs in the incoming mail of persons committed to the Department. Provides that the chief administrative officer of an institution or facility of the Department may file a grievance following the overruling of a security determination or transfer decision by the Director of Corrections or a designee of the Director who is vested with authority to overrule decisions of the chief administrative officer. Establishes procedures for addressing those grievances. Provides that the Department of Corrections shall compile a report on a quarterly basis detailing all security determinations and transfer decisions made at the each institution or facility of the Department that were overruled by the Director of Corrections or a person or persons designated by the Director. Provides that the report shall include the title of the individual who overruled the decision of the institution or facility. Provides that all grievances and outcomes must be included in the quarterly report. Provides that the report shall be submitted to the General Assembly within 30 days following the end of each quarter. Provides that the first report shall be due within 30 days following the first full quarter after the effective date of the amendatory Act."}], "other_titles": [], "other_identifiers": [], "actions": [{"description": "Filed with Secretary by Sen. Chapin Rose", "date": "2025-02-07", "organization_id": "~{\"classification\": \"upper\"}", "classification": ["filing"], "related_entities": []}, {"description": "First Reading", "date": "2025-02-07", "organization_id": "~{\"classification\": \"upper\"}", "classification": ["reading-1"], "related_entities": []}, {"description": "Referred to Assignments", "date": "2025-02-07", "organization_id": "~{\"classification\": \"upper\"}", "classification": [], "related_entities": []}], "sponsorships": [{"name": "Chapin Rose", "classification": "primary", "entity_type": "person", "primary": true, "person_id": "~{\"chamber\": \"upper\", \"name\": \"Chapin Rose\"}", "organization_id": null}], "related_bills": [], "versions": [{"note": "Introduced", "links": [{"url": "https://beta.ilga.gov/documents/legislation/104/SB/PDF/10400SB2131.pdf", "media_type": "application/pdf"}, {"url": "https://beta.ilga.gov/Legislation/BillStatus/FullText?LegDocId=201486&DocName=10400SB2131&DocNum=2131&DocTypeID=SB&LegID=161698&GAID=18&SessionID=114&SpecSess=&Session=&Print=1", "media_type": "text/html"}], "date": "", "classification": ""}], "documents": [], "citations": [], "sources": [{"url": "https://beta.ilga.gov/Legislation/BillStatus?DocNum=2131&GAID=18&DocTypeID=SB&LegId=161698&SessionID=114", "note": ""}], "extras": {}, "_id": "be509bae-172a-11f0-9eaa-86812f74cec2"}