{"legislative_session": "104th", "identifier": "HB1143", "title": "ILLINOIS CURE ACT", "from_organization": "~{\"classification\": \"lower\"}", "classification": ["bill"], "subject": [], "abstracts": [{"note": "", "abstract": "Creates the Compassionate Use and Research of Entheogens Act. Establishes the Illinois Psilocybin Advisory Board. Provides a timeline for the Board. Provides that the Department of Public Health, the Department of Agriculture, the Department of Financial and Professional Regulation, the Illinois State Police, and the Department of Revenue may adopt rules and implement the Act. Provides for licensing to operate a service center, facilitate psilocybin services, manufacture psilocybin products, and test psilocybin products by certain State agencies, with certain requirements. Provides for the lawful manufacture, delivery, and possession of psilocybin products. Provides procedures for psilocybin services, including requirements for certain sessions, plans, and forms. Limits the sale of psilocybin products with certain restrictions. Provides for investigations and inspections under the Act. Provides for certain fees, fines, actions against a licensee, criminal penalties, and civil penalties for violations of the Act. Provides for administrative hearings and other requirements for disciplining an applicant or licensee. Provides requirements for psilocybin-producing fungi as a crop, food, or other commodity. Provides for labeling and packaging requirements. Imposes a tax on psilocybin. Establishes the Psilocybin Control and Regulation Fund and Illinois Psilocybin Fund as special funds in the State treasury. Limits home rule powers. Makes other provisions. Makes corresponding changes to the State Finance Act. Amends the Freedom of Information Act. Exempt certain correspondence and records under the Act. Amends the Illinois Independent Tax Tribunal Act of 2012. Adds the Act to the jurisdiction of the Tax Tribunal. Amends the Illinois Vehicle Code. Adds psilocybin or psilocin to the list of prohibited substances for a person driving or in actual physical control of a vehicle. Amends the Illinois Controlled Substances Act. Removes psilocybin or psilocybin products from the definition of \"Controlled Substance\". Removes psilocybin and psilocyn from the list of Schedule I controlled substances. Effective immediately."}], "other_titles": [], "other_identifiers": [], "actions": [{"description": "Prefiled with Clerk by Rep. La Shawn K. Ford", "date": "2025-01-04", "organization_id": "~{\"classification\": \"lower\"}", "classification": ["filing"], "related_entities": []}, {"description": "First Reading", "date": "2025-01-09", "organization_id": "~{\"classification\": \"lower\"}", "classification": ["reading-1"], "related_entities": []}, {"description": "Referred to Rules Committee", "date": "2025-01-09", "organization_id": "~{\"classification\": \"lower\"}", "classification": [], "related_entities": []}], "sponsorships": [{"name": "La Shawn K. Ford", "classification": "primary", "entity_type": "person", "primary": true, "person_id": "~{\"chamber\": \"lower\", \"name\": \"La Shawn K. Ford\"}", "organization_id": null}], "related_bills": [], "versions": [{"note": "Introduced", "links": [{"url": "https://beta.ilga.gov/documents/legislation/104/HB/PDF/10400HB1143.pdf", "media_type": "application/pdf"}, {"url": "https://beta.ilga.gov/Legislation/BillStatus/FullText?LegDocId=196646&DocName=10400HB1143&DocNum=1143&DocTypeID=HB&LegID=156880&GAID=18&SessionID=114&SpecSess=&Session=&Print=1", "media_type": "text/html"}], "date": "", "classification": ""}], "documents": [], "citations": [], "sources": [{"url": "https://beta.ilga.gov/Legislation/BillStatus?DocNum=1143&GAID=18&DocTypeID=HB&LegId=156880&SessionID=114", "note": ""}], "extras": {}, "_id": "fb54e18e-1727-11f0-9eaa-86812f74cec2"}