{"legislative_session": "104th", "identifier": "SB2416", "title": "WIND & SOLAR FACILITY DRAINAGE", "from_organization": "~{\"classification\": \"upper\"}", "classification": ["bill"], "subject": [], "abstracts": [{"note": "", "abstract": "Amends the Counties Code. Provides that a commercial wind energy facility or commercial solar energy facility proposed to be located on property in an unincorporated area of the county within the zoning jurisdiction of a municipality and located adjacent to the corporate boundary of a municipality shall either be annexed to the municipality or be subject to the municipality's zoning regulations. Provides factors for determining if a request for siting approval or a special use permit for a commercial wind energy facility or a commercial solar energy facility, or modification of an approved siting or special use permit, is in compliance with the standards and conditions imposed in the Code, the zoning ordinance adopted consistent with the Code, and the conditions imposed under State and federal statutes and regulations. Provides that a county may not approve a request for siting approval or a special use permit for a commercial wind energy facility or a commercial solar energy facility or modification of an approved siting or special use permit, if the proposal shall disturb more than one acre of land, unless the facility owner has obtained a National Pollution Discharge Elimination System (\"NPDES\") permit from the Illinois Environmental Protection Agency. Requires a facility owner to provide the county in which a commercial solar energy facility or commercial wind energy facility to be located, a deconstruction plan that has been prepared by a professional engineer who has been selected by the facility owner. Provides that, based on an initial evaluation or reevaluation during the county approval process, the county may require changes in the level of financial assurance used to calculate the financial assurance level from the facility owner. Amends the Renewable Energy Facilities Agricultural Impact Mitigation Act. Provides that the standard agricultural impact mitigation agreements shall be amended as needed to conform with the financial assurance procedures and requirements under specified provisions of the Counties Code. Makes other changes."}], "other_titles": [], "other_identifiers": [], "actions": [{"description": "Filed with Secretary by Sen. Emil Jones, III", "date": "2025-02-07", "organization_id": "~{\"classification\": \"upper\"}", "classification": ["filing"], "related_entities": []}, {"description": "First Reading", "date": "2025-02-07", "organization_id": "~{\"classification\": \"upper\"}", "classification": ["reading-1"], "related_entities": []}, {"description": "Referred to Assignments", "date": "2025-02-07", "organization_id": "~{\"classification\": \"upper\"}", "classification": [], "related_entities": []}, {"description": "Added as Co-Sponsor Sen. Chris Balkema", "date": "2025-03-04", "organization_id": "~{\"classification\": \"upper\"}", "classification": [], "related_entities": []}], "sponsorships": [{"name": "Emil Jones, III", "classification": "primary", "entity_type": "person", "primary": true, "person_id": "~{\"chamber\": \"upper\", \"name\": \"Emil Jones, III\"}", "organization_id": null}, {"name": "Chris Balkema", "classification": "cosponsor", "entity_type": "person", "primary": false, "person_id": "~{\"chamber\": \"upper\", \"name\": \"Chris Balkema\"}", "organization_id": null}], "related_bills": [], "versions": [{"note": "Introduced", "links": [{"url": "https://beta.ilga.gov/documents/legislation/104/SB/PDF/10400SB2416.pdf", "media_type": "application/pdf"}, {"url": "https://beta.ilga.gov/Legislation/BillStatus/FullText?LegDocId=202228&DocName=10400SB2416&DocNum=2416&DocTypeID=SB&LegID=162443&GAID=18&SessionID=114&SpecSess=&Session=&Print=1", "media_type": "text/html"}], "date": "", "classification": ""}], "documents": [], "citations": [], "sources": [{"url": "https://beta.ilga.gov/Legislation/BillStatus?DocNum=2416&GAID=18&DocTypeID=SB&LegId=162443&SessionID=114", "note": ""}], "extras": {}, "_id": "e4ef7f5a-172a-11f0-9eaa-86812f74cec2"}