{"legislative_session": "104th", "identifier": "HB3484", "title": "DNR-BOAT REGISTRATION/SAFETY", "from_organization": "~{\"classification\": \"lower\"}", "classification": ["bill"], "subject": [], "abstracts": [{"note": "", "abstract": "Amends the Boat Registration and Safety Act. Prohibits a person from falsifying information on any application to the Department of Natural Resources that is required to be provided to the Department by the Act. Provides that the navigation lights shall, at minimum, have an intensity so as to be visible at the minimum ranges as set forth in the Code of Federal Regulations. Provides that it is unlawful to operate a motorboat without a whistle, horn, or other appliance capable of producing a blast of 2 seconds or more duration and having an audible distance as set forth in the Code of Federal Regulations (rather than being audible for at least one-half mile). Prohibits a motorboat operator from operating a motorboat less than 26 feet in length that is equipped by the manufacturer with an engine cutoff switch if the switch is not in use while the motorboat is operating on plane or above displacement speed. Prohibits a person from operating a watercraft without first verifying that the engine cut-off switch is operational and fully functional and properly attaching the lanyard or wireless attachment to the operator's body or to the clothing or personal flotation device being worn by the operator. Provides that a power-driven vessel operating in narrow channels and proceeding downbound with a following current (rather than downstream) shall have the right-of-way over an upbound vessel, shall propose the manner and place of passage, and shall imitate the maneuvering signals as required by law. Changes the ages at which a person may operate a motorboat based on the speed of the motorboat. Prohibits certain marijuana use within certain areas of a watercraft while upon waters in the State. Requires the Department to outline the application process for passenger-for-hire licenses or rental boat licenses by administrative rule. Makes other changes."}], "other_titles": [], "other_identifiers": [], "actions": [{"description": "Filed with the Clerk by Rep. Michael J. Kelly", "date": "2025-02-07", "organization_id": "~{\"classification\": \"lower\"}", "classification": ["filing"], "related_entities": []}, {"description": "First Reading", "date": "2025-02-18", "organization_id": "~{\"classification\": \"lower\"}", "classification": ["reading-1"], "related_entities": []}, {"description": "Referred to Rules Committee", "date": "2025-02-18", "organization_id": "~{\"classification\": \"lower\"}", "classification": [], "related_entities": []}], "sponsorships": [{"name": "Michael J. Kelly", "classification": "primary", "entity_type": "person", "primary": true, "person_id": "~{\"chamber\": \"lower\", \"name\": \"Michael J. Kelly\"}", "organization_id": null}], "related_bills": [], "versions": [{"note": "Introduced", "links": [{"url": "https://beta.ilga.gov/documents/legislation/104/HB/PDF/10400HB3484.pdf", "media_type": "application/pdf"}, {"url": "https://beta.ilga.gov/Legislation/BillStatus/FullText?LegDocId=201932&DocName=10400HB3484&DocNum=3484&DocTypeID=HB&LegID=162144&GAID=18&SessionID=114&SpecSess=&Session=&Print=1", "media_type": "text/html"}], "date": "", "classification": ""}], "documents": [], "citations": [], "sources": [{"url": "https://beta.ilga.gov/Legislation/BillStatus?DocNum=3484&GAID=18&DocTypeID=HB&LegId=162144&SessionID=114", "note": ""}], "extras": {}, "_id": "2f8a9b00-1729-11f0-9eaa-86812f74cec2"}