{"legislative_session": "104th", "identifier": "SB299", "title": "REINSTATE DEATH PENALTY", "from_organization": "~{\"classification\": \"upper\"}", "classification": ["bill"], "subject": [], "abstracts": [{"note": "", "abstract": "Creates the Capital Crimes Litigation Act of 2025. Provides that if an indigent defendant is charged with an offense for which a sentence of death is authorized, and the State's Attorney has not, at or before arraignment, filed a certificate indicating he or she will not seek the death penalty or stated on the record in open court that the death penalty will not be sought, the trial court shall immediately appoint the Public Defender, or any other qualified attorney or attorneys as the Illinois Supreme Court shall by rule provide, to represent the defendant as trial counsel. Creates the Capital Litigation Trust Fund. Provides that moneys deposited into the Trust Fund shall be used exclusively for the purposes of providing funding for the prosecution and defense of capital cases and for providing funding for post-conviction proceedings. Amends the State Finance Act. Repeals the Death Penalty Abolition Fund and reinstates the Capital Litigation Trust Fund. Amends the Unified Code of Corrections. Reinstates the death penalty if: (1) the murdered individual was a peace officer, fireman, an emergency medical technician - ambulance, emergency medical technician - intermediate, emergency medical technician - paramedic, ambulance driver, or other medical assistance or first aid personnel, employed by a municipality or other governmental unit killed in the course of performing his or her official duties, to prevent the performance of his or her official duties, or in retaliation for performing his or her official duties, and the defendant knew or should have known that the murdered individual was a peace officer or fireman; or (2) the murdered individual was an employee of an institution or facility of the Department of Corrections, or any similar local correctional agency, killed in the course of performing his or her official duties, to prevent the performance of his or her official duties, or in retaliation for performing his or her official duties. Amends the Freedom of Information Act, the Code of Criminal Procedure of 1963, and the State Appellate Defender Act to make conforming changes."}], "other_titles": [], "other_identifiers": [], "actions": [{"description": "Filed with Secretary by Sen. Neil Anderson", "date": "2025-01-24", "organization_id": "~{\"classification\": \"upper\"}", "classification": ["filing"], "related_entities": []}, {"description": "First Reading", "date": "2025-01-24", "organization_id": "~{\"classification\": \"upper\"}", "classification": ["reading-1"], "related_entities": []}, {"description": "Referred to Assignments", "date": "2025-01-24", "organization_id": "~{\"classification\": \"upper\"}", "classification": [], "related_entities": []}, {"description": "Added as Co-Sponsor Sen. Dave Syverson", "date": "2025-02-11", "organization_id": "~{\"classification\": \"upper\"}", "classification": [], "related_entities": []}], "sponsorships": [{"name": "Neil Anderson", "classification": "primary", "entity_type": "person", "primary": true, "person_id": "~{\"chamber\": \"upper\", \"name\": \"Neil Anderson\"}", "organization_id": null}, {"name": "Dave Syverson", "classification": "cosponsor", "entity_type": "person", "primary": false, "person_id": "~{\"chamber\": \"upper\", \"name\": \"Dave Syverson\"}", "organization_id": null}], "related_bills": [], "versions": [{"note": "Introduced", "links": [{"url": "https://beta.ilga.gov/documents/legislation/104/SB/PDF/10400SB0299.pdf", "media_type": "application/pdf"}, {"url": "https://beta.ilga.gov/Legislation/BillStatus/FullText?LegDocId=197544&DocName=10400SB0299&DocNum=299&DocTypeID=SB&LegID=157754&GAID=18&SessionID=114&SpecSess=&Session=&Print=1", "media_type": "text/html"}], "date": "", "classification": ""}], "documents": [], "citations": [], "sources": [{"url": "https://beta.ilga.gov/Legislation/BillStatus?DocNum=299&GAID=18&DocTypeID=SB&LegId=157754&SessionID=114", "note": ""}], "extras": {}, "_id": "bddadd20-1729-11f0-9eaa-86812f74cec2"}