{"legislative_session": "104th", "identifier": "SB1778", "title": "FAIR CONTRACTING-VARIOUS", "from_organization": "~{\"classification\": \"upper\"}", "classification": ["bill"], "subject": [], "abstracts": [{"note": "", "abstract": "Amends the State Comptroller Act. Provides an exception for vendors to receive payment by non-electronic means. Provides that outstanding liabilities as of June 30, payable from appropriations which have otherwise expired and interest penalties payable on those liabilities under the State Prompt Payment Act, may be paid out of the expiring appropriations during the 4-month period ending at the close of business on October 31 of each year, without regard to the fiscal year in which the payment is made. Amends the Prompt Payment Act. Removes provisions concerning payments made under the Public Aid Code. Provides that when a State official or agency responsible for administering a contract receives a bill or invoice from a contractor, that State official or agency shall electronically confirm the date on which the bill or invoice was received within 5 business days of receipt, and shall transmit any approved amount to the Comptroller within 30 days of receipt. Amends the Grant Accountability and Transparency Act to make conforming changes. Amends the Court of Claims Act. Provides that all claims against the State founded upon any contract entered into with the State of Illinois, except that undisputed individual claims below $2,500 resulting from lapsed appropriations do not fall under the jurisdiction of Court of Claims. State agencies may pay undisputed individual claims below $2,500 resulting from lapsed appropriations from current fiscal year appropriations. Sets forth that the provisions are not intended to prohibit more frequent reporting to assess items such as service needs, gaps, or capacity. Sets forth other provisions concerning grant agreement specifications, separate accounts for State grant funds, expenditures prior to grant execution and reporting requirements."}], "other_titles": [], "other_identifiers": [], "actions": [{"description": "Filed with Secretary by Sen. Michael W. Halpin", "date": "2025-02-06", "organization_id": "~{\"classification\": \"upper\"}", "classification": ["filing"], "related_entities": []}, {"description": "First Reading", "date": "2025-02-06", "organization_id": "~{\"classification\": \"upper\"}", "classification": ["reading-1"], "related_entities": []}, {"description": "Referred to Assignments", "date": "2025-02-06", "organization_id": "~{\"classification\": \"upper\"}", "classification": [], "related_entities": []}], "sponsorships": [{"name": "Michael W. Halpin", "classification": "primary", "entity_type": "person", "primary": true, "person_id": "~{\"chamber\": \"upper\", \"name\": \"Michael W. Halpin\"}", "organization_id": null}], "related_bills": [], "versions": [{"note": "Introduced", "links": [{"url": "https://beta.ilga.gov/documents/legislation/104/SB/PDF/10400SB1778.pdf", "media_type": "application/pdf"}, {"url": "https://beta.ilga.gov/Legislation/BillStatus/FullText?LegDocId=200711&DocName=10400SB1778&DocNum=1778&DocTypeID=SB&LegID=160924&GAID=18&SessionID=114&SpecSess=&Session=&Print=1", "media_type": "text/html"}], "date": "", "classification": ""}], "documents": [], "citations": [], "sources": [{"url": "https://beta.ilga.gov/Legislation/BillStatus?DocNum=1778&GAID=18&DocTypeID=SB&LegId=160924&SessionID=114", "note": ""}], "extras": {}, "_id": "8f19f8c6-172a-11f0-9eaa-86812f74cec2"}