{"legislative_session": "104th", "identifier": "SB1753", "title": "ENSURING ESSENTIAL SERVICES", "from_organization": "~{\"classification\": \"upper\"}", "classification": ["bill"], "subject": [], "abstracts": [{"note": "", "abstract": "Creates the Ensuring Essential Services Act. Provides that the purpose of the Act is to ensure the State meets its obligation to provide certain essential services for individuals with developmental disabilities at consistent quality levels in accordance with its waiver agreement with the Centers for Medicare and Medicaid Services, all while allocating scarce taxpayer resources. Provides that any contract entered into between the Department of Human Services and an agency shall include a provision assuring the State of the uninterrupted delivery of the contracted-for services. Provides that such assurance shall provide that the agency has entered into a binding labor peace agreement with any labor organization that is the exclusive representative of the agency's frontline and direct support staff or, where no exclusive representation has been established, that the agency has or will enter into an agreement with any labor organization that seeks to become the agency's frontline and direct support staff's exclusive representative. Provides that the assurance shall become a condition of any contract entered into, renewed, or amended on or after the effective date of the Act. Requires the Department of Healthcare and Family Services to, no later than 90 days after the effective date of the Act, apply to the Centers for Medicare and Medicaid Services for a waiver or State Plan amendment to allow implementation of the contracting requirements. Requires the Department of Human Services, no later than 60 days after the effective date of the Act, to adopt rules implementing the requirements of the Act. Contains provisions on contract requirements for Department of Human Services' contracts; enforcement of contractual assurances; remedial actions for noncompliance; and other matters. Effective June 1, 2025."}], "other_titles": [], "other_identifiers": [], "actions": [{"description": "Filed with Secretary by Sen. Javier L. Cervantes", "date": "2025-02-05", "organization_id": "~{\"classification\": \"upper\"}", "classification": ["filing"], "related_entities": []}, {"description": "First Reading", "date": "2025-02-05", "organization_id": "~{\"classification\": \"upper\"}", "classification": ["reading-1"], "related_entities": []}, {"description": "Referred to Assignments", "date": "2025-02-05", "organization_id": "~{\"classification\": \"upper\"}", "classification": [], "related_entities": []}], "sponsorships": [{"name": "Javier L. Cervantes", "classification": "primary", "entity_type": "person", "primary": true, "person_id": "~{\"chamber\": \"upper\", \"name\": \"Javier L. Cervantes\"}", "organization_id": null}], "related_bills": [], "versions": [{"note": "Introduced", "links": [{"url": "https://beta.ilga.gov/documents/legislation/104/SB/PDF/10400SB1753.pdf", "media_type": "application/pdf"}, {"url": "https://beta.ilga.gov/Legislation/BillStatus/FullText?LegDocId=200613&DocName=10400SB1753&DocNum=1753&DocTypeID=SB&LegID=160826&GAID=18&SessionID=114&SpecSess=&Session=&Print=1", "media_type": "text/html"}], "date": "", "classification": ""}], "documents": [], "citations": [], "sources": [{"url": "https://beta.ilga.gov/Legislation/BillStatus?DocNum=1753&GAID=18&DocTypeID=SB&LegId=160826&SessionID=114", "note": ""}], "extras": {}, "_id": "8bb7b344-172a-11f0-9eaa-86812f74cec2"}