{"legislative_session": "104th", "identifier": "HB1717", "title": "CRIMINAL FORFEITURE-REPORTING", "from_organization": "~{\"classification\": \"lower\"}", "classification": ["bill"], "subject": [], "abstracts": [{"note": "", "abstract": "Creates the Seizure and Forfeiture Reporting Act of 2025. Provides that the Illinois Criminal Justice Information Authority shall establish and maintain a case tracking system and searchable public website that includes information about property seized and forfeited under State law and under any agreement with the federal government. Provides that it shall assign the responsibility to report each element to relevant agencies. Provides that the Authority shall also establish and maintain a searchable public website that includes the total amount of funds expended, in specified categories, which resulted from property seized, forfeited, and reported and the total value of seized and forfeited property held by the agency at the end of the reporting period. Provides that the Authority shall not require or disclose: (1) the names, addresses, contact information, or other personally identifying information of owners, other persons, or business entities or (2) the street addresses, vehicle identification number, or serial number of any conveyance. Provides that agencies that fully comply with reporting requirements within the designated timeframe shall be eligible for State recognition and additional funding opportunities through the Authority. Provides that the Authority shall make no disbursement of forfeiture proceeds to an agency or department unless the agency or department meets its reporting obligation. Provides that the Act is effective for the reporting period starting January 1, 2027. Creates the Criminal Forfeiture Process Act. Provides that the Act applies to the seizure and forfeiture of property used in and derived directly from specified crimes. Provides that for property to be forfeited before conviction, the State must demonstrate by clear and convincing evidence that the property is directly linked to the criminal offense, and that immediate seizure is necessary to prevent its loss, destruction, or further use in criminal activity. Repeals the Seizure and Forfeiture Reporting Act, the Drug Asset Forfeiture Procedure Act, and the Forfeiture Article of the Code of Criminal Procedure of 1963. Amends various other Acts to make conforming changes."}], "other_titles": [], "other_identifiers": [], "actions": [{"description": "Filed with the Clerk by Rep. Jed Davis", "date": "2025-01-24", "organization_id": "~{\"classification\": \"lower\"}", "classification": ["filing"], "related_entities": []}, {"description": "First Reading", "date": "2025-01-28", "organization_id": "~{\"classification\": \"lower\"}", "classification": ["reading-1"], "related_entities": []}, {"description": "Referred to Rules Committee", "date": "2025-01-28", "organization_id": "~{\"classification\": \"lower\"}", "classification": [], "related_entities": []}], "sponsorships": [{"name": "Jed Davis", "classification": "primary", "entity_type": "person", "primary": true, "person_id": "~{\"chamber\": \"lower\", \"name\": \"Jed Davis\"}", "organization_id": null}], "related_bills": [], "versions": [{"note": "Introduced", "links": [{"url": "https://beta.ilga.gov/documents/legislation/104/HB/PDF/10400HB1717.pdf", "media_type": "application/pdf"}, {"url": "https://beta.ilga.gov/Legislation/BillStatus/FullText?LegDocId=198666&DocName=10400HB1717&DocNum=1717&DocTypeID=HB&LegID=158876&GAID=18&SessionID=114&SpecSess=&Session=&Print=1", "media_type": "text/html"}], "date": "", "classification": ""}], "documents": [], "citations": [], "sources": [{"url": "https://beta.ilga.gov/Legislation/BillStatus?DocNum=1717&GAID=18&DocTypeID=HB&LegId=158876&SessionID=114", "note": ""}], "extras": {}, "_id": "46e68d78-1728-11f0-9eaa-86812f74cec2"}