{"legislative_session": "104th", "identifier": "SB2257", "title": "CD CORR-SENTENCE CREDITS", "from_organization": "~{\"classification\": \"upper\"}", "classification": ["bill"], "subject": [], "abstracts": [{"note": "", "abstract": "Amends the Unified Code of Corrections. Changes the sentence credits of committed persons serving a term of imprisonment in the Department of Corrections for various offenses. Provides that the sentence credit allotments shall apply to committed persons incarcerated before the effective date of the amendatory Act, and the Department of Corrections shall award sentence credit for periods of incarceration prior to the effective date of the amendatory Act accordingly. Provides that committed persons who wish to receive sentence credit for educational, vocational, substance abuse, behavior modification programs, life skills courses, re-entry planning, and correctional industry programs accumulated prior to the effective date of the amendatory Act in an amount specified in the provision to a committed person serving a sentence for an offense committed after June 19, 1998, if the Department determines that the committed person is entitled to this sentence credit, based upon: (1) documentation provided by the Department that the committed person engaged in any full-time substance abuse programs, correctional industry assignments, educational programs, behavior modification programs, life skills courses, or re-entry planning provided by the Department and satisfactorily completed the assigned program as determined by the standards of the Department during the committed person's current term of incarceration; or (2) the committed person's own testimony in the form of an affidavit or documentation, or a third party's documentation or testimony in the form of an affidavit that the committed person likely engaged in any full-time substance abuse programs, correctional industry assignments, educational programs, behavior modification programs, life skills courses, or re-entry planning provided by the Department and satisfactorily completed the assigned program as determined by the standards of the Department during the committed person's current term of incarceration. Effective July 1, 2026."}], "other_titles": [], "other_identifiers": [], "actions": [{"description": "Filed with Secretary by Sen. Robert Peters", "date": "2025-02-07", "organization_id": "~{\"classification\": \"upper\"}", "classification": ["filing"], "related_entities": []}, {"description": "First Reading", "date": "2025-02-07", "organization_id": "~{\"classification\": \"upper\"}", "classification": ["reading-1"], "related_entities": []}, {"description": "Referred to Assignments", "date": "2025-02-07", "organization_id": "~{\"classification\": \"upper\"}", "classification": [], "related_entities": []}], "sponsorships": [{"name": "Robert Peters", "classification": "primary", "entity_type": "person", "primary": true, "person_id": "~{\"chamber\": \"upper\", \"name\": \"Robert Peters\"}", "organization_id": null}], "related_bills": [], "versions": [{"note": "Introduced", "links": [{"url": "https://beta.ilga.gov/documents/legislation/104/SB/PDF/10400SB2257.pdf", "media_type": "application/pdf"}, {"url": "https://beta.ilga.gov/Legislation/BillStatus/FullText?LegDocId=201818&DocName=10400SB2257&DocNum=2257&DocTypeID=SB&LegID=162030&GAID=18&SessionID=114&SpecSess=&Session=&Print=1", "media_type": "text/html"}], "date": "", "classification": ""}], "documents": [], "citations": [], "sources": [{"url": "https://beta.ilga.gov/Legislation/BillStatus?DocNum=2257&GAID=18&DocTypeID=SB&LegId=162030&SessionID=114", "note": ""}], "extras": {}, "_id": "cf997a34-172a-11f0-9eaa-86812f74cec2"}