{"legislative_session": "104th", "identifier": "SB2373", "title": "CRIM PRO-UNFIT DEFENDANT", "from_organization": "~{\"classification\": \"upper\"}", "classification": ["bill"], "subject": [], "abstracts": [{"note": "", "abstract": "Amends the Code of Criminal Procedure of 1963 concerning defendants found unfit to stand trial. Provides that if the defendant is remanded to the custody of the Department of Human Services for inpatient services, the defendant shall be placed in a secure setting. Provides that during the period of time required to determine bed and placement availability at the designated facility, the defendant shall remain in jail and the pretrial release provisions do not apply. Provides that no physician or other person employed by the Department of Human Services shall be ordered to perform, in the person's official capacity, an examination of the defendant's fitness. Provides that if the defendant with mental disabilities is ordered to outpatient treatment, the defendant shall be released from custody with instructions to contact the Department of Human Services to schedule the receipt of restoration services in the community. Provides that a defendant who either fails to arrange for the receipt of community restoration services or whom the Department reports has failed to comply in any other respect with the outpatient treatment order shall be remanded to the Department to receive inpatient services at a secure facility designated by the Department. Provides that the initial fitness report shall indicate what information, if any, contained in the report may be harmful to the mental condition of the defendant if made known to the defendant and the court may determine if the defendant is restricted from receiving the report. Provides that if the defendant is unfit due to a traumatic brain injury or organic brain disease such as Alzheimer's or dementia, or any other condition other than one treatable as a mental illness or developmental disability, the court may order the defendant placed in a suitable public or private treatment facility or program that has agreed to provide treatment to the defendant. Provides that no person who has not been determined to be unfit due to an identified condition may be placed in a facility operated by the Department of Human Services. Makes other changes. Defines terms."}], "other_titles": [], "other_identifiers": [], "actions": [{"description": "Filed with Secretary by Sen. Lakesia Collins", "date": "2025-02-07", "organization_id": "~{\"classification\": \"upper\"}", "classification": ["filing"], "related_entities": []}, {"description": "First Reading", "date": "2025-02-07", "organization_id": "~{\"classification\": \"upper\"}", "classification": ["reading-1"], "related_entities": []}, {"description": "Referred to Assignments", "date": "2025-02-07", "organization_id": "~{\"classification\": \"upper\"}", "classification": [], "related_entities": []}, {"description": "Added as Chief Co-Sponsor Sen. Graciela Guzmán", "date": "2025-02-21", "organization_id": "~{\"classification\": \"upper\"}", "classification": [], "related_entities": []}], "sponsorships": [{"name": "Lakesia Collins", "classification": "primary", "entity_type": "person", "primary": true, "person_id": "~{\"chamber\": \"upper\", \"name\": \"Lakesia Collins\"}", "organization_id": null}, {"name": "Graciela Guzmán", "classification": "cosponsor", "entity_type": "person", "primary": false, "person_id": "~{\"chamber\": \"upper\", \"name\": \"Graciela Guzm\\u00e1n\"}", "organization_id": null}], "related_bills": [], "versions": [{"note": "Introduced", "links": [{"url": "https://beta.ilga.gov/documents/legislation/104/SB/PDF/10400SB2373.pdf", "media_type": "application/pdf"}, {"url": "https://beta.ilga.gov/Legislation/BillStatus/FullText?LegDocId=202147&DocName=10400SB2373&DocNum=2373&DocTypeID=SB&LegID=162359&GAID=18&SessionID=114&SpecSess=&Session=&Print=1", "media_type": "text/html"}], "date": "", "classification": ""}], "documents": [], "citations": [], "sources": [{"url": "https://beta.ilga.gov/Legislation/BillStatus?DocNum=2373&GAID=18&DocTypeID=SB&LegId=162359&SessionID=114", "note": ""}], "extras": {}, "_id": "df2bb82c-172a-11f0-9eaa-86812f74cec2"}