{"legislative_session": "104th", "identifier": "SB1775", "title": "HEMP REGULATION REFORM", "from_organization": "~{\"classification\": \"upper\"}", "classification": ["bill"], "subject": [], "abstracts": [{"note": "", "abstract": "Amends the Illinois Food, Drug and Cosmetic Act. Provides that, notwithstanding any other provision of law, a food, food ingredient, dietary supplement, cosmetic, or other consumer product shall not be considered adulterated solely because it contains hemp, hemp-derived cannabinoids, including, but not limited to, Delta-9 tetrahydrocannabinol (THC), Delta-8 THC, tetrahydrocannabinolic acid (THCa), or any hemp product, provided that the hemp used in the product complies with the definition of \"hemp\" as specified in federal law. Amends the Industrial Hemp Act. Conforms several provisions in the Act to federal regulations under the Domestic Hemp Production Program, including (i) definitions, (ii) requirements for the application for a license to cultivate hemp, and (iii) rulemaking requirements for the Department of Agriculture. Provides that the Department of Agriculture shall adopt rules for the distribution and retail sale of hemp products under conditions in specified provisions of the Act. Provides that hemp products that contain cannabinoids, that are intended for human consumption, and that are designated for retail sale within Illinois (i) must meet specified requirements, including federal requirements and rules adopted by the Department of Public Health, and (ii) must be distributed or sold in a container that includes specified information. Provides that hemp products that are intended for inhalation or ingestion and contain detectable amounts of hemp cannabinoids may not be sold in this State to a person who is under 21 years of age. Provides that hemp products distributed or sold in violation of specified provisions in the Act shall be considered adulterated or misbranded pursuant to the Illinois Food, Drug and Cosmetic Act and all other applicable State laws. Defines terms. Makes technical changes."}], "other_titles": [], "other_identifiers": [], "actions": [{"description": "Filed with Secretary by Sen. Willie Preston", "date": "2025-02-06", "organization_id": "~{\"classification\": \"upper\"}", "classification": ["filing"], "related_entities": []}, {"description": "First Reading", "date": "2025-02-06", "organization_id": "~{\"classification\": \"upper\"}", "classification": ["reading-1"], "related_entities": []}, {"description": "Referred to Assignments", "date": "2025-02-06", "organization_id": "~{\"classification\": \"upper\"}", "classification": [], "related_entities": []}], "sponsorships": [{"name": "Willie Preston", "classification": "primary", "entity_type": "person", "primary": true, "person_id": "~{\"chamber\": \"upper\", \"name\": \"Willie Preston\"}", "organization_id": null}], "related_bills": [], "versions": [{"note": "Introduced", "links": [{"url": "https://beta.ilga.gov/documents/legislation/104/SB/PDF/10400SB1775.pdf", "media_type": "application/pdf"}, {"url": "https://beta.ilga.gov/Legislation/BillStatus/FullText?LegDocId=200705&DocName=10400SB1775&DocNum=1775&DocTypeID=SB&LegID=160918&GAID=18&SessionID=114&SpecSess=&Session=&Print=1", "media_type": "text/html"}], "date": "", "classification": ""}], "documents": [], "citations": [], "sources": [{"url": "https://beta.ilga.gov/Legislation/BillStatus?DocNum=1775&GAID=18&DocTypeID=SB&LegId=160918&SessionID=114", "note": ""}], "extras": {}, "_id": "8ea86652-172a-11f0-9eaa-86812f74cec2"}