{"legislative_session": "104th", "identifier": "SB2115", "title": "HOUSE ILLINOIS FAMILIES ACT", "from_organization": "~{\"classification\": \"upper\"}", "classification": ["bill"], "subject": [], "abstracts": [{"note": "", "abstract": "Creates the House Illinois Families Act. Imposes on each applicable taxpayer an annual tax of 10% of the property value for each single-family residence that the applicable taxpayer owns in excess of 25 single-family residences. Provides that \"applicable taxpayer\" means a taxpayer that is not any of the following: (i) a mortgage note holder that owns a single-family residence through foreclosure; (ii) an organization that is described in Section 501(c)(3) of the Internal Revenue Code and exempt from tax under Section 501(a); (iii) an organization primarily engaged in the construction or rehabilitation of single-family residences; or (v) a person who owns federally subsidized housing. Defines \"single-family residence\" as residential property consisting of not more than 4 dwelling units. Provides that this tax must be deposited into the Illinois Affordable Housing Trust Fund to fund housing programs for justice involved individuals and provide rental and mortgage assistance. Requires an applicable taxpayer to report to the Department of Revenue information about applicable single-family residences. Imposes a penalty of $50,000 for failure to comply with these notice provisions. Provides that the applicable taxpayer must give notice to each tenant of a single-family residence of the taxpayer's intent to sell this residence. Provides the tenant with a right of first refusal in which the tenant has the right to purchase the property to continue to live there as a residence. Creates a process for the tenant to purchase the single-family residence. Amends the Illinois Affordable Housing Act. Allows the Trust Fund in that Act to receive moneys that are designated for deposit into the Trust Fund as provided in the House Illinois Families Act. Makes other changes. Effective immediately."}], "other_titles": [], "other_identifiers": [], "actions": [{"description": "Filed with Secretary by Sen. Willie Preston", "date": "2025-02-07", "organization_id": "~{\"classification\": \"upper\"}", "classification": ["filing"], "related_entities": []}, {"description": "First Reading", "date": "2025-02-07", "organization_id": "~{\"classification\": \"upper\"}", "classification": ["reading-1"], "related_entities": []}, {"description": "Referred to Assignments", "date": "2025-02-07", "organization_id": "~{\"classification\": \"upper\"}", "classification": [], "related_entities": []}], "sponsorships": [{"name": "Willie Preston", "classification": "primary", "entity_type": "person", "primary": true, "person_id": "~{\"chamber\": \"upper\", \"name\": \"Willie Preston\"}", "organization_id": null}], "related_bills": [], "versions": [{"note": "Introduced", "links": [{"url": "https://beta.ilga.gov/documents/legislation/104/SB/PDF/10400SB2115.pdf", "media_type": "application/pdf"}, {"url": "https://beta.ilga.gov/Legislation/BillStatus/FullText?LegDocId=201438&DocName=10400SB2115&DocNum=2115&DocTypeID=SB&LegID=161650&GAID=18&SessionID=114&SpecSess=&Session=&Print=1", "media_type": "text/html"}], "date": "", "classification": ""}], "documents": [], "citations": [], "sources": [{"url": "https://beta.ilga.gov/Legislation/BillStatus?DocNum=2115&GAID=18&DocTypeID=SB&LegId=161650&SessionID=114", "note": ""}], "extras": {}, "_id": "bc441994-172a-11f0-9eaa-86812f74cec2"}