{"legislative_session": "104th", "identifier": "SB1727", "title": "SPARKLER EXCISE TAX ACT", "from_organization": "~{\"classification\": \"upper\"}", "classification": ["bill"], "subject": [], "abstracts": [{"note": "", "abstract": "Creates the Ground-Based Sparkler Purchaser Excise Tax Act. Imposes a tax, beginning July 1, 2025, upon purchasers for the privilege of using ground-based sparklers and not for the purpose of resale at the rate of 6% of the purchase price of ground-based sparklers. Prohibits certain retail combinations or bundles. Requires every retailer required to collect the tax to apply to the Department of Revenue for a certificate of registration. Provides that any retailer required to collect the tax shall be liable to the Department for the tax, whether the tax has been collected, and any such tax shall constitute a debt to the State. Provides for the making of returns. Provides that from the revenue collected, the Department shall pay 25% into the Fireman's Annuity and Benefit Fund, 25% into the Firefighters' Pension Investment Fund, and 50% into the General Revenue Fund. Provides for recordkeeping requirements. Establishes penalties for violations of the Act. Provides that the Department shall have full power to administer and enforce the Act. Allows for the arrest of any person who violates the Act, the search of any place of business to inspect all ground-based sparklers, and the seizure of any ground based-sparklers without a warrant. Sets forth hearing requirements after seizure. Allows the Department to adopt rules. Amends the Fireworks Regulation Act of Illinois. Allows a municipality to prohibit the sale and use of ground-based sparklers on public property. Prohibits ground-based sparklers from being sold to a person under the age of 18 years. Amends the Pyrotechnic Use Act. Prohibits ground-based sparklers from being sold to a person under the age of 18 years. Effective July 1, 2025."}], "other_titles": [], "other_identifiers": [], "actions": [{"description": "Filed with Secretary by Sen. Napoleon Harris, III", "date": "2025-02-05", "organization_id": "~{\"classification\": \"upper\"}", "classification": ["filing"], "related_entities": []}, {"description": "First Reading", "date": "2025-02-05", "organization_id": "~{\"classification\": \"upper\"}", "classification": ["reading-1"], "related_entities": []}, {"description": "Referred to Assignments", "date": "2025-02-05", "organization_id": "~{\"classification\": \"upper\"}", "classification": [], "related_entities": []}], "sponsorships": [{"name": "Napoleon Harris, III", "classification": "primary", "entity_type": "person", "primary": true, "person_id": "~{\"chamber\": \"upper\", \"name\": \"Napoleon Harris, III\"}", "organization_id": null}], "related_bills": [], "versions": [{"note": "Introduced", "links": [{"url": "https://beta.ilga.gov/documents/legislation/104/SB/PDF/10400SB1727.pdf", "media_type": "application/pdf"}, {"url": "https://beta.ilga.gov/Legislation/BillStatus/FullText?LegDocId=200538&DocName=10400SB1727&DocNum=1727&DocTypeID=SB&LegID=160751&GAID=18&SessionID=114&SpecSess=&Session=&Print=1", "media_type": "text/html"}], "date": "", "classification": ""}], "documents": [], "citations": [], "sources": [{"url": "https://beta.ilga.gov/Legislation/BillStatus?DocNum=1727&GAID=18&DocTypeID=SB&LegId=160751&SessionID=114", "note": ""}], "extras": {}, "_id": "8833589a-172a-11f0-9eaa-86812f74cec2"}