{"legislative_session": "104th", "identifier": "HB3560", "title": "PUBLIC BANKING OPTION ACT", "from_organization": "~{\"classification\": \"lower\"}", "classification": ["bill"], "subject": [], "abstracts": [{"note": "", "abstract": "Creates the Public Banking Option Act. Establishes the Illinois Bank Account Board under the Department of Financial and Professional Regulation for the purpose of protecting consumers who lack access to traditional banking services from predatory, discriminatory, and costly alternatives. Sets forth provisions concerning the actions required by the Board to create the Illinois Bank Account Program, including establishing a process by which an individual may open an Illinois Bank Account, which shall be designed to maximize Program participation; the mechanisms by which an account holder may deposit funds into an Illinois Bank Account for no fee; a process through which an account holder may elect to have a portion, up to the entirety, of the account holder's paycheck or earnings due for labor or services performed directly deposited by electronic fund transfer into the account holder's Illinois Bank Account; a process through which employers and hiring entities shall be required to remit through a payroll direct deposit arrangement each worker's elected payroll contribution to the worker's Illinois Bank Account in accordance with the worker's election; and mechanisms by which an account holder can withdraw funds from an Illinois Bank Account using an Illinois Bank Account debit card for no fee; a process, available to all account holders for no fee, through which an account holder may arrange for payment to a registered payee using a preauthorized electronic fund transfer from an Illinois Bank Account; a process and terms and conditions for becoming a registered payee; voluntary automatic disbursement rules to assist an account holder in managing automated payments to registered payees based on the availability of funds in the account holder's account; and other specified actions. Establishes duties concerning the Program for employers with more than 25 employees, hiring entities with more than 25 independent contractors performing the same or similar labor or service, and landlords or a landlord's agent. Grants the Department rulemaking authority to implement the provisions of the Act. Effective immediately."}], "other_titles": [], "other_identifiers": [], "actions": [{"description": "Filed with the Clerk by Rep. Kevin John Olickal", "date": "2025-02-07", "organization_id": "~{\"classification\": \"lower\"}", "classification": ["filing"], "related_entities": []}, {"description": "First Reading", "date": "2025-02-18", "organization_id": "~{\"classification\": \"lower\"}", "classification": ["reading-1"], "related_entities": []}, {"description": "Referred to Rules Committee", "date": "2025-02-18", "organization_id": "~{\"classification\": \"lower\"}", "classification": [], "related_entities": []}, {"description": "Assigned to Financial Institutions and Licensing Committee", "date": "2025-03-11", "organization_id": "~{\"classification\": \"lower\"}", "classification": ["referral-committee"], "related_entities": []}, {"description": "Rule 19(a) / Re-referred to Rules Committee", "date": "2025-03-21", "organization_id": "~{\"classification\": \"lower\"}", "classification": [], "related_entities": []}], "sponsorships": [{"name": "Kevin John Olickal", "classification": "primary", "entity_type": "person", "primary": true, "person_id": "~{\"chamber\": \"lower\", \"name\": \"Kevin John Olickal\"}", "organization_id": null}], "related_bills": [], "versions": [{"note": "Introduced", "links": [{"url": "https://beta.ilga.gov/documents/legislation/104/HB/PDF/10400HB3560.pdf", "media_type": "application/pdf"}, {"url": "https://beta.ilga.gov/Legislation/BillStatus/FullText?LegDocId=202038&DocName=10400HB3560&DocNum=3560&DocTypeID=HB&LegID=162250&GAID=18&SessionID=114&SpecSess=&Session=&Print=1", "media_type": "text/html"}], "date": "", "classification": ""}], "documents": [], "citations": [], "sources": [{"url": "https://beta.ilga.gov/Legislation/BillStatus?DocNum=3560&GAID=18&DocTypeID=HB&LegId=162250&SessionID=114", "note": ""}], "extras": {}, "_id": "398c9702-1729-11f0-9eaa-86812f74cec2"}