{"legislative_session": "104th", "identifier": "HB3682", "title": "CANNABIS REFORM", "from_organization": "~{\"classification\": \"lower\"}", "classification": ["bill"], "subject": [], "abstracts": [{"note": "", "abstract": "Amends the Use Tax Act, the Service Use Tax Act, the Service Occupation Tax Act, and the Retailers' Occupation Tax Act. Provides that, beginning on July 1, 2025, \"prescription and nonprescription medicines and drugs\" includes cannabis purchased by a qualified registered patient, provisional patient, or designated caregiver from a dispensing organization registered under the Compassionate Use of Medical Cannabis Program Act or the Cannabis Regulation and Tax Act. Amends the Compassionate Use of Medical Cannabis Program Act. Adds, changes, and provides for the repeal of certain definitions. Makes conforming changes to terms in the Act. Sunsets certain provisions on June 30, 2025. Adds references to the Cannabis Regulation and Tax Act, supplanting certain provisions in the Act on July 1, 2025. Provides for repeal of certain provisions on January 1, 2026, subjecting certain activities to the Cannabis Regulation and Tax Act. Repeals certain provisions. Amends the Cannabis Regulation and Tax Act. Adds and changes definitions. Makes conforming changes to terms in the Act. Removes certain references and provides for repeal of certain provisions related to the Compassionate Use of Medical Cannabis Program Act. Makes provisions regarding mergers of certain licenses and medical patient prioritization. Provides for Adult Use Dispensing Organization licensee relocation. Provides for rescission of a conditional license, with certain requirements. Makes changes to provisions regarding Adult Use Dispensing Organization Licenses. Adds to requirements for Responsible Vendor Program Training modules. Adds new prohibitions and exceptions to provisions regarding changes to a dispensing organization. Requires prioritizing qualifying patients, provisional patients, and dedicated caregivers, with certain requirements. Adds certain State agencies and local health officials to provisions regarding investigations. Makes changes to provisions regarding Cultivation Center Licenses. Makes other changes."}], "other_titles": [], "other_identifiers": [], "actions": [{"description": "Filed with the Clerk by Rep. Bob Morgan", "date": "2025-02-07", "organization_id": "~{\"classification\": \"lower\"}", "classification": ["filing"], "related_entities": []}, {"description": "First Reading", "date": "2025-02-18", "organization_id": "~{\"classification\": \"lower\"}", "classification": ["reading-1"], "related_entities": []}, {"description": "Referred to Rules Committee", "date": "2025-02-18", "organization_id": "~{\"classification\": \"lower\"}", "classification": [], "related_entities": []}], "sponsorships": [{"name": "Bob Morgan", "classification": "primary", "entity_type": "person", "primary": true, "person_id": "~{\"chamber\": \"lower\", \"name\": \"Bob Morgan\"}", "organization_id": null}], "related_bills": [], "versions": [{"note": "Introduced", "links": [{"url": "https://beta.ilga.gov/documents/legislation/104/HB/PDF/10400HB3682.pdf", "media_type": "application/pdf"}, {"url": "https://beta.ilga.gov/Legislation/BillStatus/FullText?LegDocId=202270&DocName=10400HB3682&DocNum=3682&DocTypeID=HB&LegID=162485&GAID=18&SessionID=114&SpecSess=&Session=&Print=1", "media_type": "text/html"}], "date": "", "classification": ""}], "documents": [], "citations": [], "sources": [{"url": "https://beta.ilga.gov/Legislation/BillStatus?DocNum=3682&GAID=18&DocTypeID=HB&LegId=162485&SessionID=114", "note": ""}], "extras": {}, "_id": "49d703ea-1729-11f0-9eaa-86812f74cec2"}