{"legislative_session": "104th", "identifier": "SB2447", "title": "COURT FEES-VAROUS", "from_organization": "~{\"classification\": \"upper\"}", "classification": ["bill"], "subject": [], "abstracts": [{"note": "", "abstract": "Amends the State Finance Act. Requires the clerks of the court to remit a portion of filing and appearance fees to the State Treasurer for deposit into the Guardianship and Advocacy Fund. Increases various schedule fees. Creates fees for county law libraries, neutral site custody, dispute resolutions, and domestic relation legal fund. Amends the Clerks of Courts Act. Provides that no fee may be charged for accounts filed for guardianships established for disabled minors or adults. Eliminates a provision that unless a court-ordered payment schedule is implemented or the fee requirements of the provisions concerning circuit court clerks' fees are waived under a court order, the clerk of the circuit court may add to any unpaid fees and costs under this provision a delinquency amount equal to 5% of the unpaid fees that remain unpaid after 30 days, 10% of the unpaid fees that remain unpaid after 60 days, and 15% of the unpaid fees that remain unpaid after 90 days. Creates additional conditional assessments. Amends the Criminal and Traffic Assessment Act. Amends the Domestic Relations Legal Funding Act. Allows any county to enact a fee. Provides that conditional assessments include court-supervised service provider costs imposed in a case. Amends the Code of Criminal Procedure of 1963. Prohibits plea agreements that are conditioned upon a defendant giving up the right to seek as assessment waiver. Amends the Unified Code of Corrections. Provides that the court shall, without application, reduce the total amount of fines imposed on a defendant who is sentenced to a term of imprisonment, based upon the defendant's prison sentence. Amends the Counties Code, the Neutral Site Custody Exchange Funding Act, the Illinois Municipal Code, the Firearm Concealed Carry Act, the Domestic Relations Legal Funding Act, the Illinois Not-For-Profit Dispute Center Resolution Act, the Criminal Code of 2012, the Code of Criminal Procedure of 1963, the Unified Code of Corrections, the Code of Civil Procedure, the Illinois Marriage and Dissolution of Marriage Act, and the Illinois Adoption Act to make other and confirming changes."}], "other_titles": [], "other_identifiers": [], "actions": [{"description": "Filed with Secretary by Sen. Elgie R. Sims, Jr.", "date": "2025-02-07", "organization_id": "~{\"classification\": \"upper\"}", "classification": ["filing"], "related_entities": []}, {"description": "First Reading", "date": "2025-02-07", "organization_id": "~{\"classification\": \"upper\"}", "classification": ["reading-1"], "related_entities": []}, {"description": "Referred to Assignments", "date": "2025-02-07", "organization_id": "~{\"classification\": \"upper\"}", "classification": [], "related_entities": []}], "sponsorships": [{"name": "Elgie R. Sims, Jr.", "classification": "primary", "entity_type": "person", "primary": true, "person_id": "~{\"chamber\": \"upper\", \"name\": \"Elgie R. Sims, Jr.\"}", "organization_id": null}], "related_bills": [], "versions": [{"note": "Introduced", "links": [{"url": "https://beta.ilga.gov/documents/legislation/104/SB/PDF/10400SB2447.pdf", "media_type": "application/pdf"}, {"url": "https://beta.ilga.gov/Legislation/BillStatus/FullText?LegDocId=202296&DocName=10400SB2447&DocNum=2447&DocTypeID=SB&LegID=162511&GAID=18&SessionID=114&SpecSess=&Session=&Print=1", "media_type": "text/html"}], "date": "", "classification": ""}], "documents": [], "citations": [], "sources": [{"url": "https://beta.ilga.gov/Legislation/BillStatus?DocNum=2447&GAID=18&DocTypeID=SB&LegId=162511&SessionID=114", "note": ""}], "extras": {}, "_id": "e9235c18-172a-11f0-9eaa-86812f74cec2"}