{"legislative_session": "104th", "identifier": "HB3322", "title": "MUNI CD/CTY CD-SOLAR RIGHTS", "from_organization": "~{\"classification\": \"lower\"}", "classification": ["bill"], "subject": [], "abstracts": [{"note": "", "abstract": "Amends the Counties Code and the Illinois Municipal Code to prohibit a county or municipality from adopting any ordinance or resolution that prohibits or has the effect of prohibiting the installation of a solar energy system or low voltage solar powered device. Provides that, in any litigation arising under the Act or involving the application of the Act, the prevailing party shall be entitled to costs and reasonable attorney's fees. Exempts from the Act any building that: (1) is greater than 60 feet in height or (2) has a shared roof and is subject to a homeowners' association, common interest community association, or condominium unit owners' association. Provides that the provisions of the amendatory Act may apply to a shared roof if: (1) the solar energy system is located entirely within that portion of the shared roof owned and maintained by the property owner and (2) all property owners sharing the shared roof are in agreement to install a solar energy system. Amends the Homeowners' Energy Policy Statement Act to make the same changes. Amends the Public Utilities Act. Provides that residential and small commercial customers of an electric cooperative and municipal utility system have the right to interconnect renewable energy systems sized up to and including 25 kW AC. Provides that the policies of municipal utility systems and electrical cooperatives regarding self-generation and credits for excess electricity shall be consistent with specified standards. Requires each electric cooperative and municipal utility system to update its policies to comply with the standards within days after the amendatory Act. Limits the concurrent exercise of home rule powers. Effective immediately."}], "other_titles": [], "other_identifiers": [], "actions": [{"description": "Filed with the Clerk by Rep. Daniel Didech", "date": "2025-02-06", "organization_id": "~{\"classification\": \"lower\"}", "classification": ["filing"], "related_entities": []}, {"description": "First Reading", "date": "2025-02-18", "organization_id": "~{\"classification\": \"lower\"}", "classification": ["reading-1"], "related_entities": []}, {"description": "Referred to Rules Committee", "date": "2025-02-18", "organization_id": "~{\"classification\": \"lower\"}", "classification": [], "related_entities": []}], "sponsorships": [{"name": "Daniel Didech", "classification": "primary", "entity_type": "person", "primary": true, "person_id": "~{\"chamber\": \"lower\", \"name\": \"Daniel Didech\"}", "organization_id": null}], "related_bills": [], "versions": [{"note": "Introduced", "links": [{"url": "https://beta.ilga.gov/documents/legislation/104/HB/PDF/10400HB3322.pdf", "media_type": "application/pdf"}, {"url": "https://beta.ilga.gov/Legislation/BillStatus/FullText?LegDocId=201600&DocName=10400HB3322&DocNum=3322&DocTypeID=HB&LegID=161812&GAID=18&SessionID=114&SpecSess=&Session=&Print=1", "media_type": "text/html"}], "date": "", "classification": ""}], "documents": [], "citations": [], "sources": [{"url": "https://beta.ilga.gov/Legislation/BillStatus?DocNum=3322&GAID=18&DocTypeID=HB&LegId=161812&SessionID=114", "note": ""}], "extras": {}, "_id": "1a4709fe-1729-11f0-9eaa-86812f74cec2"}