{"legislative_session": "104th", "identifier": "SB1896", "title": "PEN CD-STATE SYS-FUNDING", "from_organization": "~{\"classification\": \"upper\"}", "classification": ["bill"], "subject": [], "abstracts": [{"note": "", "abstract": "Amends the Illinois Pension Code. Creates the State-Funded Retirement Systems Council to appoint and oversee the Pension Funding Trustee and to monitor and verify State funding to the State-Funded Retirement Systems. Creates the Office of Pension Trustee. Sets forth duties of the Council and Trustee. Provides that the State pledges that the State will not limit or alter certain rights of the Council, the State-Funded Retirement Systems, the Pension Funding Trustee, or the Auditor General under the amendatory Act; alter the method of calculating the minimum required contribution by the State to any State-Funded Retirement System in such a manner as results in a diminution in the contribution amount to a State-Funded Retirement System before the total assets of that System are equal to 100% of the total actuarial liabilities of that System; or use the proceeds of certain income tax surcharges for anything other than certain purposes. Waives sovereign immunity for purposes of the State-Funded Retirement Systems Council. Beginning State Fiscal Year 2026, sets forth a minimum contribution formula for the State-funded retirement systems equal to the sum of the Base Contribution plus the Benefit Change Contribution Amount. Makes conforming and other changes. Provides for transfers from the Budget Stabilization Act from the proceeds of the income tax surcharge under the amendatory Act. Amends the Illinois Income Tax Act. Establishes a surcharge for taxable years 2026 through 2034 for all individuals, trusts, and estates equal to 0.5% of the taxpayer's net income and 0.7% of the net income of all corporations. Makes conforming changes in the Court of Claims Act. Effective immediately."}], "other_titles": [], "other_identifiers": [], "actions": [{"description": "Filed with Secretary by Sen. Robert F. Martwick", "date": "2025-02-06", "organization_id": "~{\"classification\": \"upper\"}", "classification": ["filing"], "related_entities": []}, {"description": "First Reading", "date": "2025-02-06", "organization_id": "~{\"classification\": \"upper\"}", "classification": ["reading-1"], "related_entities": []}, {"description": "Referred to Assignments", "date": "2025-02-06", "organization_id": "~{\"classification\": \"upper\"}", "classification": [], "related_entities": []}], "sponsorships": [{"name": "Robert F. Martwick", "classification": "primary", "entity_type": "person", "primary": true, "person_id": "~{\"chamber\": \"upper\", \"name\": \"Robert F. Martwick\"}", "organization_id": null}], "related_bills": [], "versions": [{"note": "Introduced", "links": [{"url": "https://beta.ilga.gov/documents/legislation/104/SB/PDF/10400SB1896.pdf", "media_type": "application/pdf"}, {"url": "https://beta.ilga.gov/Legislation/BillStatus/FullText?LegDocId=200968&DocName=10400SB1896&DocNum=1896&DocTypeID=SB&LegID=161180&GAID=18&SessionID=114&SpecSess=&Session=&Print=1", "media_type": "text/html"}], "date": "", "classification": ""}], "documents": [], "citations": [], "sources": [{"url": "https://beta.ilga.gov/Legislation/BillStatus?DocNum=1896&GAID=18&DocTypeID=SB&LegId=161180&SessionID=114", "note": ""}], "extras": {}, "_id": "9ed5f102-172a-11f0-9eaa-86812f74cec2"}