{"legislative_session": "104th", "identifier": "SB1485", "title": "SEIZURE & FORFEITURE REPORT", "from_organization": "~{\"classification\": \"upper\"}", "classification": ["bill"], "subject": [], "abstracts": [{"note": "", "abstract": "Amends the Seizure and Forfeiture Reporting Act. Provides that each law enforcement agency that seizes, forfeits, or receives property subject to reporting under the Act shall report certain information about each seizure and forfeiture of property to the Illinois State Police no later than 60 days after December 31 of the year in which the property is seized or forfeited. Adds certain required information, including the accused person's race, sex, age, and zip code, as well as a citation to the statutory authorities under which the property was seized and the accused person was arrested, to the information to be submitted in a report. Adds certain required information from court records about each forfeiture of property to the information to be reported to the Illinois State Police. Provides that if an agency did not seize, forfeit, receive, or spend forfeiture funds, it shall file a null report with the Illinois State Police. Provides that the annual report shall include an aggregate summary of all seizures and forfeitures carried out and their respective proceeds, as well as other information, including categories of expenditures, such as investigation and litigation expenses, software, hardware, appliances, canines, surveillance technology, IMSI catchers, operating expenses, and administrative expenses. Provides that the Illinois State Police shall post annually on its website aggregate data for each law enforcement agency with certain information. Provides that the Illinois State Police shall, 120 days after the end of each calendar year, submit to the General Assembly, Attorney General, and Governor, as well as post on its website, a written report that summarizes certain activity in the State for the preceding year regarding property seized and related expenditures at the State and local levels, with categorized accounting and other requirements. Provides that the Illinois State Police may include certain recommendations in its report. Provides that the Illinois State Police shall, on or before January 1, 2026 (rather than 2019), establish and implement the requirements of this Act. Makes other changes."}], "other_titles": [], "other_identifiers": [], "actions": [{"description": "Filed with Secretary by Sen. Omar Aquino", "date": "2025-01-31", "organization_id": "~{\"classification\": \"upper\"}", "classification": ["filing"], "related_entities": []}, {"description": "First Reading", "date": "2025-01-31", "organization_id": "~{\"classification\": \"upper\"}", "classification": ["reading-1"], "related_entities": []}, {"description": "Referred to Assignments", "date": "2025-01-31", "organization_id": "~{\"classification\": \"upper\"}", "classification": [], "related_entities": []}, {"description": "Assigned to Judiciary", "date": "2025-03-12", "organization_id": "~{\"classification\": \"upper\"}", "classification": ["referral-committee"], "related_entities": []}, {"description": "Rule 2-10 Committee Deadline Established As April 4, 2025", "date": "2025-03-21", "organization_id": "~{\"classification\": \"upper\"}", "classification": [], "related_entities": []}], "sponsorships": [{"name": "Omar Aquino", "classification": "primary", "entity_type": "person", "primary": true, "person_id": "~{\"chamber\": \"upper\", \"name\": \"Omar Aquino\"}", "organization_id": null}], "related_bills": [], "versions": [{"note": "Introduced", "links": [{"url": "https://beta.ilga.gov/documents/legislation/104/SB/PDF/10400SB1485.pdf", "media_type": "application/pdf"}, {"url": "https://beta.ilga.gov/Legislation/BillStatus/FullText?LegDocId=199844&DocName=10400SB1485&DocNum=1485&DocTypeID=SB&LegID=160056&GAID=18&SessionID=114&SpecSess=&Session=&Print=1", "media_type": "text/html"}], "date": "", "classification": ""}], "documents": [], "citations": [], "sources": [{"url": "https://beta.ilga.gov/Legislation/BillStatus?DocNum=1485&GAID=18&DocTypeID=SB&LegId=160056&SessionID=114", "note": ""}], "extras": {}, "_id": "67065406-172a-11f0-9eaa-86812f74cec2"}