{"legislative_session": "104th", "identifier": "HB3372", "title": "GUARDIANSHIP-ALTERNATIVES", "from_organization": "~{\"classification\": \"lower\"}", "classification": ["bill"], "subject": [], "abstracts": [{"note": "", "abstract": "Amends the Probate Act of 1975. Requires the court at the guardianship hearing to inquire of the alleged disabled adult's interest in a supported decision-making agreement as an alternative and inform the ward of the ward's right to modify an adjudication of disability using a limited guardianship or termination of guardianship with a supported decision-making agreement. Amends the Supported Decision-Making Agreement Act. Changes the applicability of the Act by deleting the requirement that the adult must have an intellectual or developmental disability. Provides that Alzheimer's or dementia, by itself, does not void the presumption that an adult has the capacity to make decisions. Provides that the execution of a supported decision-making agreement does not preclude the ability of the adult who has entered into a supported decision-making agreement to act independently of the agreement. Requires a supporter in an agreement must complete the training and education developed by the Guardianship and Advocacy Commission within 45 days of signing the consent to act as a supporter. Provides that a supported decision-making agreement is terminated if: (i) there is a restraining order against the supporter by or on behalf of the principal; (ii) the principal revokes the agreement; (iii) the supporter resigns; (iv) ordered by a court; or (v) the agreement includes a termination date. Provides that a supported decision-making agreement is suspended while: (i) the conditions of the Health Care Surrogate Act are met, (ii) a medical or psychological evaluation has concluded that the principal lacks decisional capacity but a subsequent evaluation has not yet found the principal's decisional capacity restored; or (iii) the agency established in a durable power of attorney has begun but not yet terminated. Provides that upon the filing of a petition by an interested person, a court may suspend or terminate a supported decision-making agreement if necessary to ensure the well-being and safety of the principal."}], "other_titles": [], "other_identifiers": [], "actions": [{"description": "Filed with the Clerk by Rep. Michelle Mussman", "date": "2025-02-07", "organization_id": "~{\"classification\": \"lower\"}", "classification": ["filing"], "related_entities": []}, {"description": "First Reading", "date": "2025-02-18", "organization_id": "~{\"classification\": \"lower\"}", "classification": ["reading-1"], "related_entities": []}, {"description": "Referred to Rules Committee", "date": "2025-02-18", "organization_id": "~{\"classification\": \"lower\"}", "classification": [], "related_entities": []}, {"description": "Assigned to Judiciary - Civil Committee", "date": "2025-03-11", "organization_id": "~{\"classification\": \"lower\"}", "classification": ["referral-committee"], "related_entities": []}, {"description": "Rule 19(a) / Re-referred to Rules Committee", "date": "2025-03-21", "organization_id": "~{\"classification\": \"lower\"}", "classification": [], "related_entities": []}], "sponsorships": [{"name": "Michelle Mussman", "classification": "primary", "entity_type": "person", "primary": true, "person_id": "~{\"chamber\": \"lower\", \"name\": \"Michelle Mussman\"}", "organization_id": null}], "related_bills": [], "versions": [{"note": "Introduced", "links": [{"url": "https://beta.ilga.gov/documents/legislation/104/HB/PDF/10400HB3372.pdf", "media_type": "application/pdf"}, {"url": "https://beta.ilga.gov/Legislation/BillStatus/FullText?LegDocId=201697&DocName=10400HB3372&DocNum=3372&DocTypeID=HB&LegID=161909&GAID=18&SessionID=114&SpecSess=&Session=&Print=1", "media_type": "text/html"}], "date": "", "classification": ""}], "documents": [], "citations": [], "sources": [{"url": "https://beta.ilga.gov/Legislation/BillStatus?DocNum=3372&GAID=18&DocTypeID=HB&LegId=161909&SessionID=114", "note": ""}], "extras": {}, "_id": "208806ba-1729-11f0-9eaa-86812f74cec2"}