{"legislative_session": "104th", "identifier": "SB1604", "title": "EDUC-SCH SOCIAL WORKER GRANTS", "from_organization": "~{\"classification\": \"upper\"}", "classification": ["bill"], "subject": [], "abstracts": [{"note": "", "abstract": "Amends the State Board of Education Article of the School Code. Provides that, subject to appropriation, beginning with the 2025-2026 school year, the State Board of Education shall award competitive grants on an annual basis to school districts and other educational units that have school social work interns to assist those school districts and other educational units in the funding of school social work internships approved by the interns' educator preparation programs by providing stipends. Sets forth the stipend amount. Provides that the State Board of Education shall annually disseminate to school districts and other educational units that have school social work interns a request for applications for grants. Provides that grant applications shall be accepted on an annual basis. Provides that the State Board of Education shall establish procedures for submitting requests for stipends and issuing funds to approved applicants. Provides for prioritizing grants if an appropriation is insufficient to fund all applications for grants. Provides that for any school year in which grants are awarded, the State Board of Education shall produce a report on the awarding of grants, in cooperation with the school districts and educational units that are awarded grants. Sets forth requirements for the report. Provides that the report shall be posted on the State Board of Education's Internet website each school year in which grants are awarded. Amends the Board of Higher Education Act. Provides that, subject to appropriation, the Board of Higher Education shall establish and administer a grant program to support the field placement of social workers. Provides that the Board shall distribute the funds appropriated for this purpose in the form of grants to public or nonpublic institutions of higher education to expand opportunities for students who are intending to become social workers and to assist students in pursuing social-work related field placements, internships, and other work opportunities. Sets forth other requirements concerning the operation of the grant program. Effective immediately."}], "other_titles": [], "other_identifiers": [], "actions": [{"description": "Filed with Secretary by Sen. Laura Fine", "date": "2025-02-04", "organization_id": "~{\"classification\": \"upper\"}", "classification": ["filing"], "related_entities": []}, {"description": "First Reading", "date": "2025-02-04", "organization_id": "~{\"classification\": \"upper\"}", "classification": ["reading-1"], "related_entities": []}, {"description": "Referred to Assignments", "date": "2025-02-04", "organization_id": "~{\"classification\": \"upper\"}", "classification": [], "related_entities": []}, {"description": "Assigned to Appropriations- Education", "date": "2025-02-11", "organization_id": "~{\"classification\": \"upper\"}", "classification": ["referral-committee"], "related_entities": []}, {"description": "Rule 2-10 Committee Deadline Established As April 11, 2025", "date": "2025-03-21", "organization_id": "~{\"classification\": \"upper\"}", "classification": [], "related_entities": []}], "sponsorships": [{"name": "Laura Fine", "classification": "primary", "entity_type": "person", "primary": true, "person_id": "~{\"chamber\": \"upper\", \"name\": \"Laura Fine\"}", "organization_id": null}], "related_bills": [], "versions": [{"note": "Introduced", "links": [{"url": "https://beta.ilga.gov/documents/legislation/104/SB/PDF/10400SB1604.pdf", "media_type": "application/pdf"}, {"url": "https://beta.ilga.gov/Legislation/BillStatus/FullText?LegDocId=200177&DocName=10400SB1604&DocNum=1604&DocTypeID=SB&LegID=160390&GAID=18&SessionID=114&SpecSess=&Session=&Print=1", "media_type": "text/html"}], "date": "", "classification": ""}], "documents": [], "citations": [], "sources": [{"url": "https://beta.ilga.gov/Legislation/BillStatus?DocNum=1604&GAID=18&DocTypeID=SB&LegId=160390&SessionID=114", "note": ""}], "extras": {}, "_id": "77880a40-172a-11f0-9eaa-86812f74cec2"}