{"legislative_session": "104th", "identifier": "HB3467", "title": "BANKING-VARIOUS", "from_organization": "~{\"classification\": \"lower\"}", "classification": ["bill"], "subject": [], "abstracts": [{"note": "", "abstract": "Amends the Illinois Banking Act. Makes changes to the membership of the State Banking Board of Illinois. Provides that a bank may borrow or incur an obligation and pledge assets to secure deposits. Provides that a bank may provide data processing services to a person for profit. Provides that a bank may invest in financial futures or options transactions. Provides that the board of directors of a bank may provide by resolution that stockholders may attend, participate in, act in, and vote at any annual meeting or special meeting through the use of a conference telephone or interactive technology if specified conditions are satisfied. Provides that a person who makes, or causes to be made, a false statement or false entry with intent to deceive any person or persons authorized to examine into the affairs of the bank or the subsidiary or holding company of that bank, the branch of an out-of-state bank with intent to deceive the Commissioner of Banks and Real Estate or his administrative officers in the performance of their duties under the Act shall be subject to civil penalties imposed by the Commissioner (rather than be guilty of a Class 3 felony). Provides that the Board may authorize the transfer of funds from the Bank and Trust Company Fund. Amends the Savings Bank Act. Provides that the board of directors of a savings bank may provide by resolution that members or stockholders may attend, participate in, act in, and vote at any annual meeting or special meeting through the use of a conference telephone or interactive technology if specified conditions are satisfied. Provides that a savings bank may loan funds through the purchase of fixed rate annuity contracts. Provides that a savings bank may accept deposits made by a minor and may open an account in the name of the minor, and the rules and regulations of the savings bank with respect to each deposit and account shall be as binding upon the minor as if the minor were of full age and legal capacity. Makes changes to various provisions concerning notice to allow for electronic notice. Makes other changes. Amends the Illinois Credit Union Act. Does not prohibit the furnishing of financial records of a deceased member to a public administrator of any county or other governmental jurisdiction for the purpose of facilitating burial of the customer. Makes other changes. Effective immediately."}], "other_titles": [], "other_identifiers": [], "actions": [{"description": "Filed with the Clerk by Rep. Dagmara Avelar", "date": "2025-02-07", "organization_id": "~{\"classification\": \"lower\"}", "classification": ["filing"], "related_entities": []}, {"description": "First Reading", "date": "2025-02-18", "organization_id": "~{\"classification\": \"lower\"}", "classification": ["reading-1"], "related_entities": []}, {"description": "Referred to Rules Committee", "date": "2025-02-18", "organization_id": "~{\"classification\": \"lower\"}", "classification": [], "related_entities": []}, {"description": "Assigned to Financial Institutions and Licensing Committee", "date": "2025-03-11", "organization_id": "~{\"classification\": \"lower\"}", "classification": ["referral-committee"], "related_entities": []}, {"description": "Do Pass / Short Debate Financial Institutions and Licensing Committee;  010-000-000", "date": "2025-03-18", "organization_id": "~{\"classification\": \"lower\"}", "classification": [], "related_entities": []}, {"description": "Placed on Calendar 2nd Reading - Short Debate", "date": "2025-03-19", "organization_id": "~{\"classification\": \"lower\"}", "classification": ["reading-2"], "related_entities": []}], "sponsorships": [{"name": "Dagmara Avelar", "classification": "primary", "entity_type": "person", "primary": true, "person_id": "~{\"chamber\": \"lower\", \"name\": \"Dagmara Avelar\"}", "organization_id": null}], "related_bills": [], "versions": [{"note": "Introduced", "links": [{"url": "https://beta.ilga.gov/documents/legislation/104/HB/PDF/10400HB3467.pdf", "media_type": "application/pdf"}, {"url": "https://beta.ilga.gov/Legislation/BillStatus/FullText?LegDocId=201898&DocName=10400HB3467&DocNum=3467&DocTypeID=HB&LegID=162110&GAID=18&SessionID=114&SpecSess=&Session=&Print=1", "media_type": "text/html"}], "date": "", "classification": ""}], "documents": [], "citations": [], "sources": [{"url": "https://beta.ilga.gov/Legislation/BillStatus?DocNum=3467&GAID=18&DocTypeID=HB&LegId=162110&SessionID=114", "note": ""}], "extras": {}, "_id": "2d179666-1729-11f0-9eaa-86812f74cec2"}