{"legislative_session": "104th", "identifier": "SB1913", "title": "CHILD CARE BACKGROUND CHECK", "from_organization": "~{\"classification\": \"upper\"}", "classification": ["bill"], "subject": [], "abstracts": [{"note": "", "abstract": "Amends the Child Care Act of 1969. Provides that an entity that contracts with the Department of Children and Family Services, the Department of Early Childhood, a child care facility, or a non-licensed service provider to provide a service that places the entity's employees in a child care facility shall require each employee who is placed or will be placed in such a facility to undergo a criminal background investigation. Provides that each entity shall submit an applicable employee's fingerprints to the Illinois State Police in the form and manner prescribed by the Illinois State Police. Sets forth provisions concerning the processing of an employee's fingerprints and actions that the Illinois State Police shall take regarding the criminal background investigation. Provides that information concerning the convictions of an entity's employee who is placed or will be placed in a child care facility and who is investigated, including the source of the information and any conclusions or recommendations derived from the information, shall be provided, upon request, to such entity and the entity's employee prior to final action by the Department of Children and Family Services or the Department of Early Childhood under the agencies' respective authority on the application. Sets forth provisions concerning the transmission of information about an employee's criminal charges and the protection of confidential information. Provides that any employee of the Department of Children and Family Services, the Department of Early Childhood, the Illinois State Police, or a child care facility receiving confidential information who gives or causes to be given any confidential information concerning any criminal convictions of an applicant, employee, or volunteer of a child care facility or non-licensed service provider or an employee who is placed in a child care facility by a contracted entity, shall be guilty of a Class A misdemeanor unless release of such information is authorized by the provisions concerning criminal background investigations."}], "other_titles": [], "other_identifiers": [], "actions": [{"description": "Filed with Secretary by Sen. Mattie Hunter", "date": "2025-02-06", "organization_id": "~{\"classification\": \"upper\"}", "classification": ["filing"], "related_entities": []}, {"description": "First Reading", "date": "2025-02-06", "organization_id": "~{\"classification\": \"upper\"}", "classification": ["reading-1"], "related_entities": []}, {"description": "Referred to Assignments", "date": "2025-02-06", "organization_id": "~{\"classification\": \"upper\"}", "classification": [], "related_entities": []}, {"description": "Assigned to Child Welfare", "date": "2025-03-04", "organization_id": "~{\"classification\": \"upper\"}", "classification": ["referral-committee"], "related_entities": []}, {"description": "Rule 2-10 Committee Deadline Established As April 4, 2025", "date": "2025-03-21", "organization_id": "~{\"classification\": \"upper\"}", "classification": [], "related_entities": []}], "sponsorships": [{"name": "Mattie Hunter", "classification": "primary", "entity_type": "person", "primary": true, "person_id": "~{\"chamber\": \"upper\", \"name\": \"Mattie Hunter\"}", "organization_id": null}], "related_bills": [], "versions": [{"note": "Introduced", "links": [{"url": "https://beta.ilga.gov/documents/legislation/104/SB/PDF/10400SB1913.pdf", "media_type": "application/pdf"}, {"url": "https://beta.ilga.gov/Legislation/BillStatus/FullText?LegDocId=200993&DocName=10400SB1913&DocNum=1913&DocTypeID=SB&LegID=161205&GAID=18&SessionID=114&SpecSess=&Session=&Print=1", "media_type": "text/html"}], "date": "", "classification": ""}], "documents": [], "citations": [], "sources": [{"url": "https://beta.ilga.gov/Legislation/BillStatus?DocNum=1913&GAID=18&DocTypeID=SB&LegId=161205&SessionID=114", "note": ""}], "extras": {}, "_id": "a0f90406-172a-11f0-9eaa-86812f74cec2"}