{"legislative_session": "104th", "identifier": "SB2477", "title": "ILLINOIS FAMILY COMMISSIONS", "from_organization": "~{\"classification\": \"upper\"}", "classification": ["bill"], "subject": [], "abstracts": [{"note": "", "abstract": "Amends the Illinois African-American Family Commission Act, the Asian American Family Commission Act, and the Illinois Latino Family Commission Act replacing current provisions in those Acts with the following: Makes a grammatical correction to the title of the Illinois African-American Family Commission Act and to other provisions of the Act, and makes conforming changes in the Violence Prevention Task Force Act, the Commission on Children and Youth Act, the Commission to Study Disproportionate Justice Impact Act, the Advisory Commission on Reducing the Disproportionate Representation of African-American Children in Foster Care Act, the Commission to End Hunger Act, the Racial and Ethnic Impact Research Task Force Act, and the Commission on Equity and Inclusion Act. Provides that each Commission shall advocate for policies, programs, and services that promote greater equity and inclusion in State government. Provides that the Governor, the President of the Senate, the Minority Leader of the Senate, the Speaker of the House of Representatives, and the Minority Leader of the House of Representatives shall each appoint 3 members to each commission (with the term of a member of any of the Commissions serving on the effective date of the amendatory Act ending on the effective date of the amendatory Act), and each Commission membership shall appoint the chairperson or chairpersons. Provides that the organizational meeting of each Commission shall take place after all members are appointed but no later than 60 days after 50% or more of the members on the Commission have been appointed. Provides that the Lieutenant Governor's Office shall provide administrative support for the Commissions (rather than the Commission on Equity and Inclusion providing general oversight of the operations of the Commissions). Provides that the Lieutenant Governor's Office may receive funding through appropriations made available for use on behalf of the commissions. Provides that the Office shall expend funds set aside for the Commissions at the direction of the Commissions. Effective immediately."}], "other_titles": [], "other_identifiers": [], "actions": [{"description": "Filed with Secretary by Sen. Mattie Hunter", "date": "2025-02-07", "organization_id": "~{\"classification\": \"upper\"}", "classification": ["filing"], "related_entities": []}, {"description": "First Reading", "date": "2025-02-07", "organization_id": "~{\"classification\": \"upper\"}", "classification": ["reading-1"], "related_entities": []}, {"description": "Referred to Assignments", "date": "2025-02-07", "organization_id": "~{\"classification\": \"upper\"}", "classification": [], "related_entities": []}, {"description": "Added as Co-Sponsor Sen. Mark L. Walker", "date": "2025-03-19", "organization_id": "~{\"classification\": \"upper\"}", "classification": [], "related_entities": []}], "sponsorships": [{"name": "Mattie Hunter", "classification": "primary", "entity_type": "person", "primary": true, "person_id": "~{\"chamber\": \"upper\", \"name\": \"Mattie Hunter\"}", "organization_id": null}, {"name": "Mark L. Walker", "classification": "cosponsor", "entity_type": "person", "primary": false, "person_id": "~{\"chamber\": \"upper\", \"name\": \"Mark L. Walker\"}", "organization_id": null}], "related_bills": [], "versions": [{"note": "Introduced", "links": [{"url": "https://beta.ilga.gov/documents/legislation/104/SB/PDF/10400SB2477.pdf", "media_type": "application/pdf"}, {"url": "https://beta.ilga.gov/Legislation/BillStatus/FullText?LegDocId=202361&DocName=10400SB2477&DocNum=2477&DocTypeID=SB&LegID=162576&GAID=18&SessionID=114&SpecSess=&Session=&Print=1", "media_type": "text/html"}], "date": "", "classification": ""}], "documents": [], "citations": [], "sources": [{"url": "https://beta.ilga.gov/Legislation/BillStatus?DocNum=2477&GAID=18&DocTypeID=SB&LegId=162576&SessionID=114", "note": ""}], "extras": {}, "_id": "ed522a4e-172a-11f0-9eaa-86812f74cec2"}