{"legislative_session": "104th", "identifier": "HB2515", "title": "LOW POP TWP DIST DISSOLUTION", "from_organization": "~{\"classification\": \"lower\"}", "classification": ["bill"], "subject": [], "abstracts": [{"note": "", "abstract": "Amends the Township Code. Provides that all townships with a population less than 500 are dissolved 2 years after the effective date of the amendatory Act. Provides for the transfer of real and personal property, and any other assets, together with all personnel, contractual obligations, and liabilities of the dissolving township to the county containing the geographic boundaries of the dissolving township. Provides that, on and after the date of dissolution, all rights and duties of the dissolved township may be exercised by the county containing the geographic boundaries of the dissolving township solely on behalf of the residents of the geographic area within the boundaries of the dissolved township. Provides that the county board of the county containing the geographic boundaries of the dissolving township may levy a property tax within the boundaries of the dissolved township for the duties taken on by the county containing the geographic boundaries of the dissolving township. Provides that all road districts wholly within the boundaries of a dissolving township are dissolved on the date of dissolution of the dissolving township and the powers and responsibilities of the road district are transferred to the county containing the geographic boundaries of the dissolving township, and provides that municipalities within the dissolving township may elect to assume the duties and responsibilities of the road district or road districts. Provides that elected and appointed township officers and road commissioners shall cease to hold office on the date of dissolution of the township and road districts, no longer be compensated, and do not have legal recourse relating to the ceasing of their elected or appointed positions upon the ceasing of their offices. Amends the Motor Fuel Tax Law and Counties Code making conforming changes. Effective immediately."}], "other_titles": [], "other_identifiers": [], "actions": [{"description": "Filed with the Clerk by Rep. Joe C. Sosnowski", "date": "2025-02-03", "organization_id": "~{\"classification\": \"lower\"}", "classification": ["filing"], "related_entities": []}, {"description": "First Reading", "date": "2025-02-04", "organization_id": "~{\"classification\": \"lower\"}", "classification": ["reading-1"], "related_entities": []}, {"description": "Referred to Rules Committee", "date": "2025-02-04", "organization_id": "~{\"classification\": \"lower\"}", "classification": [], "related_entities": []}], "sponsorships": [{"name": "Joe C. Sosnowski", "classification": "primary", "entity_type": "person", "primary": true, "person_id": "~{\"chamber\": \"lower\", \"name\": \"Joe C. Sosnowski\"}", "organization_id": null}], "related_bills": [], "versions": [{"note": "Introduced", "links": [{"url": "https://beta.ilga.gov/documents/legislation/104/HB/PDF/10400HB2515.pdf", "media_type": "application/pdf"}, {"url": "https://beta.ilga.gov/Legislation/BillStatus/FullText?LegDocId=200131&DocName=10400HB2515&DocNum=2515&DocTypeID=HB&LegID=160344&GAID=18&SessionID=114&SpecSess=&Session=&Print=1", "media_type": "text/html"}], "date": "", "classification": ""}], "documents": [], "citations": [], "sources": [{"url": "https://beta.ilga.gov/Legislation/BillStatus?DocNum=2515&GAID=18&DocTypeID=HB&LegId=160344&SessionID=114", "note": ""}], "extras": {}, "_id": "b16adf32-1728-11f0-9eaa-86812f74cec2"}