{"legislative_session": "104th", "identifier": "SB1726", "title": "PEN CD-POLICE & FIRE-VARIOUS", "from_organization": "~{\"classification\": \"upper\"}", "classification": ["bill"], "subject": [], "abstracts": [{"note": "", "abstract": "Amends the Illinois Pension Code. Provides that a Tier 2 investigator for the Department of the Lottery is entitled to an annuity under the alternative retirement annuity provisions only if the person has withdrawn from service with not less than 20 years of eligible creditable service and has attained age 55. Authorizes an investigator for the Department of the Lottery to establish eligible creditable service under the alternative retirement annuity provisions. Provides that a specified educational requirement for persons employed by the Department of Juvenile Justice shall no longer determine eligibility to earn eligible creditable service under the alternative retirement annuity provisions and authorizes the conversion of service credit to eligible creditable service. Establishes a deferred retirement option plan for certain police officers, firefighters, sheriff's law enforcement employees, and deputy sheriffs in the Cook County Police Department who are otherwise eligible to retire under which a participant may continue in active service for up to 5 years while having his or her retirement pension paid into a special account. Provides that the election to participate in the deferred retirement option plan must be made before January 1, 2030. Provides that the Retirement Systems Reciprocal Act (Article 20 of the Code) is adopted and made a part of the Downstate Police, Downstate Firefighter, Chicago Police, and Chicago Firefighter Articles. In the Chicago Teacher Article of the Code, makes changes to how days of validated service are computed. Amends the State Mandates Act to require implementation without reimbursement. Makes other changes."}], "other_titles": [], "other_identifiers": [], "actions": [{"description": "Filed with Secretary by Sen. Robert F. Martwick", "date": "2025-02-05", "organization_id": "~{\"classification\": \"upper\"}", "classification": ["filing"], "related_entities": []}, {"description": "First Reading", "date": "2025-02-05", "organization_id": "~{\"classification\": \"upper\"}", "classification": ["reading-1"], "related_entities": []}, {"description": "Referred to Assignments", "date": "2025-02-05", "organization_id": "~{\"classification\": \"upper\"}", "classification": [], "related_entities": []}], "sponsorships": [{"name": "Robert F. Martwick", "classification": "primary", "entity_type": "person", "primary": true, "person_id": "~{\"chamber\": \"upper\", \"name\": \"Robert F. Martwick\"}", "organization_id": null}], "related_bills": [], "versions": [{"note": "Introduced", "links": [{"url": "https://beta.ilga.gov/documents/legislation/104/SB/PDF/10400SB1726.pdf", "media_type": "application/pdf"}, {"url": "https://beta.ilga.gov/Legislation/BillStatus/FullText?LegDocId=200533&DocName=10400SB1726&DocNum=1726&DocTypeID=SB&LegID=160746&GAID=18&SessionID=114&SpecSess=&Session=&Print=1", "media_type": "text/html"}], "date": "", "classification": ""}], "documents": [], "citations": [], "sources": [{"url": "https://beta.ilga.gov/Legislation/BillStatus?DocNum=1726&GAID=18&DocTypeID=SB&LegId=160746&SessionID=114", "note": ""}], "extras": {}, "_id": "8815c672-172a-11f0-9eaa-86812f74cec2"}