{"legislative_session": "104th", "identifier": "SB2626", "title": "JOINT & SEVERAL TORT LIABILITY", "from_organization": "~{\"classification\": \"upper\"}", "classification": ["bill"], "subject": [], "abstracts": [{"note": "", "abstract": "Amends and reenacts provisions of the Civil Practice Article of the Code of Civil Procedure concerning actions on account of bodily injury or death or physical damage to property based on negligence or product liability based on strict tort liability. Provides that the court shall not instruct the jury of the consequence of any findings of fault of any plaintiff or defendant under specified provisions of the Code. Deletes language providing that the court shall instruct the jury in writing that the defendant shall be found not liable if the jury finds that the contributory fault of the plaintiff is more than 50% of the proximate cause of the injury or damage for which recovery is sought. In the Section concerning joint liability, deletes language providing that: any defendant whose fault is less than 25% of the total fault attributable to the plaintiff, the defendants sued by the plaintiff, and any third party defendant except the plaintiff's employer, is severally liable for non-medical damages; and any defendant whose fault is 25% or greater of the total fault attributable to the plaintiff, the defendants sued by the plaintiff, and any third party defendants except the plaintiff's employer, is jointly and severally liable for non-medical damages. Adds language providing that: any defendant whose fault is less than 25% of the proximate cause of the injury or damage for which recovery is sought by the plaintiff is severally liable for non-medical damages; and any defendant whose fault is 25% or greater of the proximate cause of the injury or damage for which recovery is sought by the plaintiff is jointly and severally liable for non-medical damages. Contains applicability provisions."}], "other_titles": [], "other_identifiers": [], "actions": [{"description": "Filed with Secretary by Sen. Jil Tracy", "date": "2025-03-04", "organization_id": "~{\"classification\": \"upper\"}", "classification": ["filing"], "related_entities": []}, {"description": "First Reading", "date": "2025-03-04", "organization_id": "~{\"classification\": \"upper\"}", "classification": ["reading-1"], "related_entities": []}, {"description": "Referred to Assignments", "date": "2025-03-04", "organization_id": "~{\"classification\": \"upper\"}", "classification": [], "related_entities": []}], "sponsorships": [{"name": "Jil Tracy", "classification": "primary", "entity_type": "person", "primary": true, "person_id": "~{\"chamber\": \"upper\", \"name\": \"Jil Tracy\"}", "organization_id": null}], "related_bills": [], "versions": [{"note": "Introduced", "links": [{"url": "https://beta.ilga.gov/documents/legislation/104/SB/PDF/10400SB2626.pdf", "media_type": "application/pdf"}, {"url": "https://beta.ilga.gov/Legislation/BillStatus/FullText?LegDocId=203063&DocName=10400SB2626&DocNum=2626&DocTypeID=SB&LegID=163145&GAID=18&SessionID=114&SpecSess=&Session=&Print=1", "media_type": "text/html"}], "date": "", "classification": ""}], "documents": [], "citations": [], "sources": [{"url": "https://beta.ilga.gov/Legislation/BillStatus?DocNum=2626&GAID=18&DocTypeID=SB&LegId=163145&SessionID=114", "note": ""}], "extras": {}, "_id": "00b50642-172b-11f0-9eaa-86812f74cec2"}