{"legislative_session": "104th", "identifier": "HB2815", "title": "PROTECT ORDERS-VIOLATION", "from_organization": "~{\"classification\": \"lower\"}", "classification": ["bill"], "subject": [], "abstracts": [{"note": "", "abstract": "Amends the Stalking No Contact Order Act and the Civil No Contact Order Act. Removes language providing that a knowing violation of a stalking no contact order or civil no contact order is a Class A misdemeanor, and a second or subsequent violation of such orders is a Class 4 felony. Provides instead that: (1) violation of a stalking no contact order or civil no contact order is a Class A misdemeanor; (2) violation of a stalking no contact order or civil no contact order is a Class 4 felony if the defendant has any prior conviction of domestic battery or violation of an order of protection or any prior conviction under the law of another jurisdiction for an offense that could be charged in the State as domestic battery or violation of an order of protection; and (3) violation of a stalking no contact order or civil no contact order is a Class 4 felony if the defendant has any prior conviction of attempt, first degree murder, kidnapping, aggravated kidnapping, unlawful restraint, aggravated unlawful restraint, criminal sexual assault, aggravated criminal sexual assault, predatory criminal sexual assault of a child, aggravated criminal sexual abuse, aggravated battery, aggravated domestic battery, stalking, aggravated stalking, aggravated arson, aggravated discharge of a firearm, or aggravated battery of an unborn child, of a violation of any former law of the State that is substantially similar to any such listed offense, or any prior conviction under the law of another jurisdiction for an offense that could be charged in the State as one of such offenses, when any of these offenses have been committed against a family or household member. Provides that the court shall impose a minimum penalty of 24 hours imprisonment for the respondent's second or subsequent violation of any stalking no contact order or civil no contact order, unless the court explicitly finds that an increased penalty or such period of imprisonment would be manifestly unjust. Provides that in addition to any other penalties, the court may order the respondent to pay a fine or to make restitution to the victim under the Unified Code of Corrections. Makes same changes to the Criminal Code of 2012."}], "other_titles": [], "other_identifiers": [], "actions": [{"description": "Filed with the Clerk by Rep. Amy Elik", "date": "2025-02-05", "organization_id": "~{\"classification\": \"lower\"}", "classification": ["filing"], "related_entities": []}, {"description": "First Reading", "date": "2025-02-06", "organization_id": "~{\"classification\": \"lower\"}", "classification": ["reading-1"], "related_entities": []}, {"description": "Referred to Rules Committee", "date": "2025-02-06", "organization_id": "~{\"classification\": \"lower\"}", "classification": [], "related_entities": []}], "sponsorships": [{"name": "Amy Elik", "classification": "primary", "entity_type": "person", "primary": true, "person_id": "~{\"chamber\": \"lower\", \"name\": \"Amy Elik\"}", "organization_id": null}], "related_bills": [], "versions": [{"note": "Introduced", "links": [{"url": "https://beta.ilga.gov/documents/legislation/104/HB/PDF/10400HB2815.pdf", "media_type": "application/pdf"}, {"url": "https://beta.ilga.gov/Legislation/BillStatus/FullText?LegDocId=200672&DocName=10400HB2815&DocNum=2815&DocTypeID=HB&LegID=160885&GAID=18&SessionID=114&SpecSess=&Session=&Print=1", "media_type": "text/html"}], "date": "", "classification": ""}], "documents": [], "citations": [], "sources": [{"url": "https://beta.ilga.gov/Legislation/BillStatus?DocNum=2815&GAID=18&DocTypeID=HB&LegId=160885&SessionID=114", "note": ""}], "extras": {}, "_id": "d81b3a5a-1728-11f0-9eaa-86812f74cec2"}