{"legislative_session": "104th", "identifier": "SB2183", "title": "TRANSPORTATION-VARIOUS", "from_organization": "~{\"classification\": \"upper\"}", "classification": ["bill"], "subject": [], "abstracts": [{"note": "", "abstract": "Amends the Illinois Vehicle Code. Requires the Secretary of State to include information advising drivers of the laws and best practices for safely sharing the roadway with bicyclists and pedestrians in the Illinois Rules of the Road Publication. Provides that an applicant for a school bus driver permit or commercial driver's license with a school bus driver endorsement is not required to pass a written test if the applicant holds a valid commercial driver's license or a commercial driver's license that expired in the preceding 30 days issued by another state with a school bus and passenger endorsements. Requires all driver education courses to include information advising drivers of the laws and best practices for safely sharing the roadway with bicyclists and pedestrians. Provides that the examination to test an applicant's ability to read and understand official traffic control devices and knowledge of safe driving practices and traffic laws may be administered at a Secretary of State facility, remotely via the Internet, or in a manner otherwise specified by the Secretary of State by administrative rule. Allows the Secretary to destroy a driving record created 20 or more years ago for a person who was convicted of an offense and who did not have an Illinois driver's license if the record no longer contains any convictions or withdrawal of driving privileges due to the convictions. Provides that the application for an instructor for a driving school must be accompanied by a medical examination report completed by a competent medical examiner (rather than a competent physician). Provides that the restricted commercial driver's license issued for farm-related service industries may be available for periods not to exceed a total of 210 (rather than 180) days in any 12-month period. Removes some of the duration limitations for suspended licenses. Provides that the traffic-control signals also apply to bicyclists. Restricts a person from driving a motor vehicle on a bicycle lane, trail, or path designated by an official sign or marking for the exclusive use of bicycles or pedestrians. Makes other changes. Amends the School Code to make a conforming change. Effective immediately."}], "other_titles": [], "other_identifiers": [], "actions": [{"description": "Filed with Secretary by Sen. Steve Stadelman", "date": "2025-02-07", "organization_id": "~{\"classification\": \"upper\"}", "classification": ["filing"], "related_entities": []}, {"description": "First Reading", "date": "2025-02-07", "organization_id": "~{\"classification\": \"upper\"}", "classification": ["reading-1"], "related_entities": []}, {"description": "Referred to Assignments", "date": "2025-02-07", "organization_id": "~{\"classification\": \"upper\"}", "classification": [], "related_entities": []}], "sponsorships": [{"name": "Steve Stadelman", "classification": "primary", "entity_type": "person", "primary": true, "person_id": "~{\"chamber\": \"upper\", \"name\": \"Steve Stadelman\"}", "organization_id": null}], "related_bills": [], "versions": [{"note": "Introduced", "links": [{"url": "https://beta.ilga.gov/documents/legislation/104/SB/PDF/10400SB2183.pdf", "media_type": "application/pdf"}, {"url": "https://beta.ilga.gov/Legislation/BillStatus/FullText?LegDocId=201674&DocName=10400SB2183&DocNum=2183&DocTypeID=SB&LegID=161886&GAID=18&SessionID=114&SpecSess=&Session=&Print=1", "media_type": "text/html"}], "date": "", "classification": ""}], "documents": [], "citations": [], "sources": [{"url": "https://beta.ilga.gov/Legislation/BillStatus?DocNum=2183&GAID=18&DocTypeID=SB&LegId=161886&SessionID=114", "note": ""}], "extras": {}, "_id": "c530109e-172a-11f0-9eaa-86812f74cec2"}