{"legislative_session": "104th", "identifier": "HB1162", "title": "FOREIGN LAND ACQUIS&CONTRACTS", "from_organization": "~{\"classification\": \"lower\"}", "classification": ["bill"], "subject": [], "abstracts": [{"note": "", "abstract": "Creates the Foreign Land Ownership and Foreign Countries of Concern Act. Provides that a foreign principal may not directly or indirectly own, have a controlling interest in, or acquire by purchase, grant, devise, or descent agricultural land or any interest, except a de minimis indirect interest, in such land in the State. Provides that a foreign principal has a de minimis indirect interest if any ownership is the result of the foreign principal's ownership of registered equities in a publicly traded company owning the land and if the foreign principal's ownership interest in the company is either: (1) less than 5% of any class of registered equities or less than 5% in the aggregate in multiple classes of registered equities; or a noncontrolling interest in an entity controlled by a company that is both registered with the United States Securities and Exchange Commission as an investment adviser under the federal Investment Advisers Act of 1940, as amended, and is not a foreign entity. Provides for registration of certain foreign-owned property. Establishes requirements for acquiring foreign-owned land on or after the effective date of the Act. Provides that a foreign principal may not directly or indirectly own, or have a controlling interest in, or acquire by purchase, grant, devise, or descent any interest, except a de minimis indirect interest, in real property on or within 10 miles of any military installation or critical infrastructure facility in the State. Provides that persons or entities may not directly or indirectly own, have a controlling interest in, or acquire by purchase, grant, devise, or descent any interest, except a de minimis indirect interest, in real property in the State if the person or entity is: the People's Republic of China, the Chinese Communist Party, or any official or member of the People's Republic of China or the Chinese Communist Party, a business principally located in the People's Republic of China of or its subsidiaries, or any person who is domiciled in the People's Republic of China and who is not a citizen or lawful permanent resident of the United States. Provides exemptions. Makes other changes. Amends the Illinois Procurement Code and the Property Owned By Noncitizens Act to make conforming changes."}], "other_titles": [], "other_identifiers": [], "actions": [{"description": "Prefiled with Clerk by Rep. Chris Miller", "date": "2025-01-06", "organization_id": "~{\"classification\": \"lower\"}", "classification": ["filing"], "related_entities": []}, {"description": "First Reading", "date": "2025-01-09", "organization_id": "~{\"classification\": \"lower\"}", "classification": ["reading-1"], "related_entities": []}, {"description": "Referred to Rules Committee", "date": "2025-01-09", "organization_id": "~{\"classification\": \"lower\"}", "classification": [], "related_entities": []}], "sponsorships": [{"name": "Chris Miller", "classification": "primary", "entity_type": "person", "primary": true, "person_id": "~{\"chamber\": \"lower\", \"name\": \"Chris Miller\"}", "organization_id": null}], "related_bills": [], "versions": [{"note": "Introduced", "links": [{"url": "https://beta.ilga.gov/documents/legislation/104/HB/PDF/10400HB1162.pdf", "media_type": "application/pdf"}, {"url": "https://beta.ilga.gov/Legislation/BillStatus/FullText?LegDocId=196693&DocName=10400HB1162&DocNum=1162&DocTypeID=HB&LegID=156904&GAID=18&SessionID=114&SpecSess=&Session=&Print=1", "media_type": "text/html"}], "date": "", "classification": ""}], "documents": [], "citations": [], "sources": [{"url": "https://beta.ilga.gov/Legislation/BillStatus?DocNum=1162&GAID=18&DocTypeID=HB&LegId=156904&SessionID=114", "note": ""}], "extras": {}, "_id": "fe088a34-1727-11f0-9eaa-86812f74cec2"}