{"legislative_session": "104th", "identifier": "SB1448", "title": "FACILITATING PROSTITUTION", "from_organization": "~{\"classification\": \"upper\"}", "classification": ["bill"], "subject": [], "abstracts": [{"note": "", "abstract": "Amends the Criminal Code of 2012. Provides that a person commits the offense of trafficking in persons when the person knowingly: (1) maintains by any means, or attempts to recruit, entice, harbor, transport, provide, obtain, advertise or maintain by any means, another person, intending or knowing that the person will be subjected to prostitution or a commercial sex act; or (2) recruits, entices, harbors, transports, provides, obtains, advertises, or maintains by any means, or attempts to recruit, entice, harbor, transport, provide, obtain, advertise or maintain by any means, another person, intending or knowing that the person will be subjected to prostitution or a commercial sex act as a result of coercion. Provides that in determining sentences for human trafficking within statutory maximums, the sentencing court may provide for substantially increased sentences in cases involving more than 5 (rather than 10) victims. Changes the name of the offense of promoting prostitution to promoting or facilitating prostitution. Provides that a person commits the offense if the person: (1) owns, manages, or operates an interactive computer service or conspires or attempts to do so, with the intent to promote or facilitate the prostitution of another person; or (2) owns, manages, or operates an interactive computer service or conspires or attempts to do so, with the intent to promote or facilitate the prostitution of another person, and: (A) promotes or facilitates the prostitution of 5 or more persons; or (B) acts in reckless disregard of the fact that such conduct contributed to sex trafficking in violation of the trafficking in persons law. Defines \"interactive computer service\". Amends various other Acts to make conforming changes."}], "other_titles": [], "other_identifiers": [], "actions": [{"description": "Filed with Secretary by Sen. Willie Preston", "date": "2025-01-31", "organization_id": "~{\"classification\": \"upper\"}", "classification": ["filing"], "related_entities": []}, {"description": "First Reading", "date": "2025-01-31", "organization_id": "~{\"classification\": \"upper\"}", "classification": ["reading-1"], "related_entities": []}, {"description": "Referred to Assignments", "date": "2025-01-31", "organization_id": "~{\"classification\": \"upper\"}", "classification": [], "related_entities": []}], "sponsorships": [{"name": "Willie Preston", "classification": "primary", "entity_type": "person", "primary": true, "person_id": "~{\"chamber\": \"upper\", \"name\": \"Willie Preston\"}", "organization_id": null}], "related_bills": [], "versions": [{"note": "Introduced", "links": [{"url": "https://beta.ilga.gov/documents/legislation/104/SB/PDF/10400SB1448.pdf", "media_type": "application/pdf"}, {"url": "https://beta.ilga.gov/Legislation/BillStatus/FullText?LegDocId=199785&DocName=10400SB1448&DocNum=1448&DocTypeID=SB&LegID=159997&GAID=18&SessionID=114&SpecSess=&Session=&Print=1", "media_type": "text/html"}], "date": "", "classification": ""}], "documents": [], "citations": [], "sources": [{"url": "https://beta.ilga.gov/Legislation/BillStatus?DocNum=1448&GAID=18&DocTypeID=SB&LegId=159997&SessionID=114", "note": ""}], "extras": {}, "_id": "6223c554-172a-11f0-9eaa-86812f74cec2"}