{"legislative_session": "104th", "identifier": "SB1787", "title": "CTY CD&JUV CT-MINOR INTERROGAT", "from_organization": "~{\"classification\": \"upper\"}", "classification": ["bill"], "subject": [], "abstracts": [{"note": "", "abstract": "Amends the Juvenile Court Act of 1987. Provides that in a proceeding under the Delinquent Minors Article of the Act, a minor who was under 18 (rather than under 15) years of age at the time of the commission of an act that if committed by an adult would be a violation of any offense under the Criminal Code of 1961 or the Criminal Code of 2012 (rather than a homicide offense or criminal sexual assault, aggravated criminal sexual assault, predatory criminal sexual assault of a child, criminal sexual abuse, or aggravated criminal sexual abuse) must be represented by counsel throughout the entire custodial interrogation of the minor. Provides that in custodial interrogations, a minor may not waive the right to the assistance of counsel. Provides that an oral, written, or sign language statement of a minor, who at the time of the commission of the offense was under 18 years of age, is presumed to be inadmissible when the statement is obtained from the minor while the minor is subject to custodial interrogation by a law enforcement officer, State's Attorney, juvenile officer, or other public official or employee prior to the officer, State's Attorney, public official, or employee ensuring that the minor is represented by counsel throughout the custodial interrogation. Provides that an oral, written, or sign language statement of a minor made without counsel present throughout the entire custodial interrogation of the minor shall be inadmissible as evidence against the minor in any juvenile court proceeding or criminal proceeding. Deletes provision that the presumption of inadmissibility of a statement made by a suspect at a custodial interrogation at a police station or other place of detention may be overcome by a preponderance of the evidence that the statement was voluntarily given and is reliable, based on the totality of the circumstances. Amends the Counties Code to make conforming changes."}], "other_titles": [], "other_identifiers": [], "actions": [{"description": "Filed with Secretary by Sen. Robert Peters", "date": "2025-02-06", "organization_id": "~{\"classification\": \"upper\"}", "classification": ["filing"], "related_entities": []}, {"description": "First Reading", "date": "2025-02-06", "organization_id": "~{\"classification\": \"upper\"}", "classification": ["reading-1"], "related_entities": []}, {"description": "Referred to Assignments", "date": "2025-02-06", "organization_id": "~{\"classification\": \"upper\"}", "classification": [], "related_entities": []}], "sponsorships": [{"name": "Robert Peters", "classification": "primary", "entity_type": "person", "primary": true, "person_id": "~{\"chamber\": \"upper\", \"name\": \"Robert Peters\"}", "organization_id": null}], "related_bills": [], "versions": [{"note": "Introduced", "links": [{"url": "https://beta.ilga.gov/documents/legislation/104/SB/PDF/10400SB1787.pdf", "media_type": "application/pdf"}, {"url": "https://beta.ilga.gov/Legislation/BillStatus/FullText?LegDocId=200722&DocName=10400SB1787&DocNum=1787&DocTypeID=SB&LegID=160935&GAID=18&SessionID=114&SpecSess=&Session=&Print=1", "media_type": "text/html"}], "date": "", "classification": ""}], "documents": [], "citations": [], "sources": [{"url": "https://beta.ilga.gov/Legislation/BillStatus?DocNum=1787&GAID=18&DocTypeID=SB&LegId=160935&SessionID=114", "note": ""}], "extras": {}, "_id": "904d054e-172a-11f0-9eaa-86812f74cec2"}