{"legislative_session": "104th", "identifier": "SB1674", "title": "GREEN ALERTS-VETERANS", "from_organization": "~{\"classification\": \"upper\"}", "classification": ["bill"], "subject": [], "abstracts": [{"note": "", "abstract": "Amends the Illinois State Police Law. Provides that the Illinois State Police, in cooperation with the Green Alert Task Force, shall develop as part of the Endangered Missing Person Advisory a coordinated statewide awareness program and toolkit, which shall be referred to as a Green Alert, to be used when a veteran, active service member, Illinois National Guard Member, or reservist is believed to be missing or at risk. Provides that the Illinois State Police shall complete development and deployment of the Green Alert Awareness Program and toolkit on or before July 1, 2027. Provides that the Illinois State Police shall establish a Green Alert Task Force within 90 days after the effective date of the amendatory Act to assist the development and deployment of the Green Alert Awareness Program and toolkit. Provides that the Task Force shall monitor and review the implementation and operation of that program, including procedures, budgetary requirements, standards, and minimum requirements for the training of law enforcement personnel on how to interact appropriately and effectively with veterans or other active or retired service members that are believed to be at risk of being hurt or hurting themselves. Sets forth membership of the Task Force. Provides that the Task Force shall meet at least twice a year and shall provide a report on the operations of the Green Alert Program to the General Assembly and the Governor each year by June 30th. Provides that the Child Safety Coordinator shall act in the capacity of Green Alert Program Coordinator in addition to the Child Safety Coordinator's other duties. Amends the Illinois Police Training Act. Provides that the Illinois Law Enforcement Training Standards Board shall conduct a training program for law enforcement personnel of local governmental agencies in the statewide coordinated Green Alert Awareness Program and toolkit. Provides that, on or before July 1, 2026, the Board shall adopt written protocols and guidelines for the handling of missing persons cases concerning veterans, active service members, Illinois National Guard Members, or reservists that are missing or believed to be at risk of being hurt or hurting themselves based upon protocols developed by the Green Alert Task Force in conjunction with the Illinois State Police."}], "other_titles": [], "other_identifiers": [], "actions": [{"description": "Filed with Secretary by Sen. Christopher Belt", "date": "2025-02-05", "organization_id": "~{\"classification\": \"upper\"}", "classification": ["filing"], "related_entities": []}, {"description": "First Reading", "date": "2025-02-05", "organization_id": "~{\"classification\": \"upper\"}", "classification": ["reading-1"], "related_entities": []}, {"description": "Referred to Assignments", "date": "2025-02-05", "organization_id": "~{\"classification\": \"upper\"}", "classification": [], "related_entities": []}, {"description": "Assigned to State Government", "date": "2025-02-25", "organization_id": "~{\"classification\": \"upper\"}", "classification": ["referral-committee"], "related_entities": []}, {"description": "Rule 3-9(a) / Re-referred to Assignments", "date": "2025-03-21", "organization_id": "~{\"classification\": \"upper\"}", "classification": [], "related_entities": []}], "sponsorships": [{"name": "Christopher Belt", "classification": "primary", "entity_type": "person", "primary": true, "person_id": "~{\"chamber\": \"upper\", \"name\": \"Christopher Belt\"}", "organization_id": null}], "related_bills": [], "versions": [{"note": "Introduced", "links": [{"url": "https://beta.ilga.gov/documents/legislation/104/SB/PDF/10400SB1674.pdf", "media_type": "application/pdf"}, {"url": "https://beta.ilga.gov/Legislation/BillStatus/FullText?LegDocId=200369&DocName=10400SB1674&DocNum=1674&DocTypeID=SB&LegID=160582&GAID=18&SessionID=114&SpecSess=&Session=&Print=1", "media_type": "text/html"}], "date": "", "classification": ""}], "documents": [], "citations": [], "sources": [{"url": "https://beta.ilga.gov/Legislation/BillStatus?DocNum=1674&GAID=18&DocTypeID=SB&LegId=160582&SessionID=114", "note": ""}], "extras": {}, "_id": "813255b4-172a-11f0-9eaa-86812f74cec2"}