{"legislative_session": "104th", "identifier": "SB2287", "title": "INS CD-MENTAL HEALTH CARE", "from_organization": "~{\"classification\": \"upper\"}", "classification": ["bill"], "subject": [], "abstracts": [{"note": "", "abstract": "Amends the Illinois Insurance Code. Provides that, when a beneficiary, insured, or enrollee receives mental health services from a nonparticipating provider or a nonparticipating health care facility, the health insurance issuer shall ensure that the beneficiary, insured, or enrollee shall incur no greater out-of-pocket costs than the beneficiary, insured, or enrollee would have incurred with a participating provider or a participating health care facility. Requires any cost-sharing requirements to be applied as though the mental health services had been received from a participating provider or a participating health care facility. Provides that, if the cost sharing for the same item or service furnished by a participating provider would have been a flat-dollar copayment, that amount shall be the cost-sharing amount unless the provider has billed a lesser total amount. Provides that administrative requirements or limitations shall be no greater than those applicable to emergency services received from a participating provider or a participating health care facility. Permits a beneficiary, insured, or enrollee receiving ongoing mental health services from a nonparticipating provider to continue treatment with the nonparticipating provider for up to one year from the start of services or one year after the effective date of the amendatory Act, whichever is later, as if the mental health services were provided by a participating provider. Amends the State Employees Group Insurance Act of 1971, the Counties Code, the Illinois Municipal Code, the School Code, the Health Maintenance Organization Act, the Limited Health Service Organization Act, the Voluntary Health Services Plans Act, and the Illinois Public Aid Code to require coverage under those provisions. Effective January 1, 2027."}], "other_titles": [], "other_identifiers": [], "actions": [{"description": "Filed with Secretary by Sen. Mike Simmons", "date": "2025-02-07", "organization_id": "~{\"classification\": \"upper\"}", "classification": ["filing"], "related_entities": []}, {"description": "First Reading", "date": "2025-02-07", "organization_id": "~{\"classification\": \"upper\"}", "classification": ["reading-1"], "related_entities": []}, {"description": "Referred to Assignments", "date": "2025-02-07", "organization_id": "~{\"classification\": \"upper\"}", "classification": [], "related_entities": []}], "sponsorships": [{"name": "Mike Simmons", "classification": "primary", "entity_type": "person", "primary": true, "person_id": "~{\"chamber\": \"upper\", \"name\": \"Mike Simmons\"}", "organization_id": null}], "related_bills": [], "versions": [{"note": "Introduced", "links": [{"url": "https://beta.ilga.gov/documents/legislation/104/SB/PDF/10400SB2287.pdf", "media_type": "application/pdf"}, {"url": "https://beta.ilga.gov/Legislation/BillStatus/FullText?LegDocId=201879&DocName=10400SB2287&DocNum=2287&DocTypeID=SB&LegID=162091&GAID=18&SessionID=114&SpecSess=&Session=&Print=1", "media_type": "text/html"}], "date": "", "classification": ""}], "documents": [], "citations": [], "sources": [{"url": "https://beta.ilga.gov/Legislation/BillStatus?DocNum=2287&GAID=18&DocTypeID=SB&LegId=162091&SessionID=114", "note": ""}], "extras": {}, "_id": "d386af36-172a-11f0-9eaa-86812f74cec2"}