{"legislative_session": "104th", "identifier": "SB1219", "title": "FOID-REVOCATION-SUSPENSION", "from_organization": "~{\"classification\": \"upper\"}", "classification": ["bill"], "subject": [], "abstracts": [{"note": "", "abstract": "Amends the Firearm Owners Identification Card Act. Provides that notwithstanding any other provision of the Act to the contrary, on or after the effective date of the amendatory Act, the Illinois State Police may not revoke a Firearm Owner's Identification Card. Provides that on or after the effective date of the amendatory Act, a Firearm Owner's Identification Card may only be revoked after a Firearm Owner's Identification Card hearing has been held in the circuit court of the county of residence of the person whose Firearm Owner's Identification Card is sought to be revoked. Provides that if the State's Attorney of the county of residence of the person whose Firearm Owner's Identification Card is sought to be revoked has probable cause to believe that the person who has been issued a Firearm Owner's Identification Card is no longer eligible for the Card under the Act, the State's Attorney shall file a petition in the circuit court of the county of residence of the person whose Card is sought to be revoked. Provides that at the hearing, the person may present evidence in his or her favor seeking retention of his or her Firearm Owner's Identification Card and the Illinois State Police and State's Attorney may present evidence for revocation. Provides that the hearing shall be a civil proceeding and subject to due process, the Code of Civil Procedure, and the Illinois Rules of Evidence as adopted by the Supreme Court. Provides that the hearing shall be held within 45 days after the filing of the petition. Provides that if the circuit court determines, by clear and convincing evidence, that the person is ineligible for retention of his or her Firearm Owner's Identification Card under the Act, the court shall order the Illinois State Police to immediately revoke the Card and the circuit clerk shall seize the Card and transmit the Card to the Illinois State Police. Establishes procedures for the Illinois State Police to suspend a Firearm Owner's Identification Card Act."}], "other_titles": [], "other_identifiers": [], "actions": [{"description": "Filed with Secretary by Sen. Terri Bryant", "date": "2025-01-24", "organization_id": "~{\"classification\": \"upper\"}", "classification": ["filing"], "related_entities": []}, {"description": "First Reading", "date": "2025-01-24", "organization_id": "~{\"classification\": \"upper\"}", "classification": ["reading-1"], "related_entities": []}, {"description": "Referred to Assignments", "date": "2025-01-24", "organization_id": "~{\"classification\": \"upper\"}", "classification": [], "related_entities": []}], "sponsorships": [{"name": "Terri Bryant", "classification": "primary", "entity_type": "person", "primary": true, "person_id": "~{\"chamber\": \"upper\", \"name\": \"Terri Bryant\"}", "organization_id": null}], "related_bills": [], "versions": [{"note": "Introduced", "links": [{"url": "https://beta.ilga.gov/documents/legislation/104/SB/PDF/10400SB1219.pdf", "media_type": "application/pdf"}, {"url": "https://beta.ilga.gov/Legislation/BillStatus/FullText?LegDocId=198823&DocName=10400SB1219&DocNum=1219&DocTypeID=SB&LegID=159033&GAID=18&SessionID=114&SpecSess=&Session=&Print=1", "media_type": "text/html"}], "date": "", "classification": ""}], "documents": [], "citations": [], "sources": [{"url": "https://beta.ilga.gov/Legislation/BillStatus?DocNum=1219&GAID=18&DocTypeID=SB&LegId=159033&SessionID=114", "note": ""}], "extras": {}, "_id": "43984b78-172a-11f0-9eaa-86812f74cec2"}