{"legislative_session": "104th", "identifier": "SB1453", "title": "DEFERRED COMP-NONPLAN SERVICES", "from_organization": "~{\"classification\": \"upper\"}", "classification": ["bill"], "subject": [], "abstracts": [{"note": "", "abstract": "Amends the State Universities Article of the Illinois Pension Code. Provides that the System shall require that the deferred compensation recordkeeper agree that, in performing services with respect to the deferred compensation plan, the recordkeeper: (i) will not use information received as a result of providing services with respect to the deferred compensation plan or the participants in the deferred compensation plan to solicit the participants in the deferred compensation plan for the purpose of cross-selling nonplan products and services, unless in response to a request by a participant in the deferred compensation plan or a request by the System (currently, a request by a participant in the deferred compensation plan); and (ii) will not promote, recommend, endorse, or solicit participants in the deferred compensation plan to purchase any financial products or services outside of the deferred compensation plan, except that links to parts of the recordkeeper's or the recordkeeper's affiliate's (currently, recordkeeper's) website that are generally available to the public, are about commercial products, and may be encountered by a participant in the regular course of navigating the recordkeeper's or the recordkeeper's affiliate's website (currently, recordkeeper's) does not constitute a violation of the prohibition. Amends the University Employees Custodial Accounts Act. Makes similar changes. In a provision prohibiting a defined contribution plan recordkeeper from promoting credit cards, life insurance, or banking products, provides an exception if a request to provide those products is made by the governing board of the public institution of higher education or its authorized delegate. Effective immediately."}], "other_titles": [], "other_identifiers": [], "actions": [{"description": "Filed with Secretary by Sen. Robert F. Martwick", "date": "2025-01-31", "organization_id": "~{\"classification\": \"upper\"}", "classification": ["filing"], "related_entities": []}, {"description": "First Reading", "date": "2025-01-31", "organization_id": "~{\"classification\": \"upper\"}", "classification": ["reading-1"], "related_entities": []}, {"description": "Referred to Assignments", "date": "2025-01-31", "organization_id": "~{\"classification\": \"upper\"}", "classification": [], "related_entities": []}], "sponsorships": [{"name": "Robert F. Martwick", "classification": "primary", "entity_type": "person", "primary": true, "person_id": "~{\"chamber\": \"upper\", \"name\": \"Robert F. Martwick\"}", "organization_id": null}], "related_bills": [], "versions": [{"note": "Introduced", "links": [{"url": "https://beta.ilga.gov/documents/legislation/104/SB/PDF/10400SB1453.pdf", "media_type": "application/pdf"}, {"url": "https://beta.ilga.gov/Legislation/BillStatus/FullText?LegDocId=199790&DocName=10400SB1453&DocNum=1453&DocTypeID=SB&LegID=160002&GAID=18&SessionID=114&SpecSess=&Session=&Print=1", "media_type": "text/html"}], "date": "", "classification": ""}], "documents": [], "citations": [], "sources": [{"url": "https://beta.ilga.gov/Legislation/BillStatus?DocNum=1453&GAID=18&DocTypeID=SB&LegId=160002&SessionID=114", "note": ""}], "extras": {}, "_id": "62c8674e-172a-11f0-9eaa-86812f74cec2"}