{"legislative_session": "104th", "identifier": "SB2087", "title": "STATES ATTY-PEACE OFCR-PRIVACY", "from_organization": "~{\"classification\": \"upper\"}", "classification": ["bill"], "subject": [], "abstracts": [{"note": "", "abstract": "Creates the State's Attorney and Peace Officer Privacy Act. Provides that government agencies shall not publicly post or display publicly available content that includes the personal information of a State's Attorney, Assistant State's Attorney, or peace officer if the government agency has received a written request in accordance with the Act that it refrain from disclosing the personal information of a State's Attorney, Assistant State's Attorney, or peace officer. Provides that if a government agency fails to comply with a written request to refrain from disclosing personal information, the State's Attorney, Assistant State's Attorney, or peace officer may bring an action seeking injunctive or declaratory relief in any court of competent jurisdiction. Provides that it is unlawful for any person to knowingly publicly post on the Internet the personal information of a State's Attorney, Assistant State's Attorney, or peace officer or of the immediate family of a State's Attorney, Assistant State's Attorney, or peace officer if the person knows or reasonably should know that publicly posting the personal information poses an imminent and serious threat to the health and safety of the State's Attorney, Assistant State's Attorney, or peace officer or the immediate family of the State's Attorney, Assistant State's Attorney, or peace officer, and the violation is a proximate cause of bodily injury or death of the State's Attorney, Assistant State's Attorney, or peace officer or the immediate family of the State's Attorney, Assistant State's Attorney, or peace officer. Provides that a person who violates this provision is guilty of a Class 3 felony. Provides exemptions. Defines terms. Effective immediately."}], "other_titles": [], "other_identifiers": [], "actions": [{"description": "Filed with Secretary by Sen. Erica Harriss", "date": "2025-02-06", "organization_id": "~{\"classification\": \"upper\"}", "classification": ["filing"], "related_entities": []}, {"description": "First Reading", "date": "2025-02-06", "organization_id": "~{\"classification\": \"upper\"}", "classification": ["reading-1"], "related_entities": []}, {"description": "Referred to Assignments", "date": "2025-02-06", "organization_id": "~{\"classification\": \"upper\"}", "classification": [], "related_entities": []}], "sponsorships": [{"name": "Erica Harriss", "classification": "primary", "entity_type": "person", "primary": true, "person_id": "~{\"chamber\": \"upper\", \"name\": \"Erica Harriss\"}", "organization_id": null}], "related_bills": [], "versions": [{"note": "Introduced", "links": [{"url": "https://beta.ilga.gov/documents/legislation/104/SB/PDF/10400SB2087.pdf", "media_type": "application/pdf"}, {"url": "https://beta.ilga.gov/Legislation/BillStatus/FullText?LegDocId=201383&DocName=10400SB2087&DocNum=2087&DocTypeID=SB&LegID=161595&GAID=18&SessionID=114&SpecSess=&Session=&Print=1", "media_type": "text/html"}], "date": "", "classification": ""}], "documents": [], "citations": [], "sources": [{"url": "https://beta.ilga.gov/Legislation/BillStatus?DocNum=2087&GAID=18&DocTypeID=SB&LegId=161595&SessionID=114", "note": ""}], "extras": {}, "_id": "b8822e54-172a-11f0-9eaa-86812f74cec2"}