{"legislative_session": "104th", "identifier": "SB223", "title": "CD CORR-DOC SAFETY COMMITTEE", "from_organization": "~{\"classification\": \"upper\"}", "classification": ["bill"], "subject": [], "abstracts": [{"note": "", "abstract": "Amends the Unified Code of Corrections. Provides that the Act may be referred to as the Christopher James Act. Amends the Unified Code of Corrections. Provides that the Department of Corrections shall establish a Safety Committee comprised of bargaining unit and non-bargaining unit Department employees. Provides that at least 40% of committee members shall be bargaining unit employees. Provides that the Committee shall assess the Department's compliance with the Occupational Safety and Health Act and any other applicable workplace health and safety laws and shall make recommendations for improvements to processes and procedures to improve workplace safety. Provides that the Committee shall prepare an annual report on the Department's workplace safety efforts and plans for the future to further promote safety in the workplace. Provides that the Committee shall prepare an annual report on the Department's workplace safety efforts and plans for the future to further promote safety in the workplace. Provides that the Director of Corrections shall appoint the non-bargaining unit members of the Safety Committee. Provides that the Director of Corrections shall appoint 60% of the Safety Committee, including the non-bargaining unit members and up to 2 members of the International Union of Operating Engineers. Provides that the exclusive collective bargaining representative of the majority of the Department of Corrections employees shall appoint the remaining 40% of the Safety Committee. Provides that the Director of Corrections shall appoint the chairperson of the Committee. Provides that the appointed chairperson of the Committee shall have a professional background and training in an environmental health and safety field. Provides that the chairperson of the Safety Committee, or the chairperson's designee, may conduct a workplace safety inspection of any property, equipment, or workplace under the control or supervision of the Department at any time and shall conduct random unannounced inspections as often as deemed necessary. Provides that the jurisdiction of the Safety Committee is strictly limited to the Occupational Safety and Health Act and any other applicable workplace health and safety laws. Provides that these provisions are subject to appropriations."}], "other_titles": [], "other_identifiers": [], "actions": [{"description": "Filed with Secretary by Sen. Michael W. Halpin", "date": "2025-01-22", "organization_id": "~{\"classification\": \"upper\"}", "classification": ["filing"], "related_entities": []}, {"description": "First Reading", "date": "2025-01-22", "organization_id": "~{\"classification\": \"upper\"}", "classification": ["reading-1"], "related_entities": []}, {"description": "Referred to Assignments", "date": "2025-01-22", "organization_id": "~{\"classification\": \"upper\"}", "classification": [], "related_entities": []}], "sponsorships": [{"name": "Michael W. Halpin", "classification": "primary", "entity_type": "person", "primary": true, "person_id": "~{\"chamber\": \"upper\", \"name\": \"Michael W. Halpin\"}", "organization_id": null}], "related_bills": [], "versions": [{"note": "Introduced", "links": [{"url": "https://beta.ilga.gov/documents/legislation/104/SB/PDF/10400SB0223.pdf", "media_type": "application/pdf"}, {"url": "https://beta.ilga.gov/Legislation/BillStatus/FullText?LegDocId=197324&DocName=10400SB0223&DocNum=223&DocTypeID=SB&LegID=157534&GAID=18&SessionID=114&SpecSess=&Session=&Print=1", "media_type": "text/html"}], "date": "", "classification": ""}], "documents": [], "citations": [], "sources": [{"url": "https://beta.ilga.gov/Legislation/BillStatus?DocNum=223&GAID=18&DocTypeID=SB&LegId=157534&SessionID=114", "note": ""}], "extras": {}, "_id": "b3be58d0-1729-11f0-9eaa-86812f74cec2"}