{"legislative_session": "104th", "identifier": "SB2450", "title": "HEALTH REGULATION-VARIOUS", "from_organization": "~{\"classification\": \"upper\"}", "classification": ["bill"], "subject": [], "abstracts": [{"note": "", "abstract": "Amends the Behavior Analyst Licensing Act, the Clinical Psychologist Licensing Act, the Clinical Social Work and Social Work Practice Act, the Marriage and Family Therapy Licensing Act, the Medical Practice Act of 1987, the Licensed Certified Professional Midwife Practice Act, the Nurse Practice Act, the Pharmacy Practice Act, the Physician Assistant Practice Act of 1987, the Professional Counselor and Clinical Professional Counselor Licensing and Practice Act, the Wholesale Drug Distribution Licensing Act, the Registered Surgical Assistant and Registered Surgical Technologist Title Protection Act, and the Genetic Counselor Licensing Act. Provides that the Department of Professional and Financial Regulation shall not take any disciplinary or non-disciplinary action against a person's authorization to practice (rather than against the license or permit issued) under each of the amended Acts based solely upon the person's involvement in any health care service, so long as the care was not unlawful under the laws of the State. Prohibits the Department from taking any disciplinary or non-disciplinary action against a person's authorization to practice (rather than against the license or permit issued) under each of the amended Acts based upon the person's license, registration, or permit (rather than only license) being revoked or suspended, or the person being otherwise disciplined by any other state, if that form of discipline was based solely on the person violating another state's laws prohibiting involvement in any health care service if that health care service would not have been unlawful under the laws of the State and is consistent with the applicable standard of conduct for a person practicing in Illinois under those Acts. Changes certain references to official occupation titles in the amended Acts to \"person\". Amends the Illinois Food, Drug and Cosmetic Act. Provides that a drug's status as not approved by the U.S. Food and Drug Administration shall not cause it to be deemed an adulterated drug if its safety and efficacy have been established by peer-reviewed research or if it is recommended for use by the World Health Organization, even if the drug's labelling reflects prior approval that is no longer in effect, so long as such labelling was true and accurate at the time of manufacture."}], "other_titles": [], "other_identifiers": [], "actions": [{"description": "Filed with Secretary by Sen. Karina Villa", "date": "2025-02-07", "organization_id": "~{\"classification\": \"upper\"}", "classification": ["filing"], "related_entities": []}, {"description": "First Reading", "date": "2025-02-07", "organization_id": "~{\"classification\": \"upper\"}", "classification": ["reading-1"], "related_entities": []}, {"description": "Referred to Assignments", "date": "2025-02-07", "organization_id": "~{\"classification\": \"upper\"}", "classification": [], "related_entities": []}], "sponsorships": [{"name": "Karina Villa", "classification": "primary", "entity_type": "person", "primary": true, "person_id": "~{\"chamber\": \"upper\", \"name\": \"Karina Villa\"}", "organization_id": null}], "related_bills": [], "versions": [{"note": "Introduced", "links": [{"url": "https://beta.ilga.gov/documents/legislation/104/SB/PDF/10400SB2450.pdf", "media_type": "application/pdf"}, {"url": "https://beta.ilga.gov/Legislation/BillStatus/FullText?LegDocId=202302&DocName=10400SB2450&DocNum=2450&DocTypeID=SB&LegID=162517&GAID=18&SessionID=114&SpecSess=&Session=&Print=1", "media_type": "text/html"}], "date": "", "classification": ""}], "documents": [], "citations": [], "sources": [{"url": "https://beta.ilga.gov/Legislation/BillStatus?DocNum=2450&GAID=18&DocTypeID=SB&LegId=162517&SessionID=114", "note": ""}], "extras": {}, "_id": "e9932606-172a-11f0-9eaa-86812f74cec2"}