{"legislative_session": "104th", "identifier": "SB259", "title": "HOSPITAL STAFFING PLANS ACT", "from_organization": "~{\"classification\": \"upper\"}", "classification": ["bill"], "subject": [], "abstracts": [{"note": "", "abstract": "Creates the Hospital Staffing Plans Act. Provides that for each hospital there shall be established a hospital professional and technical staffing committee. Sets forth requirements and makeup of committee members and cochairs. Directs the professional and technical staffing committee to develop a written hospital-wide professional and technical staffing plan. Sets forth committee rules of operation. Requires the plan to be consistent with the approved nurse staffing plan for the hospital and takes into account the hospital service staffing plan for the hospital. Provides that if the committee does not adopt a staffing plan, or adopts only part of a plan, then either cochair may invoke an additional 60 day period to continue to develop the plan. Sets forth opportunities to extend the discussion, amendment, or adoption timeframe of the staffing plan. Provides that the committee must meet 3 times per year and additionally at the call of either cochair. Sets forth open meeting and recordkeeping requirements. Requires the hospital to submit the staffing plan to the Department of Public Health. Provides for a hospital service staffing plan in the same manner and methods as the professional and technical staffing committee. Provides that hospitals may combine 2 or more staffing committees into one committee in particular circumstances. Provides for a nurse staffing committee as the same manner and methods of the professional and technical staffing committee. Provides that hospitals may combine 2 or more staffing committees into one committee in particular circumstances. Sets forth the roles and responsibilities of a nurse in a hospital setting. Sets forth arbitration and complaint resolution. Sets forth required periodic reviews. Provides for penalties for violations of the Act. Provides that the Department of Labor may grant a variance to a written hospital-wide staffing plan. Provides for emergency staffing variances. Establishes the Nurse Staffing Advisory Board within the Department of Public Health. Effective immediately."}], "other_titles": [], "other_identifiers": [], "actions": [{"description": "Filed with Secretary by Sen. Lakesia Collins", "date": "2025-01-24", "organization_id": "~{\"classification\": \"upper\"}", "classification": ["filing"], "related_entities": []}, {"description": "First Reading", "date": "2025-01-24", "organization_id": "~{\"classification\": \"upper\"}", "classification": ["reading-1"], "related_entities": []}, {"description": "Referred to Assignments", "date": "2025-01-24", "organization_id": "~{\"classification\": \"upper\"}", "classification": [], "related_entities": []}], "sponsorships": [{"name": "Lakesia Collins", "classification": "primary", "entity_type": "person", "primary": true, "person_id": "~{\"chamber\": \"upper\", \"name\": \"Lakesia Collins\"}", "organization_id": null}], "related_bills": [], "versions": [{"note": "Introduced", "links": [{"url": "https://beta.ilga.gov/documents/legislation/104/SB/PDF/10400SB0259.pdf", "media_type": "application/pdf"}, {"url": "https://beta.ilga.gov/Legislation/BillStatus/FullText?LegDocId=197486&DocName=10400SB0259&DocNum=259&DocTypeID=SB&LegID=157696&GAID=18&SessionID=114&SpecSess=&Session=&Print=1", "media_type": "text/html"}], "date": "", "classification": ""}], "documents": [], "citations": [], "sources": [{"url": "https://beta.ilga.gov/Legislation/BillStatus?DocNum=259&GAID=18&DocTypeID=SB&LegId=157696&SessionID=114", "note": ""}], "extras": {}, "_id": "b866a810-1729-11f0-9eaa-86812f74cec2"}