{"legislative_session": "104th", "identifier": "SB149", "title": "RTS CRIME VICTIMS-DISCOVERY", "from_organization": "~{\"classification\": \"upper\"}", "classification": ["bill"], "subject": [], "abstracts": [{"note": "", "abstract": "Amends the Code of Criminal Procedure of 1963. Provides that victims shall be provided access to all discovery materials, including, but not limited to, police reports, relevant cellular communication data, and communications between parties, upon request, in accordance with the Crime Victims' Rights provision of the Bill of Rights Article of the Illinois Constitution and the Rights of Crime Victims and Witnesses Act to aid in their protection against future harm and preparation for civil litigation. Amends the Rights of Crime Victims and Witnesses Act. Provides that crime victims shall have the right to discovery information, upon request, for protection and civil litigation preparation. Provides that victims of crimes shall have the right to request and receive, upon request, discovery information that is directly relevant to the criminal case and pertinent to the victim's involvement in the case. Establishes procedures for the victim to obtain discovery information. Provides that the disclosure of discovery materials must be done in a manner that safeguards the victim's personal safety and privacy, especially in cases in which there is a known risk of further harm or retaliation by the defendant or others involved in the case. Provides that discovery materials disclosed may only be used for the purpose of understanding the criminal case and preparing for potential civil litigation. Provides that the information may not be disclosed to third parties or used for any purpose unrelated to the criminal proceedings or related civil litigation. Provides that failure of law enforcement or the office of the prosecuting attorney to comply with the disclosure of discovery materials within the required time frame may result in a civil penalty of up to $50,000, or disciplinary action, or both, as determined by the appropriate oversight body. Effective immediately."}], "other_titles": [], "other_identifiers": [], "actions": [{"description": "Filed with Secretary by Sen. Michael E. Hastings", "date": "2025-01-17", "organization_id": "~{\"classification\": \"upper\"}", "classification": ["filing"], "related_entities": []}, {"description": "First Reading", "date": "2025-01-17", "organization_id": "~{\"classification\": \"upper\"}", "classification": ["reading-1"], "related_entities": []}, {"description": "Referred to Assignments", "date": "2025-01-17", "organization_id": "~{\"classification\": \"upper\"}", "classification": [], "related_entities": []}], "sponsorships": [{"name": "Michael E. Hastings", "classification": "primary", "entity_type": "person", "primary": true, "person_id": "~{\"chamber\": \"upper\", \"name\": \"Michael E. Hastings\"}", "organization_id": null}], "related_bills": [], "versions": [{"note": "Introduced", "links": [{"url": "https://beta.ilga.gov/documents/legislation/104/SB/PDF/10400SB0149.pdf", "media_type": "application/pdf"}, {"url": "https://beta.ilga.gov/Legislation/BillStatus/FullText?LegDocId=197156&DocName=10400SB0149&DocNum=149&DocTypeID=SB&LegID=157366&GAID=18&SessionID=114&SpecSess=&Session=&Print=1", "media_type": "text/html"}], "date": "", "classification": ""}], "documents": [], "citations": [], "sources": [{"url": "https://beta.ilga.gov/Legislation/BillStatus?DocNum=149&GAID=18&DocTypeID=SB&LegId=157366&SessionID=114", "note": ""}], "extras": {}, "_id": "a9dc9160-1729-11f0-9eaa-86812f74cec2"}