{"legislative_session": "104th", "identifier": "SB2136", "title": "P.A. 102-1116 - PARTIAL REPEAL", "from_organization": "~{\"classification\": \"upper\"}", "classification": ["bill"], "subject": [], "abstracts": [{"note": "", "abstract": "Amends the Firearm Owners Identification Card Act. Provides that, on the effective date of the amendatory Act or as soon thereafter as practicable, the Illinois State Police shall immediately and permanently destroy every endorsement affidavit that was provided to the Illinois State Police under the Firearm Owners Identification Card Act and the Criminal Code of 2012 and all information collected from the endorsement affidavit in possession of the Illinois State Police and any law enforcement agency. Repeals amendatory provisions of the Criminal Code of 2012 that beginning January 1, 2024, make it is unlawful for any person within the State to knowingly possess an assault weapon, assault weapon attachment, .50 caliber rifle, or .50 caliber cartridge, with exemptions, and provides penalties and repeals provisions that make it unlawful for any person within the State to knowingly manufacture, deliver, sell, purchase, or cause to be manufactured, delivered, sold, or purchased a large capacity ammunition feeding device, with specified exemptions, and which provide penalties for those actions. Repeals amendatory provisions of the Criminal Code of 2012 that prohibits the manufacture, possession, sale, or offers to sell, purchase, manufacture, import, transfer, or use any device, part, kit, tool, accessory, or combination of parts that is designed to and functions to increase the rate of fire of a semiautomatic firearm above the standard rate of fire for semiautomatic firearms that is not equipped with that device, part, or combination of parts. Repeals amendatory provisions of the Freedom of Information Act that exempt from disclosure under the Act certain information concerning assault weapons endorsements received by the Illinois State Police. Effective immediately."}], "other_titles": [], "other_identifiers": [], "actions": [{"description": "Filed with Secretary by Sen. Chapin Rose", "date": "2025-02-07", "organization_id": "~{\"classification\": \"upper\"}", "classification": ["filing"], "related_entities": []}, {"description": "First Reading", "date": "2025-02-07", "organization_id": "~{\"classification\": \"upper\"}", "classification": ["reading-1"], "related_entities": []}, {"description": "Referred to Assignments", "date": "2025-02-07", "organization_id": "~{\"classification\": \"upper\"}", "classification": [], "related_entities": []}], "sponsorships": [{"name": "Chapin Rose", "classification": "primary", "entity_type": "person", "primary": true, "person_id": "~{\"chamber\": \"upper\", \"name\": \"Chapin Rose\"}", "organization_id": null}], "related_bills": [], "versions": [{"note": "Introduced", "links": [{"url": "https://beta.ilga.gov/documents/legislation/104/SB/PDF/10400SB2136.pdf", "media_type": "application/pdf"}, {"url": "https://beta.ilga.gov/Legislation/BillStatus/FullText?LegDocId=201493&DocName=10400SB2136&DocNum=2136&DocTypeID=SB&LegID=161705&GAID=18&SessionID=114&SpecSess=&Session=&Print=1", "media_type": "text/html"}], "date": "", "classification": ""}], "documents": [], "citations": [], "sources": [{"url": "https://beta.ilga.gov/Legislation/BillStatus?DocNum=2136&GAID=18&DocTypeID=SB&LegId=161705&SessionID=114", "note": ""}], "extras": {}, "_id": "bf056d72-172a-11f0-9eaa-86812f74cec2"}