{"legislative_session": "104th", "identifier": "SB2371", "title": "FOREIGN AGENTS REGISTRATION", "from_organization": "~{\"classification\": \"upper\"}", "classification": ["bill"], "subject": [], "abstracts": [{"note": "", "abstract": "Creates the Foreign Agents Registration Act. Provides that no person shall act as an agent of a foreign principal from a country of concern unless he or she has filed with the Attorney General a true and complete registration statement and supplements thereto or unless he or she is exempt from registration under the provisions of the Act. Provides that, except as otherwise provided in the Act, every person who becomes an agent of a foreign principal from a country of concern shall, within 10 days thereafter, file with the Attorney General, in duplicate, a registration statement, under oath on a form prescribed by the Attorney General. Provides that the obligation of an agent of a foreign principal from a country of concern to file a registration statement shall, after the 10th day of his or her becoming such agent, continue from day to day, and termination of such status shall not relieve such agent from his or her obligation to file a registration statement for the period during which he or she was an agent of a foreign principal from a country of concern. Provides that any person who acted as an agent of a foreign principal from a country of concern at any time after January 1, 2014 and until the effective date of the Act shall file with the Attorney General a true and complete retroactive registration statement and supplements thereto. Provides that the registration provisions do not apply to certain agents and foreign principals. Provides penalties for violation. Provides that the Attorney General may at any time make, prescribe, amend, and rescind such rules and forms as the Attorney General may deem necessary to carry out the provisions of the Act. Defines \"country of concern\" as the People's Republic of China, the Russian Federation, the Islamic Republic of Iran, the Democratic People's Republic of Korea, the Republic of Cuba, the Venezuelan regime of Nicolas Maduro, or the Syrian Arab Republic, including any agent of or any other entity under significant control of such foreign country of concern, or any other entity deemed by the Governor in consultation with the Director of the Illinois Emergency Management Agency and Office of Homeland Security."}], "other_titles": [], "other_identifiers": [], "actions": [{"description": "Filed with Secretary by Sen. Jason Plummer", "date": "2025-02-07", "organization_id": "~{\"classification\": \"upper\"}", "classification": ["filing"], "related_entities": []}, {"description": "First Reading", "date": "2025-02-07", "organization_id": "~{\"classification\": \"upper\"}", "classification": ["reading-1"], "related_entities": []}, {"description": "Referred to Assignments", "date": "2025-02-07", "organization_id": "~{\"classification\": \"upper\"}", "classification": [], "related_entities": []}], "sponsorships": [{"name": "Jason Plummer", "classification": "primary", "entity_type": "person", "primary": true, "person_id": "~{\"chamber\": \"upper\", \"name\": \"Jason Plummer\"}", "organization_id": null}], "related_bills": [], "versions": [{"note": "Introduced", "links": [{"url": "https://beta.ilga.gov/documents/legislation/104/SB/PDF/10400SB2371.pdf", "media_type": "application/pdf"}, {"url": "https://beta.ilga.gov/Legislation/BillStatus/FullText?LegDocId=202142&DocName=10400SB2371&DocNum=2371&DocTypeID=SB&LegID=162354&GAID=18&SessionID=114&SpecSess=&Session=&Print=1", "media_type": "text/html"}], "date": "", "classification": ""}], "documents": [], "citations": [], "sources": [{"url": "https://beta.ilga.gov/Legislation/BillStatus?DocNum=2371&GAID=18&DocTypeID=SB&LegId=162354&SessionID=114", "note": ""}], "extras": {}, "_id": "ded8d45e-172a-11f0-9eaa-86812f74cec2"}