{"legislative_session": "104th", "identifier": "HB3127", "title": "KRATOM CONSUMER PROTECTION", "from_organization": "~{\"classification\": \"lower\"}", "classification": ["bill"], "subject": [], "abstracts": [{"note": "", "abstract": "Creates the Kratom Consumer Protection Act. Establishes safety requirements for the preparation, distribution, sale, and offer for sale of Kratom products and extracts. Prohibits the preparation, distribution, sale, and offer for sale of adulterated Kratom products and extracts. Provides that a processor of Kratom products that violates the Act is subject to an administrative penalty of not more than $5,000 for the first offense and not more than $10,000 for the second or subsequent offense. Provides that the penalty shall be collected by the Department of Public Health and paid into the Food and Drug Safety Fund. Requires, upon the request of a person to whom an administrative penalty is issued, the Director of Public Health to conduct a hearing in accordance with the Illinois Administrative Procedure Act. Provides that a processor shall not knowingly distribute, sell, or offer for sale a Kratom product to a person under 21 years of age. Provides that a person who violates the age restrictions shall be punished as provided in the Kratom Control Act. Provides that a processor does not violate the Act if it is shown by a preponderance of the evidence that the processor relied in good faith upon the representations of a manufacturer, processor, packer, or distributor of food represented to be a Kratom product. Amends the Kratom Control Act. Changes the age in which a person may not purchase and possess and to whom Kratom may not be sold, bought for, distributed samples of, or furnished from under 18 years of age to under 21 years of age. Provides that no person or entity shall advertise a product containing any quantity of Kratom, in any form or medium, within 1,000 feet of the perimeter of school grounds, a playground, a recreation center or facility, a child care center, a public park or public library, or a game arcade that admits persons under 21 years of age. Provides that no person or entity shall sell a product containing any quantity of Kratom, in any form or through any medium, within 1,000 feet of the perimeter of school grounds, a playground, a recreation center or facility, a child care center, a public park or public library, or a game arcade that admits persons under 21 years of age. Provides that a violation is a business offense punishable by a fine not to exceed $5,000."}], "other_titles": [], "other_identifiers": [], "actions": [{"description": "Filed with the Clerk by Rep. William E Hauter", "date": "2025-02-06", "organization_id": "~{\"classification\": \"lower\"}", "classification": ["filing"], "related_entities": []}, {"description": "First Reading", "date": "2025-02-18", "organization_id": "~{\"classification\": \"lower\"}", "classification": ["reading-1"], "related_entities": []}, {"description": "Referred to Rules Committee", "date": "2025-02-18", "organization_id": "~{\"classification\": \"lower\"}", "classification": [], "related_entities": []}, {"description": "Assigned to Executive Committee", "date": "2025-03-04", "organization_id": "~{\"classification\": \"lower\"}", "classification": ["referral-committee"], "related_entities": []}, {"description": "Rule 19(a) / Re-referred to Rules Committee", "date": "2025-03-21", "organization_id": "~{\"classification\": \"lower\"}", "classification": [], "related_entities": []}], "sponsorships": [{"name": "William E Hauter", "classification": "primary", "entity_type": "person", "primary": true, "person_id": "~{\"chamber\": \"lower\", \"name\": \"William E Hauter\"}", "organization_id": null}], "related_bills": [], "versions": [{"note": "Introduced", "links": [{"url": "https://beta.ilga.gov/documents/legislation/104/HB/PDF/10400HB3127.pdf", "media_type": "application/pdf"}, {"url": "https://beta.ilga.gov/Legislation/BillStatus/FullText?LegDocId=201302&DocName=10400HB3127&DocNum=3127&DocTypeID=HB&LegID=161514&GAID=18&SessionID=114&SpecSess=&Session=&Print=1", "media_type": "text/html"}], "date": "", "classification": ""}], "documents": [], "citations": [], "sources": [{"url": "https://beta.ilga.gov/Legislation/BillStatus?DocNum=3127&GAID=18&DocTypeID=HB&LegId=161514&SessionID=114", "note": ""}], "extras": {}, "_id": "00a61d46-1729-11f0-9eaa-86812f74cec2"}