{"legislative_session": "104th", "identifier": "SB181", "title": "ELECTION CODE-VARIOUS", "from_organization": "~{\"classification\": \"upper\"}", "classification": ["bill"], "subject": [], "abstracts": [{"note": "", "abstract": "Amends the Election Code. Requires Voter Identification Cards for those who do not have acceptable photo identification. Sets forth requirements and exemptions. Provides that any person desiring to vote shall present to the judges of election for verification of the person's identity a government-issued photo identification card or his or her Voter Identification Card. In provisions concerning electioneering at voting precincts, provides that electioneering includes the distribution of food or drinks to voters. Provides that each election authority shall establish procedures for the registration of voters and for change of address during the period from the close of registration for an election until the 7th day before the election (currently, the day of the election). Provides that a polling place shall not be located in any residential building, including, but not limited to, an apartment or dormitory. Provides that election authorities shall establish vote centers in at least 2 locations. Specifies the locations where vote centers shall be located. Provides that each election authority shall keep a secure record of the number of ballots printed and distributed to the judges of election at each polling place of each precinct or district. Provides that the State Board of Elections shall develop standards that each election authority shall implement for the 2026 general primary election, and all subsequent elections, to count and track the number of ballots printed and distributed. Removes provisions allowing voters to apply for permanent vote by mail status. Removes a provision that authorizes election authorities to maintain one or more secure collection sites for the postage-free return of vote by mail ballots. Provides that the county clerk or board of election commissioners shall complete the validation and counting of provisional ballots within 7 calendar days (rather than 14 calendar days) of the day after the election. Provides that specified vote by mail ballots returned to an election authority shall be counted on or before the 7th day after the election. Provides that any person who, during an early voting period, gathers on behalf of another and submits to an election authority more than 3 vote by mail ballots shall be guilty of a Class 4 felony. Makes other changes."}], "other_titles": [], "other_identifiers": [], "actions": [{"description": "Filed with Secretary by Sen. Chapin Rose", "date": "2025-01-17", "organization_id": "~{\"classification\": \"upper\"}", "classification": ["filing"], "related_entities": []}, {"description": "First Reading", "date": "2025-01-17", "organization_id": "~{\"classification\": \"upper\"}", "classification": ["reading-1"], "related_entities": []}, {"description": "Referred to Assignments", "date": "2025-01-17", "organization_id": "~{\"classification\": \"upper\"}", "classification": [], "related_entities": []}, {"description": "Assigned to Executive", "date": "2025-01-28", "organization_id": "~{\"classification\": \"upper\"}", "classification": ["referral-committee"], "related_entities": []}, {"description": "To Elections", "date": "2025-02-19", "organization_id": "~{\"classification\": \"upper\"}", "classification": [], "related_entities": []}, {"description": "Rule 2-10 Committee Deadline Established As April 11, 2025", "date": "2025-03-21", "organization_id": "~{\"classification\": \"upper\"}", "classification": [], "related_entities": []}], "sponsorships": [{"name": "Chapin Rose", "classification": "primary", "entity_type": "person", "primary": true, "person_id": "~{\"chamber\": \"upper\", \"name\": \"Chapin Rose\"}", "organization_id": null}], "related_bills": [], "versions": [{"note": "Introduced", "links": [{"url": "https://beta.ilga.gov/documents/legislation/104/SB/PDF/10400SB0181.pdf", "media_type": "application/pdf"}, {"url": "https://beta.ilga.gov/Legislation/BillStatus/FullText?LegDocId=197225&DocName=10400SB0181&DocNum=181&DocTypeID=SB&LegID=157435&GAID=18&SessionID=114&SpecSess=&Session=&Print=1", "media_type": "text/html"}], "date": "", "classification": ""}], "documents": [], "citations": [], "sources": [{"url": "https://beta.ilga.gov/Legislation/BillStatus?DocNum=181&GAID=18&DocTypeID=SB&LegId=157435&SessionID=114", "note": ""}], "extras": {}, "_id": "ae4713ce-1729-11f0-9eaa-86812f74cec2"}