{"legislative_session": "104th", "identifier": "SB2361", "title": "HUMAN TRAFFICKING", "from_organization": "~{\"classification\": \"upper\"}", "classification": ["bill"], "subject": [], "abstracts": [{"note": "", "abstract": "Amends the Illinois Police Training Act. Includes, in the minimum curriculum for police training schools, training in investigating domestic minor sex trafficking. Amends the Abused and Neglected Child Reporting Act. Provides that a child shall be considered abused regardless of the perpetrator of the abuse if the child is a human trafficking victim. Amends the Juvenile Court Act of 1987. Provides for immediate expungement of juvenile court and law enforcement records of minors who are human trafficking victims involved in prostitution. Amends the Criminal Code of 2012. Deletes a provision that provides that commercial sexual activity and sexually-explicit performances are forms of activities that are \"services\" under the human trafficking statute. Provides that involuntary sexual servitude of a minor includes purchasing sexual services of the minor whether from the trafficker or minor. Provides that it is not a defense to involuntary sexual servitude of a minor that the accused reasonably believed the trafficking victim to be 18 years of age or over. Eliminates other mistake of age defenses concerning grooming and patronizing a minor engaged in prostitution. Provides that a person who is a victim of involuntary sexual servitude of a minor is deemed a crime victim and is eligible for protections afforded to crime victims. Amends the Code of Criminal Procedure of 1963 to permit a motion to vacate an adjudication of delinquency of a human trafficking victim who engaged in prostitution. Amends the Sex Offender Registration Act. Makes violations concerning trafficking in persons, involuntary servitude, and related offenses registrable offenses under the Act. Amends the Crime Victims Compensation Act to provide that a trafficking victim who is under 18 years of age is not subject to the filing requirements of the Act and is not subject to the eligibility requirements of the Act."}], "other_titles": [], "other_identifiers": [], "actions": [{"description": "Filed with Secretary by Sen. Jason Plummer", "date": "2025-02-07", "organization_id": "~{\"classification\": \"upper\"}", "classification": ["filing"], "related_entities": []}, {"description": "First Reading", "date": "2025-02-07", "organization_id": "~{\"classification\": \"upper\"}", "classification": ["reading-1"], "related_entities": []}, {"description": "Referred to Assignments", "date": "2025-02-07", "organization_id": "~{\"classification\": \"upper\"}", "classification": [], "related_entities": []}], "sponsorships": [{"name": "Jason Plummer", "classification": "primary", "entity_type": "person", "primary": true, "person_id": "~{\"chamber\": \"upper\", \"name\": \"Jason Plummer\"}", "organization_id": null}], "related_bills": [], "versions": [{"note": "Introduced", "links": [{"url": "https://beta.ilga.gov/documents/legislation/104/SB/PDF/10400SB2361.pdf", "media_type": "application/pdf"}, {"url": "https://beta.ilga.gov/Legislation/BillStatus/FullText?LegDocId=202129&DocName=10400SB2361&DocNum=2361&DocTypeID=SB&LegID=162341&GAID=18&SessionID=114&SpecSess=&Session=&Print=1", "media_type": "text/html"}], "date": "", "classification": ""}], "documents": [], "citations": [], "sources": [{"url": "https://beta.ilga.gov/Legislation/BillStatus?DocNum=2361&GAID=18&DocTypeID=SB&LegId=162341&SessionID=114", "note": ""}], "extras": {}, "_id": "dd92b894-172a-11f0-9eaa-86812f74cec2"}