{"legislative_session": "104th", "identifier": "SB1192", "title": "DANGEROUS ANIMAL-DEFINIT-VET", "from_organization": "~{\"classification\": \"upper\"}", "classification": ["bill"], "subject": [], "abstracts": [{"note": "", "abstract": "Amends the Veterinary Medicine and Surgery Practice Act of 2004. In the provision that a veterinarian who, on his or her own initiative or other than at the request of the owner, gives emergency treatment to a sick or injured animal shall not be liable for damages in the absence of gross negligence, includes giving emergency treatment to a dangerous animal, as defined in the Criminal Code of 2012. Amends the Criminal Code of 2012. Provides that \"dangerous animal\", in addition to the other animals listed in the dangerous animals statute, includes a serval, caracal, kangaroo, wallaby, or any hybrid, intergrade, or cross of such an animal. Provides that no person shall have a right of property in, keep, harbor, care for, act as custodian of or maintain in his or her possession any dangerous animal or primate except at or by a: (1) federally licensed facility, (2) veterinary hospital, or (3) permitted hound running area and only for possession of coyotes. Provides that the exemptions listed in the provision do not exempt persons from having to be in compliance with the Wildlife Code or the Endangered Species Act, including, but not limited to, prohibitions on possession of any dangerous animal. Provides that nothing in the provision shall be construed to apply to a motion picture, television, or digital media production company employing or contracting with a dealer or exhibitor licensed under the federal Animal Welfare Act or with a carrier, intermediate handler, or unlicensed exhibitor registered under that Act for the transportation, purchase, exhibition, or use of animals in its motion picture, television, or digital media production. Provides that it is an affirmative defense for a prosecution under this provision if a person had lawful possession of a feline crossbreed between a serval cat and a domesticated cat and the possessor of the animal proves that the possessor possessed the animal before the effective date of the amendatory Act. Defines \"federally licensed facility\"."}], "other_titles": [], "other_identifiers": [], "actions": [{"description": "Filed with Secretary by Sen. Adriane Johnson", "date": "2025-01-24", "organization_id": "~{\"classification\": \"upper\"}", "classification": ["filing"], "related_entities": []}, {"description": "First Reading", "date": "2025-01-24", "organization_id": "~{\"classification\": \"upper\"}", "classification": ["reading-1"], "related_entities": []}, {"description": "Referred to Assignments", "date": "2025-01-24", "organization_id": "~{\"classification\": \"upper\"}", "classification": [], "related_entities": []}], "sponsorships": [{"name": "Adriane Johnson", "classification": "primary", "entity_type": "person", "primary": true, "person_id": "~{\"chamber\": \"upper\", \"name\": \"Adriane Johnson\"}", "organization_id": null}], "related_bills": [], "versions": [{"note": "Introduced", "links": [{"url": "https://beta.ilga.gov/documents/legislation/104/SB/PDF/10400SB1192.pdf", "media_type": "application/pdf"}, {"url": "https://beta.ilga.gov/Legislation/BillStatus/FullText?LegDocId=198796&DocName=10400SB1192&DocNum=1192&DocTypeID=SB&LegID=159006&GAID=18&SessionID=114&SpecSess=&Session=&Print=1", "media_type": "text/html"}], "date": "", "classification": ""}], "documents": [], "citations": [], "sources": [{"url": "https://beta.ilga.gov/Legislation/BillStatus?DocNum=1192&GAID=18&DocTypeID=SB&LegId=159006&SessionID=114", "note": ""}], "extras": {}, "_id": "403e0094-172a-11f0-9eaa-86812f74cec2"}