{"legislative_session": "104th", "identifier": "SB1825", "title": "VETERAN SERVICE ORGANIZATIONS", "from_organization": "~{\"classification\": \"upper\"}", "classification": ["bill"], "subject": [], "abstracts": [{"note": "", "abstract": "Amends the Veteran Service Organizations State Charter Act. Changes the name of the Act to the Veteran Service Organizations Equal Act. Provides that a veteran service organization shall be considered to have veteran service organization status (rather than shall be considered state chartered) when the organization meets all of the requirements listed in the Act and the organization's application for veteran service organization status (rather than state charter status) has been approved by the Attorney General. Makes corresponding changes throughout the Act. Provides that the Attorney General shall grant veteran service organization status (rather than state charter status) to any organization that has demonstrated that all requirements for obtaining veteran service organization status have been met. Requires a veteran service organization to have annual expenditures that demonstrate that 20% (rather than a majority) of the organization's expenses reflect support for veterans in order to qualify for veteran service organization status. Requires an application for veteran service organization status to include a statement from the organization's Commander, President, or chief executive officer (rather than all officers of the organization) attesting that all requirements for a veteran service organization status have been met. Amends the Consumer Fraud and Deceptive Business Practices Act. Provides that it is an unlawful practice for any person proving veteran or military benefits services to: (i) receive compensation for referring any individual to another person to advise or assist the individual with any veterans' benefits matter; (ii) guarantee, either directly or by implication, a successful outcome or that any individual is certain to receive specific veterans' benefits; (iii) utilize international call centers or data centers for processing veterans' personal information; and (iv) other matters."}], "other_titles": [], "other_identifiers": [], "actions": [{"description": "Filed with Secretary by Sen. Mike Porfirio", "date": "2025-02-06", "organization_id": "~{\"classification\": \"upper\"}", "classification": ["filing"], "related_entities": []}, {"description": "First Reading", "date": "2025-02-06", "organization_id": "~{\"classification\": \"upper\"}", "classification": ["reading-1"], "related_entities": []}, {"description": "Referred to Assignments", "date": "2025-02-06", "organization_id": "~{\"classification\": \"upper\"}", "classification": [], "related_entities": []}], "sponsorships": [{"name": "Mike Porfirio", "classification": "primary", "entity_type": "person", "primary": true, "person_id": "~{\"chamber\": \"upper\", \"name\": \"Mike Porfirio\"}", "organization_id": null}], "related_bills": [], "versions": [{"note": "Introduced", "links": [{"url": "https://beta.ilga.gov/documents/legislation/104/SB/PDF/10400SB1825.pdf", "media_type": "application/pdf"}, {"url": "https://beta.ilga.gov/Legislation/BillStatus/FullText?LegDocId=200761&DocName=10400SB1825&DocNum=1825&DocTypeID=SB&LegID=160974&GAID=18&SessionID=114&SpecSess=&Session=&Print=1", "media_type": "text/html"}], "date": "", "classification": ""}], "documents": [], "citations": [], "sources": [{"url": "https://beta.ilga.gov/Legislation/BillStatus?DocNum=1825&GAID=18&DocTypeID=SB&LegId=160974&SessionID=114", "note": ""}], "extras": {}, "_id": "9560043c-172a-11f0-9eaa-86812f74cec2"}