{"legislative_session": "104th", "identifier": "HB65", "title": "UNLAWFUL POSSESSION PROPERTY", "from_organization": "~{\"classification\": \"lower\"}", "classification": ["bill"], "subject": [], "abstracts": [{"note": "", "abstract": "Creates the Remedy to Remove Unauthorized Persons from Residential Real Property Act. Allows a property owner or authorized agent to request a law enforcement officer to remove an unlawful occupant of a residential dwelling if certain conditions are met. Creates a complaint form for the property owner to complete and give to a law enforcement officer to use when requesting the removal of an unlawful occupant. Provides that if the law enforcement officer verifies the information in the form, the law enforcement officer must serve a notice on the unlawful occupant to vacate the dwelling. Requires the unlawful occupant to vacate the dwelling within 3 business days of receiving the notice. Authorizes the law enforcement officer, if appropriate, to arrest any person for trespass, outstanding warrants, or any other legal cause. Authorizes the property owner to request the law enforcement officer to remain on the premises to keep the peace while the locks are changed or the personal property of the unlawful occupant is removed. Authorizes the law enforcement officer to charge reasonable fees to provide notice and remain on the premises. Allows a person to bring an action for wrongful removal, and allows the property owner to file an answer contesting the claims of the person bringing the action. Amends the Criminal Code of 2012. Provides that a person commits a Class 4 felony if he or she lists or advertises residential real property for sale knowing that the purported seller has no legal title or authority to sell the property, or rents or leases the property to another person knowing that he or she has no lawful ownership in the property or leasehold interest in the property. Provides that a person commits a Class A misdemeanor when he or she enters upon the land or premises of another and resides on such land or premises for any period of time knowingly acting without the knowledge or consent of the owner, rightful occupant, or an authorized representative of the owner."}], "other_titles": [], "other_identifiers": [], "actions": [{"description": "Prefiled with Clerk by Rep. Sonya M. Harper", "date": "2024-12-12", "organization_id": "~{\"classification\": \"lower\"}", "classification": ["filing"], "related_entities": []}, {"description": "First Reading", "date": "2025-01-09", "organization_id": "~{\"classification\": \"lower\"}", "classification": ["reading-1"], "related_entities": []}, {"description": "Referred to Rules Committee", "date": "2025-01-09", "organization_id": "~{\"classification\": \"lower\"}", "classification": [], "related_entities": []}], "sponsorships": [{"name": "Sonya M. Harper", "classification": "primary", "entity_type": "person", "primary": true, "person_id": "~{\"chamber\": \"lower\", \"name\": \"Sonya M. Harper\"}", "organization_id": null}], "related_bills": [], "versions": [{"note": "Introduced", "links": [{"url": "https://beta.ilga.gov/documents/legislation/104/HB/PDF/10400HB0065.pdf", "media_type": "application/pdf"}, {"url": "https://beta.ilga.gov/Legislation/BillStatus/FullText?LegDocId=195505&DocName=10400HB0065&DocNum=65&DocTypeID=HB&LegID=155739&GAID=18&SessionID=114&SpecSess=&Session=&Print=1", "media_type": "text/html"}], "date": "", "classification": ""}], "documents": [], "citations": [], "sources": [{"url": "https://beta.ilga.gov/Legislation/BillStatus?DocNum=65&GAID=18&DocTypeID=HB&LegId=155739&SessionID=114", "note": ""}], "extras": {}, "_id": "f16f1bac-1723-11f0-9eaa-86812f74cec2"}