{"legislative_session": "104th", "identifier": "SB1960", "title": "HIGHER ED-DUAL CREDIT", "from_organization": "~{\"classification\": \"upper\"}", "classification": ["bill"], "subject": [], "abstracts": [{"note": "", "abstract": "Amends the Dual Credit Quality Act. Provides that prior to offering dual credit coursework, a school district shall attempt to enter into a partnership agreement with the community college district in the community college district in which the school district is located, but if pursuing an alternative provider other than the community college district, the school district shall enter into a partnership agreement with the alternative postsecondary institution that complies with the Act. Requires a partnership agreement to provide for a Dual Credit Qualifications Committee that shall develop a Dual Credit Instructor Qualification Framework. Provides that the Framework shall define the appropriate graduate coursework for fully qualified and minimally qualified instructors and the equivalent experience required to be a fully qualified career and technical education instructor. Requires a Model Dual Credit Instructor Qualification Framework to be developed through a Committee involving collaboration between the Illinois Community College Board and the State Board of Education by June 30, 2026. Provides that the academic credentials required to be a fully qualified instructor shall include either (i) a master's degree within the discipline to be taught or (ii) any master's degree and not more than 18 graduate hours appropriate to the academic field of study or in the discipline to be taught. Provides that a community college district with an established partnership agreement with a school district has 30 calendar days from the initial course request to notify the school district of its disapproval of the course request, instructor, course documentation, or the community college district's withdrawal of course or instructor approval, and thereafter, the school district shall appeal the denial or withdrawal of the instructor approval to the Illinois Community College Board within 14 calendar days after the disapproval notice. Allows the Illinois Community College Board to conduct a study to examine dual credit students and their short-term and long-term outcomes. Makes other changes."}], "other_titles": [], "other_identifiers": [], "actions": [{"description": "Filed with Secretary by Sen. Cristina Castro", "date": "2025-02-06", "organization_id": "~{\"classification\": \"upper\"}", "classification": ["filing"], "related_entities": []}, {"description": "First Reading", "date": "2025-02-06", "organization_id": "~{\"classification\": \"upper\"}", "classification": ["reading-1"], "related_entities": []}, {"description": "Referred to Assignments", "date": "2025-02-06", "organization_id": "~{\"classification\": \"upper\"}", "classification": [], "related_entities": []}], "sponsorships": [{"name": "Cristina Castro", "classification": "primary", "entity_type": "person", "primary": true, "person_id": "~{\"chamber\": \"upper\", \"name\": \"Cristina Castro\"}", "organization_id": null}], "related_bills": [], "versions": [{"note": "Introduced", "links": [{"url": "https://beta.ilga.gov/documents/legislation/104/SB/PDF/10400SB1960.pdf", "media_type": "application/pdf"}, {"url": "https://beta.ilga.gov/Legislation/BillStatus/FullText?LegDocId=201139&DocName=10400SB1960&DocNum=1960&DocTypeID=SB&LegID=161351&GAID=18&SessionID=114&SpecSess=&Session=&Print=1", "media_type": "text/html"}], "date": "", "classification": ""}], "documents": [], "citations": [], "sources": [{"url": "https://beta.ilga.gov/Legislation/BillStatus?DocNum=1960&GAID=18&DocTypeID=SB&LegId=161351&SessionID=114", "note": ""}], "extras": {}, "_id": "a7a4f10c-172a-11f0-9eaa-86812f74cec2"}