{"legislative_session": "104th", "identifier": "HB2408", "title": "ARBITRATION-VARIOUS", "from_organization": "~{\"classification\": \"lower\"}", "classification": ["bill"], "subject": [], "abstracts": [{"note": "", "abstract": "Amends the Uniform Arbitration Act. Allows a party to serve upon another party a demand for arbitration or a notice of intention to arbitrate, specifying the agreement under which arbitration is sought and the name and address of the party serving the notice and stating that unless the party served applies to stay the arbitration within 20 days after service the party shall be precluded from objecting that a valid agreement was not made or has not been complied with and from asserting in court the bar of a limitation of time. Provides that in an arbitration brought by a consumer or employee that requires the drafting party to pay certain fees and costs before the arbitration can proceed, if the fees or costs to initiate an arbitration proceeding are not paid within 30 days after the due date, the drafting party is in material breach of the arbitration agreement, is in default of the arbitration, and waives its right to compel arbitration. Sets forth various actions a party may take if the drafting party materially breaches the arbitration agreement. Includes sanctions an arbitrator or court may impose for materially breaching the agreement. Provides that, if a party is represented by an attorney, papers to be served on the party shall be served upon the attorney for that party, and any agreement which discriminates against or penalizes a party for retaining the services of counsel in an arbitration is null and void. In a provision regarding venue, provides that: if the name of the county is not specified, the application shall be brought in the county where the party seeking arbitration resides or is doing business, and other proceedings affecting arbitration are to be brought in the county where at least one of the parties resides or is doing business or where the arbitration was held or is pending; if there are multiple parties seeking arbitration against the same party or parties, the proceeding may be brought in any court and county where any of the parties seeking arbitration resides or is doing business or where the arbitration was held or is pending; and if there is no county in which the proceeding may be brought, the proceeding may be brought in any county."}], "other_titles": [], "other_identifiers": [], "actions": [{"description": "Filed with the Clerk by Rep. Marcus C. Evans, Jr.", "date": "2025-01-31", "organization_id": "~{\"classification\": \"lower\"}", "classification": ["filing"], "related_entities": []}, {"description": "First Reading", "date": "2025-02-04", "organization_id": "~{\"classification\": \"lower\"}", "classification": ["reading-1"], "related_entities": []}, {"description": "Referred to Rules Committee", "date": "2025-02-04", "organization_id": "~{\"classification\": \"lower\"}", "classification": [], "related_entities": []}, {"description": "Assigned to Judiciary - Civil Committee", "date": "2025-02-25", "organization_id": "~{\"classification\": \"lower\"}", "classification": ["referral-committee"], "related_entities": []}, {"description": "Rule 19(a) / Re-referred to Rules Committee", "date": "2025-03-21", "organization_id": "~{\"classification\": \"lower\"}", "classification": [], "related_entities": []}], "sponsorships": [{"name": "Marcus C. Evans, Jr.", "classification": "primary", "entity_type": "person", "primary": true, "person_id": "~{\"chamber\": \"lower\", \"name\": \"Marcus C. Evans, Jr.\"}", "organization_id": null}], "related_bills": [], "versions": [{"note": "Introduced", "links": [{"url": "https://beta.ilga.gov/documents/legislation/104/HB/PDF/10400HB2408.pdf", "media_type": "application/pdf"}, {"url": "https://beta.ilga.gov/Legislation/BillStatus/FullText?LegDocId=199927&DocName=10400HB2408&DocNum=2408&DocTypeID=HB&LegID=160139&GAID=18&SessionID=114&SpecSess=&Session=&Print=1", "media_type": "text/html"}], "date": "", "classification": ""}], "documents": [], "citations": [], "sources": [{"url": "https://beta.ilga.gov/Legislation/BillStatus?DocNum=2408&GAID=18&DocTypeID=HB&LegId=160139&SessionID=114", "note": ""}], "extras": {}, "_id": "a3c1bbd0-1728-11f0-9eaa-86812f74cec2"}