{"legislative_session": "104th", "identifier": "HB3509", "title": "CD CORR-PAROLE-25 YRS", "from_organization": "~{\"classification\": \"lower\"}", "classification": ["bill"], "subject": [], "abstracts": [{"note": "", "abstract": "Amends the Unified Code of Corrections. Provides that a person serving a term of natural life imprisonment is eligible for parole and mandatory supervised release under these provisions. Deletes a provision that no person serving a term of natural life imprisonment may be paroled or released except through executive clemency. Provides that a committed person who has attained the age of 55 years and served at least 25 consecutive years of incarceration, excluding any person sentenced to natural life imprisonment for a Class X felony violation of criminal sexual assault, aggravated criminal sexual assault, or predatory criminal sexual assault of a child, shall be eligible to submit a petition to the Prisoner Review Board seeking parole. Provides that the Board shall hold a hearing on each petition, and in determining whether an eligible person should be granted parole, the Prisoner Review Board shall consider certain statutory factors as shown by the petition or as shown at the hearing. Provides that victims and victims' families shall be notified in a timely manner and be provided opportunity to participate at the parole hearing concerning the petitioner's application for parole under these provisions in accordance with the Rights of Crime Victims and Witnesses Act, the Open Parole Hearings Act, and these provisions. Provides that Prisoner Review Board hearings under these provisions shall be conducted by a panel of at least 8 members of the Board and a majority vote of the panel is required to grant the petition and release the petitioner on parole. Provides that the Board shall render its decision within a reasonable time after the hearing and shall state the basis therefor both in the records of the Board and in written notice to the person on whose petition it has acted. Provides that in its decision, the Board shall set the person's time for parole, or if it denies parole, it shall provide for a rehearing no later than 3 years after denial of parole. Provides that these provisions apply retroactively to all persons serving any sentence that was or is imposed before, on, or after the effective date of the amendatory Act, and the period of incarceration for eligibility of each such person to submit a petition for parole is based on all previous consecutive years of incarceration served by that person before, on, and after the effective date of the amendatory Act. Effective immediately."}], "other_titles": [], "other_identifiers": [], "actions": [{"description": "Filed with the Clerk by Rep. Justin Slaughter", "date": "2025-02-07", "organization_id": "~{\"classification\": \"lower\"}", "classification": ["filing"], "related_entities": []}, {"description": "First Reading", "date": "2025-02-18", "organization_id": "~{\"classification\": \"lower\"}", "classification": ["reading-1"], "related_entities": []}, {"description": "Referred to Rules Committee", "date": "2025-02-18", "organization_id": "~{\"classification\": \"lower\"}", "classification": [], "related_entities": []}, {"description": "Assigned to Judiciary - Criminal Committee", "date": "2025-03-11", "organization_id": "~{\"classification\": \"lower\"}", "classification": ["referral-committee"], "related_entities": []}, {"description": "Rule 19(a) / Re-referred to Rules Committee", "date": "2025-03-21", "organization_id": "~{\"classification\": \"lower\"}", "classification": [], "related_entities": []}], "sponsorships": [{"name": "Justin Slaughter", "classification": "primary", "entity_type": "person", "primary": true, "person_id": "~{\"chamber\": \"lower\", \"name\": \"Justin Slaughter\"}", "organization_id": null}], "related_bills": [], "versions": [{"note": "Introduced", "links": [{"url": "https://beta.ilga.gov/documents/legislation/104/HB/PDF/10400HB3509.pdf", "media_type": "application/pdf"}, {"url": "https://beta.ilga.gov/Legislation/BillStatus/FullText?LegDocId=201982&DocName=10400HB3509&DocNum=3509&DocTypeID=HB&LegID=162194&GAID=18&SessionID=114&SpecSess=&Session=&Print=1", "media_type": "text/html"}], "date": "", "classification": ""}], "documents": [], "citations": [], "sources": [{"url": "https://beta.ilga.gov/Legislation/BillStatus?DocNum=3509&GAID=18&DocTypeID=HB&LegId=162194&SessionID=114", "note": ""}], "extras": {}, "_id": "330448b2-1729-11f0-9eaa-86812f74cec2"}