{"legislative_session": "104th", "identifier": "HB3239", "title": "FREEDOM TO RIDE", "from_organization": "~{\"classification\": \"lower\"}", "classification": ["bill"], "subject": [], "abstracts": [{"note": "", "abstract": "Amends the Illinois Vehicle Code. Sets forth provisions concerning certificates of title and registration plates for large non-highway vehicles and recreational off-highway vehicles. Requires every owner of a large non-highway vehicle or a recreational off-highway vehicle to make application to the Secretary of State for registration, or renewal of registration, at a fee of $30 every 2 years. Sets forth provisions concerning the distribution of the fees. Removes provisions requiring surcharges to be collected for each non-highway vehicle and each off-highway vehicle. Provides that the cost for a Certificate of Title for a large non-highway vehicle and recreational off-highway vehicle is $250. Provides that the cost for a Certificate of Title for a large non-highway vehicle and recreational off-highway vehicle used for production agriculture, or accepted by a dealer in trade is $125. Provides that if the operation of a utility-type vehicle is authorized, then the utility-type vehicle may be operated only during daylight hours at a maximum speed of 45 miles per hour on streets where the posted speed limit is 55 miles per hour or less. Prohibits a person from operating a utility-type vehicle upon any street, highway, or roadway in the State unless the person has a valid driver's license issued in the person's name by the Secretary of State or by a foreign jurisdiction and the person is 18 years of age. Prohibits a person operating a utility-type vehicle from making a direct crossing upon or across any tollroad, interstate highway, or controlled access highway in the State, and prohibits a person operating a utility-type vehicle from making a direct crossing upon or across any other highway under the jurisdiction of the State except at an intersection of the highway with another public street, road, or highway. Provides additional requirements for utility-type vehicles. Adds language to allow ordinances to supersede specified provisions concerning large non-highway vehicles and utility-type vehicles."}], "other_titles": [], "other_identifiers": [], "actions": [{"description": "Filed with the Clerk by Rep. Tony M. McCombie", "date": "2025-02-06", "organization_id": "~{\"classification\": \"lower\"}", "classification": ["filing"], "related_entities": []}, {"description": "First Reading", "date": "2025-02-18", "organization_id": "~{\"classification\": \"lower\"}", "classification": ["reading-1"], "related_entities": []}, {"description": "Referred to Rules Committee", "date": "2025-02-18", "organization_id": "~{\"classification\": \"lower\"}", "classification": [], "related_entities": []}], "sponsorships": [{"name": "Tony M. McCombie", "classification": "primary", "entity_type": "person", "primary": true, "person_id": "~{\"chamber\": \"lower\", \"name\": \"Tony M. McCombie\"}", "organization_id": null}], "related_bills": [], "versions": [{"note": "Introduced", "links": [{"url": "https://beta.ilga.gov/documents/legislation/104/HB/PDF/10400HB3239.pdf", "media_type": "application/pdf"}, {"url": "https://beta.ilga.gov/Legislation/BillStatus/FullText?LegDocId=201512&DocName=10400HB3239&DocNum=3239&DocTypeID=HB&LegID=161724&GAID=18&SessionID=114&SpecSess=&Session=&Print=1", "media_type": "text/html"}], "date": "", "classification": ""}], "documents": [], "citations": [], "sources": [{"url": "https://beta.ilga.gov/Legislation/BillStatus?DocNum=3239&GAID=18&DocTypeID=HB&LegId=161724&SessionID=114", "note": ""}], "extras": {}, "_id": "0f033eb4-1729-11f0-9eaa-86812f74cec2"}