{"legislative_session": "104th", "identifier": "SB1954", "title": "COUNTIES CD-RECALL OFFICIALS", "from_organization": "~{\"classification\": \"upper\"}", "classification": ["bill"], "subject": [], "abstracts": [{"note": "", "abstract": "Amends the Counties Code. Creates the Recall of Countywide Elected Officials Division within the Code. Authorizes a county to establish a process by which countywide elected officials may be recalled by the electors of the county by referendum or petition. Provides that, if a county board adopts a resolution calling for a referendum on the proposal to adopt a process by which countywide elected officials may be recalled by the electors of the county, then the county clerk and county board shall provide for the submission of the proposition to the electors of the county at the next general election held in an even-numbered year. Provides that, if there is filed with the clerk of the circuit court of the county, within the time provided in the general election law, a petition that is signed by the specified number of registered voters in the county and that requests the establishment of a process by which countywide elected officials may be recalled by the electors of that county, the clerk of the circuit court shall transmit the petition to the chief judge of the circuit court who shall determine the sufficiency of the petition or shall assign the determination of the sufficiency of the petition to a circuit judge who shall make the determination. Specifies that, if the judge determines that the petition is sufficient, the judge shall certify the sufficiency of the petition and shall issue an order directing the county clerk and the county board to provide for the submission of the proposition to the electors of the county at the next general election held in an even-numbered year. Authorizes the recall of a countywide elected official to be proposed by petition by the electors of the county. Sets forth requirements for the petition. Provides that, if the petition is valid and sufficient, then the State Board of Elections shall certify the petition, and the question must be submitted to the electors at a special election. Prohibits more than one recall petition per official per term of office. Effective immediately."}], "other_titles": [], "other_identifiers": [], "actions": [{"description": "Filed with Secretary by Sen. Doris Turner", "date": "2025-02-06", "organization_id": "~{\"classification\": \"upper\"}", "classification": ["filing"], "related_entities": []}, {"description": "First Reading", "date": "2025-02-06", "organization_id": "~{\"classification\": \"upper\"}", "classification": ["reading-1"], "related_entities": []}, {"description": "Referred to Assignments", "date": "2025-02-06", "organization_id": "~{\"classification\": \"upper\"}", "classification": [], "related_entities": []}, {"description": "Assigned to Executive", "date": "2025-03-12", "organization_id": "~{\"classification\": \"upper\"}", "classification": ["referral-committee"], "related_entities": []}, {"description": "Rule 2-10 Committee Deadline Established As April 4, 2025", "date": "2025-03-21", "organization_id": "~{\"classification\": \"upper\"}", "classification": [], "related_entities": []}], "sponsorships": [{"name": "Doris Turner", "classification": "primary", "entity_type": "person", "primary": true, "person_id": "~{\"chamber\": \"upper\", \"name\": \"Doris Turner\"}", "organization_id": null}], "related_bills": [], "versions": [{"note": "Introduced", "links": [{"url": "https://beta.ilga.gov/documents/legislation/104/SB/PDF/10400SB1954.pdf", "media_type": "application/pdf"}, {"url": "https://beta.ilga.gov/Legislation/BillStatus/FullText?LegDocId=201130&DocName=10400SB1954&DocNum=1954&DocTypeID=SB&LegID=161342&GAID=18&SessionID=114&SpecSess=&Session=&Print=1", "media_type": "text/html"}], "date": "", "classification": ""}], "documents": [], "citations": [], "sources": [{"url": "https://beta.ilga.gov/Legislation/BillStatus?DocNum=1954&GAID=18&DocTypeID=SB&LegId=161342&SessionID=114", "note": ""}], "extras": {}, "_id": "a6d8aab6-172a-11f0-9eaa-86812f74cec2"}