{"legislative_session": "104th", "identifier": "HB3792", "title": "BALANCED BUDGET", "from_organization": "~{\"classification\": \"lower\"}", "classification": ["bill"], "subject": [], "abstracts": [{"note": "", "abstract": "Amends the Budget Law of the Civil Administrative Code of Illinois. Provides that, beginning with budgets prepared for fiscal year 2027, revenue estimates shall be based solely on receipts from taxes, fees, and federal transfers and shall not include debt incurred, existing debt refinanced, or additional funds appropriated, assigned, or transferred from another fund. Provides that appropriations for a fiscal year shall not exceed revenue estimated by the General Assembly to be available during that year. Provides that, except for deficiency or emergency appropriations, all appropriations are expendable only during the fiscal year for which they were appropriated, except that the General Assembly may provide for appropriations from the Budget Stabilization Fund in excess of revenue estimated by the General Assembly to be available during that year by adoption of a resolution approved by a record vote of three-fifths of the members of each chamber. Provides that the excess appropriations may not exceed the total amount available in the Budget Stabilization Fund. Provides that no public money shall be expended except pursuant to appropriations made by law. Provides that expenditures for any fiscal year shall not exceed the State's revenues and reserves in the general funds, including proceeds of any debt obligation, for that year. Provides that no debt obligation, except as shall be repaid within the fiscal year of issuance, shall be authorized for the current operation of any service or program, nor shall the proceeds of any debt obligation be expended for a purpose other than that for which it was authorized. Provides that any law requiring the expenditure of funds shall be null and void unless, during the session in which the Act receives final passage, an appropriation is made for the estimated first year's funding. Effective immediately."}], "other_titles": [], "other_identifiers": [], "actions": [{"description": "Filed with the Clerk by Rep. Regan Deering", "date": "2025-02-07", "organization_id": "~{\"classification\": \"lower\"}", "classification": ["filing"], "related_entities": []}, {"description": "First Reading", "date": "2025-02-18", "organization_id": "~{\"classification\": \"lower\"}", "classification": ["reading-1"], "related_entities": []}, {"description": "Referred to Rules Committee", "date": "2025-02-18", "organization_id": "~{\"classification\": \"lower\"}", "classification": [], "related_entities": []}], "sponsorships": [{"name": "Regan Deering", "classification": "primary", "entity_type": "person", "primary": true, "person_id": "~{\"chamber\": \"lower\", \"name\": \"Regan Deering\"}", "organization_id": null}], "related_bills": [], "versions": [{"note": "Introduced", "links": [{"url": "https://beta.ilga.gov/documents/legislation/104/HB/PDF/10400HB3792.pdf", "media_type": "application/pdf"}, {"url": "https://beta.ilga.gov/Legislation/BillStatus/FullText?LegDocId=202445&DocName=10400HB3792&DocNum=3792&DocTypeID=HB&LegID=162661&GAID=18&SessionID=114&SpecSess=&Session=&Print=1", "media_type": "text/html"}], "date": "", "classification": ""}], "documents": [], "citations": [], "sources": [{"url": "https://beta.ilga.gov/Legislation/BillStatus?DocNum=3792&GAID=18&DocTypeID=HB&LegId=162661&SessionID=114", "note": ""}], "extras": {}, "_id": "58aed654-1729-11f0-9eaa-86812f74cec2"}