{"legislative_session": "104th", "identifier": "HB1211", "title": "SCH CD-EDUCATOR LICENSE-TEMP", "from_organization": "~{\"classification\": \"lower\"}", "classification": ["bill"], "subject": [], "abstracts": [{"note": "", "abstract": "Amends the School Code. Provides that, beginning with the 2025-2026 school year, the State Board of Education, in consultation with the State Educator Preparation and Licensure Board, shall establish and maintain a Temporary Teacher Apprenticeship Program to assist qualified participants in acquiring a Professional Educator License. Provides that the State Board of Education, in consultation with the State Educator Preparation and Licensure Board, may establish and adopt any rules necessary to implement this program, including the standards that a qualified participant must meet to receive a Professional Educator License. Sets forth the requirements to complete the program. Provides that upon completing the requirements of the program, a qualified participant is eligible for a Professional Educator License. Makes related changes. Provides that a foreign language endorsement on an Educator License with Stipulations may be issued to an applicant who provides satisfactory evidence that he or she meets specified requirements. Provides that the foreign language endorsement on an Educator License with Stipulations is valid until June 30 immediately following 5 years of the endorsement being issued and may be renewed. Provides that an individual who holds a valid foreign language endorsement on an Educator License with Stipulations may teach a course on the foreign language for which the foreign language endorsement is issued. Provides that an individual who holds a valid foreign language endorsement on an Educator License with Stipulations but does not hold a bachelor's degree may substitute teach in foreign language classrooms. Effective July 1, 2025."}], "other_titles": [], "other_identifiers": [], "actions": [{"description": "Filed with the Clerk by Rep. David Friess", "date": "2025-01-09", "organization_id": "~{\"classification\": \"lower\"}", "classification": ["filing"], "related_entities": []}, {"description": "First Reading", "date": "2025-01-09", "organization_id": "~{\"classification\": \"lower\"}", "classification": ["reading-1"], "related_entities": []}, {"description": "Referred to Rules Committee", "date": "2025-01-09", "organization_id": "~{\"classification\": \"lower\"}", "classification": [], "related_entities": []}], "sponsorships": [{"name": "David Friess", "classification": "primary", "entity_type": "person", "primary": true, "person_id": "~{\"chamber\": \"lower\", \"name\": \"David Friess\"}", "organization_id": null}], "related_bills": [], "versions": [{"note": "Introduced", "links": [{"url": "https://beta.ilga.gov/documents/legislation/104/HB/PDF/10400HB1211.pdf", "media_type": "application/pdf"}, {"url": "https://beta.ilga.gov/Legislation/BillStatus/FullText?LegDocId=196792&DocName=10400HB1211&DocNum=1211&DocTypeID=HB&LegID=157001&GAID=18&SessionID=114&SpecSess=&Session=&Print=1", "media_type": "text/html"}], "date": "", "classification": ""}], "documents": [], "citations": [], "sources": [{"url": "https://beta.ilga.gov/Legislation/BillStatus?DocNum=1211&GAID=18&DocTypeID=HB&LegId=157001&SessionID=114", "note": ""}], "extras": {}, "_id": "049baea8-1728-11f0-9eaa-86812f74cec2"}