{"legislative_session": "104th", "identifier": "HB4000", "title": "LAW ENFORCEMENT-BODY CAMERAS", "from_organization": "~{\"classification\": \"lower\"}", "classification": ["bill"], "subject": [], "abstracts": [{"note": "", "abstract": "Amends the Law Enforcement Officer-Worn Body Camera Act. Provides that the Act does not apply to school resource officers, undercover or covert officers, or officers that are employed in an administrative capacity, except when undercover or covert officers are conducting interviews. Provides that a law enforcement officer is \"in uniform\" only when primarily assigned to respond to law enforcement-related encounters or activities. Adds a definition for \"no expectation of privacy\". Provides that, on and after January 1, 2027, an officer no longer needs to provide notice of recording to a person that has a reasonable expectation of privacy. Removes provisions prohibiting officers from viewing recordings prior to completing a report. Modifies exceptions to destruction of camera recordings if a recording has been flagged and when recordings may be used to discipline law enforcement officers. Provides that recordings are only subject to disclosure under the Freedom of Information Act when a recording is flagged due to the filing of a complaint, discharge of a firearm, use of force, arrest or detention, or resulting death or bodily harm and the subject of the encounter has a reasonable expectation of privacy at the time of the recording (removing other exceptions). Provides that only the subject of the recording or the subject's legal representative may obtain the portion of the recording containing the subject if the subject or legal representative provides written authorization to release the video. Makes other changes. Amends the Criminal Code of 2012 and Freedom of Information Act making conforming changes. Amends the Law Enforcement Camera Grant Act. Removes a requirement to include criminal and other violations and civil proceedings in which the cameras were used in reports that must be provided by a law enforcement agency receiving a grant for in-car video cameras or for officer-worn body cameras. Further amends the Criminal Code of 2012. Provides that a person also obstructs justice when, with intent to prevent the apprehension or obstruct the prosecution or defense of any person, he or she knowingly takes a body camera or any part of a body camera from a person known to be a peace officer. Provides that a violation is either a Class 1 felony or Class 2 felony."}], "other_titles": [], "other_identifiers": [], "actions": [{"description": "Filed with the Clerk by Rep. Dennis Tipsword", "date": "2025-02-27", "organization_id": "~{\"classification\": \"lower\"}", "classification": ["filing"], "related_entities": []}, {"description": "First Reading", "date": "2025-03-04", "organization_id": "~{\"classification\": \"lower\"}", "classification": ["reading-1"], "related_entities": []}, {"description": "Referred to Rules Committee", "date": "2025-03-04", "organization_id": "~{\"classification\": \"lower\"}", "classification": [], "related_entities": []}], "sponsorships": [{"name": "Dennis Tipsword", "classification": "primary", "entity_type": "person", "primary": true, "person_id": "~{\"chamber\": \"lower\", \"name\": \"Dennis Tipsword\"}", "organization_id": null}], "related_bills": [], "versions": [{"note": "Introduced", "links": [{"url": "https://beta.ilga.gov/documents/legislation/104/HB/PDF/10400HB4000.pdf", "media_type": "application/pdf"}, {"url": "https://beta.ilga.gov/Legislation/BillStatus/FullText?LegDocId=202993&DocName=10400HB4000&DocNum=4000&DocTypeID=HB&LegID=163111&GAID=18&SessionID=114&SpecSess=&Session=&Print=1", "media_type": "text/html"}], "date": "", "classification": ""}], "documents": [], "citations": [], "sources": [{"url": "https://beta.ilga.gov/Legislation/BillStatus?DocNum=4000&GAID=18&DocTypeID=HB&LegId=163111&SessionID=114", "note": ""}], "extras": {}, "_id": "72a93be4-1729-11f0-9eaa-86812f74cec2"}