{"legislative_session": "104th", "identifier": "SB2363", "title": "LIDAR TECHNOLOGY SECURITY", "from_organization": "~{\"classification\": \"upper\"}", "classification": ["bill"], "subject": [], "abstracts": [{"note": "", "abstract": "Creates the Light Detection and Ranging Technology Security Act. Provides that all State infrastructure located within or serving Illinois shall be constructed so as not to include any light detection and ranging (LIDAR) equipment manufactured in or by, including any equipment whose critical or necessary components are manufactured in or by, a company domiciled within a country of concern, or a company owned by a company domiciled in a country of concern. Provides that all State infrastructure in operation within or serving Illinois, including any covered infrastructure that is not permanently disabled, that contains LIDAR equipment prohibited by the Act shall be removed and replaced with LIDAR equipment that is not prohibited by the Act within 90 days after the effective date of the Act. Provides that an agency, private entity, or political subdivision primarily responsible for any covered infrastructure that includes prohibited LIDAR equipment may request a reimbursement up to the cost of the original purchase price of such prohibited LIDAR equipment from the State Comptroller, provided the request includes purchase orders and is submitted within 90 days after the effective date of the Act. Provides that no procurement made by the State government or a political subdivision of the State government can include LIDAR equipment manufactured in or by, including any equipment whose critical or necessary components are manufactured in or by, a company domiciled within a country of concern, or a company owned by a company domiciled in a country of concern. Defines \"country of concern\" as the People's Republic of China, the Russian Federation, the Islamic Republic of Iran, the Democratic People's Republic of Korea, the Republic of Cuba, the Venezuelan regime of Nicolas Maduro, or the Syrian Arab Republic, or any other entity deemed by the Governor in consultation with the Director of the Illinois Emergency Management Agency and Office of Homeland Security (IEMA-OHS). Defines other terms. Provides that the Act is fully enforceable as of 90 days after the effective date of the Act. Contains a severability provision."}], "other_titles": [], "other_identifiers": [], "actions": [{"description": "Filed with Secretary by Sen. Jason Plummer", "date": "2025-02-07", "organization_id": "~{\"classification\": \"upper\"}", "classification": ["filing"], "related_entities": []}, {"description": "First Reading", "date": "2025-02-07", "organization_id": "~{\"classification\": \"upper\"}", "classification": ["reading-1"], "related_entities": []}, {"description": "Referred to Assignments", "date": "2025-02-07", "organization_id": "~{\"classification\": \"upper\"}", "classification": [], "related_entities": []}], "sponsorships": [{"name": "Jason Plummer", "classification": "primary", "entity_type": "person", "primary": true, "person_id": "~{\"chamber\": \"upper\", \"name\": \"Jason Plummer\"}", "organization_id": null}], "related_bills": [], "versions": [{"note": "Introduced", "links": [{"url": "https://beta.ilga.gov/documents/legislation/104/SB/PDF/10400SB2363.pdf", "media_type": "application/pdf"}, {"url": "https://beta.ilga.gov/Legislation/BillStatus/FullText?LegDocId=202133&DocName=10400SB2363&DocNum=2363&DocTypeID=SB&LegID=162345&GAID=18&SessionID=114&SpecSess=&Session=&Print=1", "media_type": "text/html"}], "date": "", "classification": ""}], "documents": [], "citations": [], "sources": [{"url": "https://beta.ilga.gov/Legislation/BillStatus?DocNum=2363&GAID=18&DocTypeID=SB&LegId=162345&SessionID=114", "note": ""}], "extras": {}, "_id": "ddd9e732-172a-11f0-9eaa-86812f74cec2"}