{"legislative_session": "104th", "identifier": "HB1937", "title": "APA-SURVEY", "from_organization": "~{\"classification\": \"lower\"}", "classification": ["bill"], "subject": [], "abstracts": [{"note": "", "abstract": "Amends the Illinois State Auditing Act. Requires the Auditor General to conduct a survey of the Illinois Administrative Code to determine how many mandates and restrictions are imposed by the Illinois Administrative Code on (i) persons, firms, and other entities within the Illinois private sector and (ii) units of local government and taxing bodies other than the State of Illinois. Allows the Auditor General to contract with a private entity to fulfill some or all of these requirements. Allows the use of artificial intelligence for these requirements. Requires the Auditor General to prepare and submit a report within 2 years of the effective date of the Act. Amends the Illinois Administrative Procedure Act. Provides that each State agency shall, within 9 months of the submission of the report by the Auditor General, submit a follow-up report to the Governor, the General Assembly, and the Joint Committee on Administrative Rules acknowledging the findings within the report. Allows a State agency to use artificial intelligence for these requirements. Requires the Joint Committee on Administrative Rules to supervise. Provides that the Joint Committee shall, within 3 months of the submission of the follow-up reports, calculate each State agency's share of the total amount of mandates and restrictions and submit a report with these calculations. Provides that each State agency shall, within 2 years of the submission of the follow-up reports, adopt, amend, or repeal rules sufficient to effectuate a reduction in the total amount of mandates and restrictions to 250,000 or 80% of the amount in the Auditor General's report, whichever is lesser."}], "other_titles": [], "other_identifiers": [], "actions": [{"description": "Filed with the Clerk by Rep. Jed Davis", "date": "2025-01-29", "organization_id": "~{\"classification\": \"lower\"}", "classification": ["filing"], "related_entities": []}, {"description": "First Reading", "date": "2025-02-04", "organization_id": "~{\"classification\": \"lower\"}", "classification": ["reading-1"], "related_entities": []}, {"description": "Referred to Rules Committee", "date": "2025-02-04", "organization_id": "~{\"classification\": \"lower\"}", "classification": [], "related_entities": []}], "sponsorships": [{"name": "Jed Davis", "classification": "primary", "entity_type": "person", "primary": true, "person_id": "~{\"chamber\": \"lower\", \"name\": \"Jed Davis\"}", "organization_id": null}], "related_bills": [], "versions": [{"note": "Introduced", "links": [{"url": "https://beta.ilga.gov/documents/legislation/104/HB/PDF/10400HB1937.pdf", "media_type": "application/pdf"}, {"url": "https://beta.ilga.gov/Legislation/BillStatus/FullText?LegDocId=199368&DocName=10400HB1937&DocNum=1937&DocTypeID=HB&LegID=159580&GAID=18&SessionID=114&SpecSess=&Session=&Print=1", "media_type": "text/html"}], "date": "", "classification": ""}], "documents": [], "citations": [], "sources": [{"url": "https://beta.ilga.gov/Legislation/BillStatus?DocNum=1937&GAID=18&DocTypeID=HB&LegId=159580&SessionID=114", "note": ""}], "extras": {}, "_id": "63981216-1728-11f0-9eaa-86812f74cec2"}