{"legislative_session": "104th", "identifier": "HB1755", "title": "AGING-BENEFITS ACCESS PROGRAM", "from_organization": "~{\"classification\": \"lower\"}", "classification": ["bill"], "subject": [], "abstracts": [{"note": "", "abstract": "Repeals the Senior Citizens and Persons with Disabilities Property Tax Relief Act and removes all cross-references to the Act in various statutes. Amends the Illinois Act on the Aging. Requires the Department on Aging to implement and administer the Benefits Access Program and to establish the eligibility criteria under the program for: (1) the Secretary of State with respect to reduced fees paid by qualified vehicle owners under the Illinois Vehicle Code; (2) special districts that offer free fixed route public transportation services for qualified older adults under the Local Mass Transit District Act, the Metropolitan Transit Authority Act, and the Regional Transportation Authority Act; and (3) special districts that offer transit services for qualified individuals with disabilities under the Local Mass Transit District Act, the Metropolitan Transit Authority Act, and the Regional Transportation Authority Act. Sets forth household income eligibility limits and other eligibility requirements under the program. Authorizes the Department to adopt rules concerning automatic renewals and appeal rights under the program. Makes corresponding changes concerning the program to the Metropolitan Transit Authority Act, the Local Mass Transit District Act, the Regional Transportation Authority Act, the Illinois Public Aid Code, the Older Adult Services Act, and the Illinois Vehicle Code. Further amends the Illinois Act on the Aging by removing a requirement that the Department: (i) study the feasibility of implementing an affirmative action employment plan for the recruitment, hiring, and training of persons 60 years of age or older; and (ii) develop a multilingual pamphlet to assist physicians, pharmacists, and patients in monitoring prescriptions provided by various physicians and to aid persons 65 years of age or older in complying with directions for proper use of pharmaceutical prescriptions. Adds a requirement that the Department implement the Older Americans Act. Removes provisions requiring a Community Care Program Medicaid Initiative and a Community Care Program Medicaid Enrollment Oversight Subcommittee. Makes other changes."}], "other_titles": [], "other_identifiers": [], "actions": [{"description": "Filed with the Clerk by Rep. Michelle Mussman", "date": "2025-01-24", "organization_id": "~{\"classification\": \"lower\"}", "classification": ["filing"], "related_entities": []}, {"description": "First Reading", "date": "2025-01-28", "organization_id": "~{\"classification\": \"lower\"}", "classification": ["reading-1"], "related_entities": []}, {"description": "Referred to Rules Committee", "date": "2025-01-28", "organization_id": "~{\"classification\": \"lower\"}", "classification": [], "related_entities": []}, {"description": "Assigned to Human Services Committee", "date": "2025-02-25", "organization_id": "~{\"classification\": \"lower\"}", "classification": ["referral-committee"], "related_entities": []}, {"description": "Rule 19(a) / Re-referred to Rules Committee", "date": "2025-03-21", "organization_id": "~{\"classification\": \"lower\"}", "classification": [], "related_entities": []}], "sponsorships": [{"name": "Michelle Mussman", "classification": "primary", "entity_type": "person", "primary": true, "person_id": "~{\"chamber\": \"lower\", \"name\": \"Michelle Mussman\"}", "organization_id": null}], "related_bills": [], "versions": [{"note": "Introduced", "links": [{"url": "https://beta.ilga.gov/documents/legislation/104/HB/PDF/10400HB1755.pdf", "media_type": "application/pdf"}, {"url": "https://beta.ilga.gov/Legislation/BillStatus/FullText?LegDocId=198908&DocName=10400HB1755&DocNum=1755&DocTypeID=HB&LegID=159118&GAID=18&SessionID=114&SpecSess=&Session=&Print=1", "media_type": "text/html"}], "date": "", "classification": ""}], "documents": [], "citations": [], "sources": [{"url": "https://beta.ilga.gov/Legislation/BillStatus?DocNum=1755&GAID=18&DocTypeID=HB&LegId=159118&SessionID=114", "note": ""}], "extras": {}, "_id": "4be84582-1728-11f0-9eaa-86812f74cec2"}