{"legislative_session": "104th", "identifier": "HR26", "title": "RULES-AMEND", "from_organization": "~{\"classification\": \"lower\"}", "classification": ["resolution"], "subject": [], "abstracts": [{"note": "", "abstract": "Adds a rule authorizing a member to designate a House Bill as a Priority Bill when filing it with the Clerk. Requires Chairpersons to make a good-faith effort to facilitate committee consideration of each Priority Bill at a time when the Principal Sponsor or the Principal Sponsor's designee, and their necessary witnesses, are available. Requires a Priority Bill posted for a particular hearing to be considered by the committee before consideration of legislative measures without that designation if the Principal Sponsor or designee consents to consideration at that time. Provides that, if the Principal Sponsor or the Principal Sponsor's designee fails to present the bill during the first or second hearing for which the bill was posted or if the Principal Sponsor or the Principal Sponsor's designee withdraws consent for consideration at the hearing, the committee may hear testimony and vote one time on a reporting motion for that bill without the consent of the Principal Sponsor or the Principal Sponsor's designee at the third or subsequent hearing for which the bill is posted. Authorizes only the Principal Sponsor or chief co-sponsor of a Priority Bill to offer a committee amendment to the bill. Provides that each Priority Bill that remains pending in any committee at 5:00 p.m. on April 1 shall be automatically discharged to the House and placed on the calendar on the order of Second Reading, unless a standing or special committee has provided an opportunity for public testimony on the bill at a posted hearing and taken a record vote on a motion to report the bill to the House. Declares that certain deadlines do not apply to Priority Bills. Requires the Journal and Legislative Digest to reference a Priority Bill in a manner that identifies that designation. Prohibits Priority Bill status from being revoked or transferred to another bill. Provides that a Chairperson who fails to implement and comply with these requirements may be subject to disciplinary action under the House rules. Prohibits the suspension of these rules."}], "other_titles": [], "other_identifiers": [], "actions": [{"description": "Filed with the Clerk by Rep. Patrick Windhorst", "date": "2025-01-09", "organization_id": "~{\"classification\": \"lower\"}", "classification": ["filing"], "related_entities": []}, {"description": "Referred to Rules Committee", "date": "2025-01-28", "organization_id": "~{\"classification\": \"lower\"}", "classification": [], "related_entities": []}], "sponsorships": [{"name": "Patrick Windhorst", "classification": "primary", "entity_type": "person", "primary": true, "person_id": "~{\"chamber\": \"lower\", \"name\": \"Patrick Windhorst\"}", "organization_id": null}], "related_bills": [], "versions": [{"note": "Introduced", "links": [{"url": "https://beta.ilga.gov/documents/legislation/104/HR/PDF/10400HR0026.pdf", "media_type": "application/pdf"}, {"url": "https://beta.ilga.gov/Legislation/BillStatus/FullText?LegDocId=196759&DocName=10400HR0026&DocNum=26&DocTypeID=HR&LegID=156968&GAID=18&SessionID=114&SpecSess=&Session=&Print=1", "media_type": "text/html"}], "date": "", "classification": ""}], "documents": [], "citations": [], "sources": [{"url": "https://beta.ilga.gov/Legislation/BillStatus?DocNum=26&GAID=18&DocTypeID=HR&LegId=156968&SessionID=114", "note": ""}], "extras": {}, "_id": "799fb662-1729-11f0-9eaa-86812f74cec2"}