{"legislative_session": "104th", "identifier": "SB21", "title": "HOSPITAL STAFFING LEVELS", "from_organization": "~{\"classification\": \"upper\"}", "classification": ["bill"], "subject": [], "abstracts": [{"note": "", "abstract": "Amends the Hospital Licensing Act. Defines \"hospital worker\" as any person who receives an hourly wage, directly or indirectly via a subcontractor, from a hospital licensed under the Act. In provisions concerning limitations on mandated overtime and requiring rest periods for nurses, replaces \"nurse\" with \"hospital worker\". Requires additional hospital staffing information to be reported to the Department of Public Health, including any and all staffing matrices, staffing metrics, and underlying materials used to determine the metrics. Provides that the Department shall produce an annual report based on staffing disclosures and make recommendations for minimum staffing standards for hospital workers in each hospital unit. Requires hospitals to conduct a competency validation for each hospital worker hired, as a condition of employment, within the first month of employment and at no cost to the new hire. Provides that each hospital worker's competency validation must be submitted to the Department within 2 weeks after the hospital worker's start date. Establishes ongoing verification requirements for each hospital worker, and requires hospitals to submit a list of all competent employees currently employed at the end of each calendar year. Requires the Department to maintain, and make available to the public, a registry of all competent employees, including the hospital worker's name, address, contact information, and current employer. Provides that hospital employers that fail to comply with the competency validations requirements shall receive a fine equal to 0.1% of annual revenue reported during the most recently completed fiscal year each day until the hospital complies. Sets forth provisions concerning a hospital's requirements regarding assignment despite objection forms, a resolution process under the Department for assignment despite objection for certain hospital workers, and a fine for hospitals that fail to honor the assignment despite objection process. Makes other changes."}], "other_titles": [], "other_identifiers": [], "actions": [{"description": "Filed with Secretary by Sen. Christopher Belt", "date": "2025-01-13", "organization_id": "~{\"classification\": \"upper\"}", "classification": ["filing"], "related_entities": []}, {"description": "First Reading", "date": "2025-01-13", "organization_id": "~{\"classification\": \"upper\"}", "classification": ["reading-1"], "related_entities": []}, {"description": "Referred to Assignments", "date": "2025-01-13", "organization_id": "~{\"classification\": \"upper\"}", "classification": [], "related_entities": []}], "sponsorships": [{"name": "Christopher Belt", "classification": "primary", "entity_type": "person", "primary": true, "person_id": "~{\"chamber\": \"upper\", \"name\": \"Christopher Belt\"}", "organization_id": null}], "related_bills": [], "versions": [{"note": "Introduced", "links": [{"url": "https://beta.ilga.gov/documents/legislation/104/SB/PDF/10400SB0021.pdf", "media_type": "application/pdf"}, {"url": "https://beta.ilga.gov/Legislation/BillStatus/FullText?LegDocId=196911&DocName=10400SB0021&DocNum=21&DocTypeID=SB&LegID=157120&GAID=18&SessionID=114&SpecSess=&Session=&Print=1", "media_type": "text/html"}], "date": "", "classification": ""}], "documents": [], "citations": [], "sources": [{"url": "https://beta.ilga.gov/Legislation/BillStatus?DocNum=21&GAID=18&DocTypeID=SB&LegId=157120&SessionID=114", "note": ""}], "extras": {}, "_id": "9898c09a-1729-11f0-9eaa-86812f74cec2"}