{"legislative_session": "104th", "identifier": "HB3424", "title": "VICTIM PROTECTION ACT", "from_organization": "~{\"classification\": \"lower\"}", "classification": ["bill"], "subject": [], "abstracts": [{"note": "", "abstract": "Amends the Rights of Crime Victims and Witnesses Act. Provides that the Prisoner Review Board shall publish on its official public website and provide to registered victims information regarding how to submit a victim impact statement. Provides that the Prisoner Review Board shall consider victim impact statements from any registered victims. Provides that any registered victim, including a person who has had a final, plenary, or non-emergency order of protection granted under the Protective Orders Article of the Code of Criminal Procedure of 1963 or under the Illinois Domestic Violence Act of 1986, may present victim statements that the Prisoner Review Board shall consider in its deliberations. Provides that at least 48 hours prior to early release of the prisoner from State custody or of the prisoner's pardon, commutation, furlough, or granting of sentence credit, the Prisoner Review Board shall inform a victim of the release if the victim has previously requested notification of that information. Provides that notification shall be made before 5 p.m. on weekdays. Provides that the Prisoner Review Board shall notify the victim in the underlying case of the offender's release on mandatory supervised release at least 30 days prior to release and shall allow the victim to provide a victim's statement to the Board. Provides that the victim's statement shall be considered when determining the conditions of the offender's mandatory supervised release. Provides that, before the Board makes a decision on whether to revoke an offender's parole or mandatory supervised release, the Prisoner Review Board must run a LEADS report. Provides that the Board shall publish on the Board's publicly accessible website the name and identification number of offenders alleged to have violated terms of parole or mandatory supervised release, the Board's decision whether to revoke parole or mandatory supervised release, and the names of the voting Board members. Provides that this information shall only be accessible while the offender is in State custody. Amends the Illinois Domestic Violence Act of 1986. Provides that a petition for an order of protection may not be denied upon the basis that the petitioner or the respondent is incarcerated in a penal institution at the time of the filing of the petition."}], "other_titles": [], "other_identifiers": [], "actions": [{"description": "Filed with the Clerk by Rep. Tony M. McCombie", "date": "2025-02-07", "organization_id": "~{\"classification\": \"lower\"}", "classification": ["filing"], "related_entities": []}, {"description": "First Reading", "date": "2025-02-18", "organization_id": "~{\"classification\": \"lower\"}", "classification": ["reading-1"], "related_entities": []}, {"description": "Referred to Rules Committee", "date": "2025-02-18", "organization_id": "~{\"classification\": \"lower\"}", "classification": [], "related_entities": []}], "sponsorships": [{"name": "Tony M. McCombie", "classification": "primary", "entity_type": "person", "primary": true, "person_id": "~{\"chamber\": \"lower\", \"name\": \"Tony M. McCombie\"}", "organization_id": null}], "related_bills": [], "versions": [{"note": "Introduced", "links": [{"url": "https://beta.ilga.gov/documents/legislation/104/HB/PDF/10400HB3424.pdf", "media_type": "application/pdf"}, {"url": "https://beta.ilga.gov/Legislation/BillStatus/FullText?LegDocId=201825&DocName=10400HB3424&DocNum=3424&DocTypeID=HB&LegID=162037&GAID=18&SessionID=114&SpecSess=&Session=&Print=1", "media_type": "text/html"}], "date": "", "classification": ""}], "documents": [], "citations": [], "sources": [{"url": "https://beta.ilga.gov/Legislation/BillStatus?DocNum=3424&GAID=18&DocTypeID=HB&LegId=162037&SessionID=114", "note": ""}], "extras": {}, "_id": "274922ae-1729-11f0-9eaa-86812f74cec2"}