{"legislative_session": "104th", "identifier": "SB2218", "title": "CONTINUING CARE AT HOME", "from_organization": "~{\"classification\": \"upper\"}", "classification": ["bill"], "subject": [], "abstracts": [{"note": "", "abstract": "Amends the Life Care Facilities Act. Requires the Department of Public Health to issue the preliminary certificate of registration, the certificate of registration, or the renewal certificate of registration to a provider or inform the provider of the Department's decision to deny any of the certificates no later than 30 days after the provider submits a completed application. Requires a provider to present the Department with certain materials to receive a certificate of registration, including a reasonable financial plan to provide at-home continuing care services. Provides that a reasonable financial plan provide at-home continuing care services includes execution of 25% of agreements necessary to meet the year-one actuarial forecast for the market to support the program. Sets forth requirements for each person employed by or under a contract with a provider. Requires a provider to comply with the Health Care Worker Background Check Act and the Health Care Worker Background Check Code for each person employed by or under a contract with a provider and who will enter a subscriber's home to provide at-home continuing care service. Requires a provider to check the status of all personnel applicants with the Nurse Aide Registry prior to hiring and shall not hiring any individual who has a finding of abuse, neglect, or misappropriation of property on the Nurse Aide Registry. Provides that, prior to employing or contracting with any individual in a position that requires a State professional license in the health care field, the provider shall check the status of the individual's license with the Illinois Department of Financial and Professional Regulation to verify that the individual's license is active."}], "other_titles": [], "other_identifiers": [], "actions": [{"description": "Filed with Secretary by Sen. Sara Feigenholtz", "date": "2025-02-07", "organization_id": "~{\"classification\": \"upper\"}", "classification": ["filing"], "related_entities": []}, {"description": "First Reading", "date": "2025-02-07", "organization_id": "~{\"classification\": \"upper\"}", "classification": ["reading-1"], "related_entities": []}, {"description": "Referred to Assignments", "date": "2025-02-07", "organization_id": "~{\"classification\": \"upper\"}", "classification": [], "related_entities": []}], "sponsorships": [{"name": "Sara Feigenholtz", "classification": "primary", "entity_type": "person", "primary": true, "person_id": "~{\"chamber\": \"upper\", \"name\": \"Sara Feigenholtz\"}", "organization_id": null}], "related_bills": [], "versions": [{"note": "Introduced", "links": [{"url": "https://beta.ilga.gov/documents/legislation/104/SB/PDF/10400SB2218.pdf", "media_type": "application/pdf"}, {"url": "https://beta.ilga.gov/Legislation/BillStatus/FullText?LegDocId=201747&DocName=10400SB2218&DocNum=2218&DocTypeID=SB&LegID=161959&GAID=18&SessionID=114&SpecSess=&Session=&Print=1", "media_type": "text/html"}], "date": "", "classification": ""}], "documents": [], "citations": [], "sources": [{"url": "https://beta.ilga.gov/Legislation/BillStatus?DocNum=2218&GAID=18&DocTypeID=SB&LegId=161959&SessionID=114", "note": ""}], "extras": {}, "_id": "ca575546-172a-11f0-9eaa-86812f74cec2"}