{"legislative_session": "104th", "identifier": "HB3369", "title": "AIR PASSENGER ACCOMMODATIONS", "from_organization": "~{\"classification\": \"lower\"}", "classification": ["bill"], "subject": [], "abstracts": [{"note": "", "abstract": "Amends the Illinois Aeronautics Act. Requires a carrier or an indirect carrier to provide assistance to an individual with a disability in a safe, dignified, and prompt manner. Provides that whether assistance is prompt shall depend on the totality of the circumstances. Provides that carriers shall provide or ensure the provision of timely assistance requested by or on behalf of an individual with a disability, or offered by carrier or airport operator personnel and accepted by an individual with a disability, in enplaning and deplaning. Provides requirements for deplaning an individual with a disability who is in an aisle chair. Provides that carriers must timely notify an individual with a disability regarding the status of the storage of the individual's assistive device in the cargo compartment. Provides that, if an individual's wheelchair or scooter is mishandled, the carrier must immediately notify the individual of his or her rights to take certain actions. Provides that a carrier shall presume liability for the mishandling of an individual's assistive device unless the carrier can demonstrate that the circumstances that led to the mishandling of the assistive device were outside of the carrier's control. Requires carriers to take certain actions if an individual's checked wheelchair or scooter has been delayed or lost, damaged, or pilfered. Provides that, if an individual with a disability is waiting for his or her mishandled personal wheelchair or scooter to be returned, repaired, or replaced, a carrier must use its best efforts to provide an adequate loaner wheelchair or scooter. Provides that, when conducting training for personnel, a carrier that operates aircraft with 19 or more passenger seats must ensure that the training meets certain requirements for all personnel who interact with the traveling public or who handle individuals' assistive devices as appropriate to the duties of each employee or contractor. Provides training requirements for employees designated as Complaints Resolution Officials."}], "other_titles": [], "other_identifiers": [], "actions": [{"description": "Filed with the Clerk by Rep. Yolonda Morris", "date": "2025-02-07", "organization_id": "~{\"classification\": \"lower\"}", "classification": ["filing"], "related_entities": []}, {"description": "First Reading", "date": "2025-02-18", "organization_id": "~{\"classification\": \"lower\"}", "classification": ["reading-1"], "related_entities": []}, {"description": "Referred to Rules Committee", "date": "2025-02-18", "organization_id": "~{\"classification\": \"lower\"}", "classification": [], "related_entities": []}], "sponsorships": [{"name": "Yolonda Morris", "classification": "primary", "entity_type": "person", "primary": true, "person_id": "~{\"chamber\": \"lower\", \"name\": \"Yolonda Morris\"}", "organization_id": null}], "related_bills": [], "versions": [{"note": "Introduced", "links": [{"url": "https://beta.ilga.gov/documents/legislation/104/HB/PDF/10400HB3369.pdf", "media_type": "application/pdf"}, {"url": "https://beta.ilga.gov/Legislation/BillStatus/FullText?LegDocId=201692&DocName=10400HB3369&DocNum=3369&DocTypeID=HB&LegID=161904&GAID=18&SessionID=114&SpecSess=&Session=&Print=1", "media_type": "text/html"}], "date": "", "classification": ""}], "documents": [], "citations": [], "sources": [{"url": "https://beta.ilga.gov/Legislation/BillStatus?DocNum=3369&GAID=18&DocTypeID=HB&LegId=161904&SessionID=114", "note": ""}], "extras": {}, "_id": "202e92f6-1729-11f0-9eaa-86812f74cec2"}