{"legislative_session": "104th", "identifier": "SB232", "title": "HOSPITAL PRICE TRANSPARENCY", "from_organization": "~{\"classification\": \"upper\"}", "classification": ["bill"], "subject": [], "abstracts": [{"note": "", "abstract": "Creates the Hospital Price Transparency Act. Provides that a hospital shall publish specified information regarding standard charges on its publicly accessible Internet website and provide hard copies upon request. Requires a hospital to maintain a list of all standard charges for all hospital items or services in accordance with the Act and ensure that the list is always available to the public, including publishing the list electronically in the specified manner. Provides that the list shall include a description of each hospital item or service provided by the hospital; specified charges for each individual hospital item or service when provided in either an inpatient setting or an outpatient department setting, as applicable; and a code used by the hospital for the purpose of accounting or billing for the hospital item or service, including the Current Procedural Terminology (CPT) code, the Healthcare Common Procedure Coding System (HCPCS) code, the Diagnosis Related Group (DRG) code, the National Drug Code (NDC), or other common identifiers. Requires a hospital to maintain and make publicly available a list of the standard charges for each of at least 300 shoppable services provided by the hospital with charges specific to that individual hospital location, except as specified in the Act. Sets forth provisions concerning duties of hospitals and the Department of Public Health relating to lists of all standard and shoppable charges; reporting requirements for hospitals; submission of complaints for violations of the Act; plans of correction for violations of the Act; sanctions and penalties; disclosure of facility fees; reporting requirements for the Department; and restrictions on hospitals initiating or pursuing a collection action if they are in violation of the Act. Effective July 1, 2026."}], "other_titles": [], "other_identifiers": [], "actions": [{"description": "Filed with Secretary by Sen. Cristina Castro", "date": "2025-01-22", "organization_id": "~{\"classification\": \"upper\"}", "classification": ["filing"], "related_entities": []}, {"description": "First Reading", "date": "2025-01-22", "organization_id": "~{\"classification\": \"upper\"}", "classification": ["reading-1"], "related_entities": []}, {"description": "Referred to Assignments", "date": "2025-01-22", "organization_id": "~{\"classification\": \"upper\"}", "classification": [], "related_entities": []}], "sponsorships": [{"name": "Cristina Castro", "classification": "primary", "entity_type": "person", "primary": true, "person_id": "~{\"chamber\": \"upper\", \"name\": \"Cristina Castro\"}", "organization_id": null}], "related_bills": [], "versions": [{"note": "Introduced", "links": [{"url": "https://beta.ilga.gov/documents/legislation/104/SB/PDF/10400SB0232.pdf", "media_type": "application/pdf"}, {"url": "https://beta.ilga.gov/Legislation/BillStatus/FullText?LegDocId=197362&DocName=10400SB0232&DocNum=232&DocTypeID=SB&LegID=157572&GAID=18&SessionID=114&SpecSess=&Session=&Print=1", "media_type": "text/html"}], "date": "", "classification": ""}], "documents": [], "citations": [], "sources": [{"url": "https://beta.ilga.gov/Legislation/BillStatus?DocNum=232&GAID=18&DocTypeID=SB&LegId=157572&SessionID=114", "note": ""}], "extras": {}, "_id": "b4f233b6-1729-11f0-9eaa-86812f74cec2"}