{"legislative_session": "104th", "identifier": "SB1252", "title": "STANDARD ID-DOCUMENTATION", "from_organization": "~{\"classification\": \"upper\"}", "classification": ["bill"], "subject": [], "abstracts": [{"note": "", "abstract": "Amends the Illinois Identification Card Act. Changes the definition of \"limited term REAL ID compliant identification card\". In a provision regarding applications, removes language providing that the Secretary of State may accept, as proof of date of birth and written signature for any applicant for a standard identification card who does not have a social security number or documentation issued by the United States Department of Homeland Security authorizing the applicant's presence in the country, any passport validly issued to the applicant from the applicant's country of citizenship or a consular identification document validly issued to the applicant by a consulate of that country. In a provisions regarding records, removes language providing that the Secretary: (1) may not release highly restricted personal information or personally identifying information or disclose specified documents to any immigration agent, unless necessary to comply with specified situations; and (2) shall not enter into or maintain any agreement regarding the sharing of any highly restricted personal information or personally identifying information or specified documents unless all other parties to such agreement certify that the information obtained will not be used for civil immigration purposes or knowingly disseminated to any third party for any purpose related to civil immigration enforcement. Makes other and conforming changes. Amends the Illinois Vehicle Code. Changes the definition of \"limited term Real ID compliant driver's license\". In a provision regarding the application for license or instruction permit, removes language providing that if an applicant is applying for a standard driver's license and, on the date of application, is ineligible for a social security number, then if the applicant does not have specified documentation the applicant may provide other specified documentation. Repeals a provision regarding the restrictions on the use of information for certain purposes. Makes other and conforming changes."}], "other_titles": [], "other_identifiers": [], "actions": [{"description": "Filed with Secretary by Sen. Andrew S. Chesney", "date": "2025-01-24", "organization_id": "~{\"classification\": \"upper\"}", "classification": ["filing"], "related_entities": []}, {"description": "First Reading", "date": "2025-01-24", "organization_id": "~{\"classification\": \"upper\"}", "classification": ["reading-1"], "related_entities": []}, {"description": "Referred to Assignments", "date": "2025-01-24", "organization_id": "~{\"classification\": \"upper\"}", "classification": [], "related_entities": []}], "sponsorships": [{"name": "Andrew S. Chesney", "classification": "primary", "entity_type": "person", "primary": true, "person_id": "~{\"chamber\": \"upper\", \"name\": \"Andrew S. Chesney\"}", "organization_id": null}], "related_bills": [], "versions": [{"note": "Introduced", "links": [{"url": "https://beta.ilga.gov/documents/legislation/104/SB/PDF/10400SB1252.pdf", "media_type": "application/pdf"}, {"url": "https://beta.ilga.gov/Legislation/BillStatus/FullText?LegDocId=198869&DocName=10400SB1252&DocNum=1252&DocTypeID=SB&LegID=159079&GAID=18&SessionID=114&SpecSess=&Session=&Print=1", "media_type": "text/html"}], "date": "", "classification": ""}], "documents": [], "citations": [], "sources": [{"url": "https://beta.ilga.gov/Legislation/BillStatus?DocNum=1252&GAID=18&DocTypeID=SB&LegId=159079&SessionID=114", "note": ""}], "extras": {}, "_id": "47e5e8e8-172a-11f0-9eaa-86812f74cec2"}