{"legislative_session": "104th", "identifier": "SB1930", "title": "VEH CD-CRASH-ELEC COMM DEV", "from_organization": "~{\"classification\": \"upper\"}", "classification": ["bill"], "subject": [], "abstracts": [{"note": "", "abstract": "Amends the Illinois Vehicle Code. Provides that any person who drives or is in actual control of a motor vehicle upon the public highways of the State and who has been involved in a personal injury or fatal motor vehicle crash shall be deemed to have given consent to provide access to any electronic communication device that was in the motor vehicle and within that person's reach at the time of the accident for the purpose of determining whether the person was unlawfully using the device. Provides that a person requested to provide access to an electronic communication device shall be warned that a refusal to provide such access, or if the device's data shows a violation, may result in the suspension of such person's privilege to operate a motor vehicle, and if the person is also a CDL holder, he or she shall be warned that a refusal to provide access to an electronic communication device, or if the device's data shows a violation, may result in the disqualification of the person's privilege to operate a commercial motor vehicle. Provides that if the person refuses to provide access to the electronic communication device or provides such access and the device's data shows a violation, the law enforcement officer shall immediately submit a sworn report to the Secretary of State certifying that access to the electronic communication device was requested and the person refused or the device showed a violation. Provides that upon receipt of the sworn report of a law enforcement officer, the Secretary shall enter the suspension and disqualification to the individual's driving record and the suspension and disqualification shall be effective on the 46th day following the date notice of the suspension was given to the person. Allows a driver to contest the suspension of his or her driving privileges and disqualification of his or her CDL privileges by requesting an administrative hearing with the Secretary. Provides that in all cases involving a fatal motor vehicle crash where the person refuses to provide law enforcement with access to his or her electronic communication device or provides such access and the device's data shows a violation, the Secretary shall notify the local State's Attorney of the refusal or violation. Provides that the amendatory Act may be referred to as Nancy's Law."}], "other_titles": [], "other_identifiers": [], "actions": [{"description": "Filed with Secretary by Sen. Mary Edly-Allen", "date": "2025-02-06", "organization_id": "~{\"classification\": \"upper\"}", "classification": ["filing"], "related_entities": []}, {"description": "First Reading", "date": "2025-02-06", "organization_id": "~{\"classification\": \"upper\"}", "classification": ["reading-1"], "related_entities": []}, {"description": "Referred to Assignments", "date": "2025-02-06", "organization_id": "~{\"classification\": \"upper\"}", "classification": [], "related_entities": []}, {"description": "Added as Co-Sponsor Sen. Karina Villa", "date": "2025-03-07", "organization_id": "~{\"classification\": \"upper\"}", "classification": [], "related_entities": []}], "sponsorships": [{"name": "Mary Edly-Allen", "classification": "primary", "entity_type": "person", "primary": true, "person_id": "~{\"chamber\": \"upper\", \"name\": \"Mary Edly-Allen\"}", "organization_id": null}, {"name": "Karina Villa", "classification": "cosponsor", "entity_type": "person", "primary": false, "person_id": "~{\"chamber\": \"upper\", \"name\": \"Karina Villa\"}", "organization_id": null}], "related_bills": [], "versions": [{"note": "Introduced", "links": [{"url": "https://beta.ilga.gov/documents/legislation/104/SB/PDF/10400SB1930.pdf", "media_type": "application/pdf"}, {"url": "https://beta.ilga.gov/Legislation/BillStatus/FullText?LegDocId=201032&DocName=10400SB1930&DocNum=1930&DocTypeID=SB&LegID=161244&GAID=18&SessionID=114&SpecSess=&Session=&Print=1", "media_type": "text/html"}], "date": "", "classification": ""}], "documents": [], "citations": [], "sources": [{"url": "https://beta.ilga.gov/Legislation/BillStatus?DocNum=1930&GAID=18&DocTypeID=SB&LegId=161244&SessionID=114", "note": ""}], "extras": {}, "_id": "a32fa5ea-172a-11f0-9eaa-86812f74cec2"}