{"legislative_session": "104th", "identifier": "SB1275", "title": "UTILITY-RECOVERABLE EXPENSE", "from_organization": "~{\"classification\": \"upper\"}", "classification": ["bill"], "subject": [], "abstracts": [{"note": "", "abstract": "Amends the Public Utilities Act. Provides that the Illinois Commerce Commission shall not consider as an expense of any public utility company, for the purpose of determining any rate or charge: (1) any amount expended for contributions or gifts to political candidates, political parties, political or legislative committees, or any committee or organization working to influence referendum petitions or elections or contributions to a trade association or a chamber of commerce; or (2) any amount expended by a public utility company for director and officer liability insurance and fiduciary liability insurance. Provides that, in determining whether other types of insurance purchased by the public utility are recoverable, the Commission shall consider whether the insurance provides a financial benefit to ratepayers of the public utility or the public utility's shareholders. Provides that, if the Commission determines the insurance purchased by the public utility provides a financial benefit to the public utility's shareholders, then the amount expended shall not be a recoverable expense. In provisions concerning advertising, provides that goodwill or institutional advertising shall not be a recoverable expense. Provides that any amount expended by a public utility to compensate attorneys or technical experts to prepare and litigate a general rate case filing is a nonrecoverable expense. Provides that, in any general rate increase requested by any gas, electric, water, or sewer utility company under the provisions of the Act, the Commission shall hold at least one public hearing for members of the public to provide input on the requested rate increase. Provides that a public hearing shall be held in the service territory of the utility that is requesting the general rate increase, at a time and location to be determined by the Commission."}], "other_titles": [], "other_identifiers": [], "actions": [{"description": "Filed with Secretary by Sen. Suzy Glowiak Hilton", "date": "2025-01-28", "organization_id": "~{\"classification\": \"upper\"}", "classification": ["filing"], "related_entities": []}, {"description": "First Reading", "date": "2025-01-28", "organization_id": "~{\"classification\": \"upper\"}", "classification": ["reading-1"], "related_entities": []}, {"description": "Referred to Assignments", "date": "2025-01-28", "organization_id": "~{\"classification\": \"upper\"}", "classification": [], "related_entities": []}], "sponsorships": [{"name": "Suzy Glowiak Hilton", "classification": "primary", "entity_type": "person", "primary": true, "person_id": "~{\"chamber\": \"upper\", \"name\": \"Suzy Glowiak Hilton\"}", "organization_id": null}], "related_bills": [], "versions": [{"note": "Introduced", "links": [{"url": "https://beta.ilga.gov/documents/legislation/104/SB/PDF/10400SB1275.pdf", "media_type": "application/pdf"}, {"url": "https://beta.ilga.gov/Legislation/BillStatus/FullText?LegDocId=198924&DocName=10400SB1275&DocNum=1275&DocTypeID=SB&LegID=159134&GAID=18&SessionID=114&SpecSess=&Session=&Print=1", "media_type": "text/html"}], "date": "", "classification": ""}], "documents": [], "citations": [], "sources": [{"url": "https://beta.ilga.gov/Legislation/BillStatus?DocNum=1275&GAID=18&DocTypeID=SB&LegId=159134&SessionID=114", "note": ""}], "extras": {}, "_id": "4afbe398-172a-11f0-9eaa-86812f74cec2"}