{"legislative_session": "104th", "identifier": "SB1847", "title": "MEDICAID-ASSETS EXEMPTION", "from_organization": "~{\"classification\": \"upper\"}", "classification": ["bill"], "subject": [], "abstracts": [{"note": "", "abstract": "Amends the Medical Assistance Article of the Illinois Public Aid Code. In provisions listing the classes of persons eligible for medical assistance, provides that, to the extent permitted by federal law, the Department of Healthcare and Family Services shall by rule eliminate the consideration of assets when determining eligibility for any program of medical assistance. Requires the Department to seek federal authority to disregard all resources, including real and personal property, as authorized by the flexibilities provided under a specified federal law or other available authorities. Provides that if adjustment or elimination of the asset limit results in any disadvantage to receiving medical assistance in a community setting, the Department shall adopt rules rebalancing the programs so that, where medical assistance is available in a community setting, a medical assistance beneficiary has free choice between receiving those services in the community or in a long-term care facility. Makes conforming changes by: (i) removing a provision that requires the Department to establish, by rule, the amounts of assets to be disregarded in determining eligibility for medical assistance; (ii) removing a provision that permits the Department to establish resource standards for pregnant individuals applying for medical assistance that are more restrictive than those resource standards established under the Temporary Assistance for Needy Families program; and (iii) removing a provision that permits the Department to allow non-exempt assets up to $25,000 during periods of medical assistance eligibility for employed persons with disabilities and employed persons with a medically improved disability."}], "other_titles": [], "other_identifiers": [], "actions": [{"description": "Filed with Secretary by Sen. Graciela Guzmán", "date": "2025-02-06", "organization_id": "~{\"classification\": \"upper\"}", "classification": ["filing"], "related_entities": []}, {"description": "First Reading", "date": "2025-02-06", "organization_id": "~{\"classification\": \"upper\"}", "classification": ["reading-1"], "related_entities": []}, {"description": "Referred to Assignments", "date": "2025-02-06", "organization_id": "~{\"classification\": \"upper\"}", "classification": [], "related_entities": []}], "sponsorships": [{"name": "Graciela Guzmán", "classification": "primary", "entity_type": "person", "primary": true, "person_id": "~{\"chamber\": \"upper\", \"name\": \"Graciela Guzm\\u00e1n\"}", "organization_id": null}], "related_bills": [], "versions": [{"note": "Introduced", "links": [{"url": "https://beta.ilga.gov/documents/legislation/104/SB/PDF/10400SB1847.pdf", "media_type": "application/pdf"}, {"url": "https://beta.ilga.gov/Legislation/BillStatus/FullText?LegDocId=200792&DocName=10400SB1847&DocNum=1847&DocTypeID=SB&LegID=161005&GAID=18&SessionID=114&SpecSess=&Session=&Print=1", "media_type": "text/html"}], "date": "", "classification": ""}], "documents": [], "citations": [], "sources": [{"url": "https://beta.ilga.gov/Legislation/BillStatus?DocNum=1847&GAID=18&DocTypeID=SB&LegId=161005&SessionID=114", "note": ""}], "extras": {}, "_id": "9860bb4a-172a-11f0-9eaa-86812f74cec2"}