{"legislative_session": "104th", "identifier": "HB3307", "title": "OMBUDSPERSON MGT RECEIVERSHIP", "from_organization": "~{\"classification\": \"lower\"}", "classification": ["bill"], "subject": [], "abstracts": [{"note": "", "abstract": "Amends the Mortgage Foreclosure Law of the Code of Civil Procedure. Requires receivers of mortgaged real estate to use reasonable efforts to make repairs and improvements as necessary to comply with building, housing, or other similar codes that necessary for the safety, accessibility, and habitability of residential real estate. Creates the Residential Real Estate Ombudsperson Program of which the purpose is to ensure that tenants of residential real estate in receivership continue to have safe, habitable, and accessible homes throughout the receivership process and to facilitate communication between tenants, the receiver, and the court. Requires that in courts in counties of 50,000 or more residents must establish such a program, and in courts in counties of less than 50,000 residents may establish such a program. Provides for the powers of the Ombudsperson to include, but not be limited to, (i) taking, investigating, and making recommendations and reports of complaints of inadequate performance receivership duties relating to matters that may adversely affect the health, safety, welfare, or rights of tenants; (ii) entering the property under receivership at a reasonable time and with reasonable notice to the receiver or receiver's manager; (iii) communicating privately with tenants who consent to that communication; (iv) encouraging the facilitation of communication between receivers, tenants, and the court; (v) making recommendations to receivers regarding building conditions and court practices; (vi) submitting reports to the court regarding the status of the residential real estate, the receivership relationship, the use of the Ombudsperson services; and (vii) making recommendations to the court to improve the receivership relationship. Requires the Ombudsperson within 60 days of appointment to send a notice of contact information of the Ombudsperson to all known dwelling occupants of residential real estate through by posting a written notice on unit doors and in common areas. Effective January 1, 2026."}], "other_titles": [], "other_identifiers": [], "actions": [{"description": "Filed with the Clerk by Rep. Kelly M. Cassidy", "date": "2025-02-06", "organization_id": "~{\"classification\": \"lower\"}", "classification": ["filing"], "related_entities": []}, {"description": "First Reading", "date": "2025-02-18", "organization_id": "~{\"classification\": \"lower\"}", "classification": ["reading-1"], "related_entities": []}, {"description": "Referred to Rules Committee", "date": "2025-02-18", "organization_id": "~{\"classification\": \"lower\"}", "classification": [], "related_entities": []}, {"description": "Assigned to Judiciary - Civil Committee", "date": "2025-03-11", "organization_id": "~{\"classification\": \"lower\"}", "classification": ["referral-committee"], "related_entities": []}, {"description": "Rule 19(a) / Re-referred to Rules Committee", "date": "2025-03-21", "organization_id": "~{\"classification\": \"lower\"}", "classification": [], "related_entities": []}], "sponsorships": [{"name": "Kelly M. Cassidy", "classification": "primary", "entity_type": "person", "primary": true, "person_id": "~{\"chamber\": \"lower\", \"name\": \"Kelly M. Cassidy\"}", "organization_id": null}], "related_bills": [], "versions": [{"note": "Introduced", "links": [{"url": "https://beta.ilga.gov/documents/legislation/104/HB/PDF/10400HB3307.pdf", "media_type": "application/pdf"}, {"url": "https://beta.ilga.gov/Legislation/BillStatus/FullText?LegDocId=201585&DocName=10400HB3307&DocNum=3307&DocTypeID=HB&LegID=161797&GAID=18&SessionID=114&SpecSess=&Session=&Print=1", "media_type": "text/html"}], "date": "", "classification": ""}], "documents": [], "citations": [], "sources": [{"url": "https://beta.ilga.gov/Legislation/BillStatus?DocNum=3307&GAID=18&DocTypeID=HB&LegId=161797&SessionID=114", "note": ""}], "extras": {}, "_id": "1836846e-1729-11f0-9eaa-86812f74cec2"}