{"legislative_session": "104th", "identifier": "SB2143", "title": "VEH CD-TOWING", "from_organization": "~{\"classification\": \"upper\"}", "classification": ["bill"], "subject": [], "abstracts": [{"note": "", "abstract": "Amends the Illinois Vehicle Code. Requires a commercial vehicle safety relocator to give at least one-hour notice to the owner of a vehicle located on private property prior to towing the vehicle. Prohibits a property owner, property manager, or government-owned property manager from enforcing a registration sticker violation for any vehicle located on the property and having the vehicle towed based on the registration sticker violation. Prohibits a property owner or property manager from having a vehicle towed or threatening to have a vehicle towed off the property if the owner of the vehicle is in the process of being evicted from the property. Provides that if a vehicle is a hazard to the community and requires immediate removal, then local law enforcement may impound the vehicle from the private property with the consent of the property owner. Requires, within 72 hours of a vehicle being towed, a commercial vehicle safety relocator to provide the vehicle owner with a statement that provides clear evidence of the violation for which the vehicle was towed. Requires every vehicle used by a commercial vehicle safety relocator to be owned or leased directly by the commercial vehicle safety relocator, and every such vehicle must display the same signage displayed at the property of the commercial vehicle safety relocator's impound lot. Requires every commercial vehicle safety relocator to display a copy of the amendatory Act at all of its impound lots. Requires a commercial vehicle safety relocator to update its contracts with property owners every 12 months. Provides that a commercial vehicle safety relocator that violates the provisions shall be fined $500 for each violation. Applies the provisions only to towing vehicles located on private property."}], "other_titles": [], "other_identifiers": [], "actions": [{"description": "Filed with Secretary by Sen. Bill Cunningham", "date": "2025-02-07", "organization_id": "~{\"classification\": \"upper\"}", "classification": ["filing"], "related_entities": []}, {"description": "First Reading", "date": "2025-02-07", "organization_id": "~{\"classification\": \"upper\"}", "classification": ["reading-1"], "related_entities": []}, {"description": "Referred to Assignments", "date": "2025-02-07", "organization_id": "~{\"classification\": \"upper\"}", "classification": [], "related_entities": []}], "sponsorships": [{"name": "Bill Cunningham", "classification": "primary", "entity_type": "person", "primary": true, "person_id": "~{\"chamber\": \"upper\", \"name\": \"Bill Cunningham\"}", "organization_id": null}], "related_bills": [], "versions": [{"note": "Introduced", "links": [{"url": "https://beta.ilga.gov/documents/legislation/104/SB/PDF/10400SB2143.pdf", "media_type": "application/pdf"}, {"url": "https://beta.ilga.gov/Legislation/BillStatus/FullText?LegDocId=201502&DocName=10400SB2143&DocNum=2143&DocTypeID=SB&LegID=161714&GAID=18&SessionID=114&SpecSess=&Session=&Print=1", "media_type": "text/html"}], "date": "", "classification": ""}], "documents": [], "citations": [], "sources": [{"url": "https://beta.ilga.gov/Legislation/BillStatus?DocNum=2143&GAID=18&DocTypeID=SB&LegId=161714&SessionID=114", "note": ""}], "extras": {}, "_id": "bff12af0-172a-11f0-9eaa-86812f74cec2"}