{"legislative_session": "104th", "identifier": "HB4015", "title": "PEN CD-DNST POLICE-RECIPROCITY", "from_organization": "~{\"classification\": \"lower\"}", "classification": ["bill"], "subject": [], "abstracts": [{"note": "", "abstract": "Amends the Downstate Police Article of the Illinois Pension Code. Provides that an eligible police officer may elect to receive a retirement pension from each pension fund under the Article in which the police officer has at least one year of service credit, but has not received a refund, by applying in writing and paying a specified contribution. Provides that from each such pension fund other than the last pension fund, in lieu of any retirement pension otherwise payable, an eligible police officer may elect to receive a monthly pension of 1/12th of 2.5% of his or her final monthly salary under that fund for each month of service in that fund, subject to a maximum of 75% of that final monthly salary. Provides that the retirement pension from the last pension fund shall be the retirement pension that would be payable to the police officer if he or she had participated in that last pension fund for his or her entire period of service under all pension funds, minus the amounts of the retirement pensions payable to the police officer by all other pension funds. Provides that a police officer must pay to each pension fund from which he or she has elected to receive a pension a contribution equal to 1% of monthly salary for each month of service credit that the police officer has in that fund (other than service credit for which the police officer has already paid a specified additional contribution), together with interest thereon at the rate of 6% per annum, compounded annually. Contains provisions concerning eligibility for the benefit; contributions; refunds; reinstatement of terminated credits; automatic annual increases; and occupational disease disability pensions. Makes conforming and other changes. Amends the State Mandates Act to require implementation without reimbursement."}], "other_titles": [], "other_identifiers": [], "actions": [{"description": "Filed with the Clerk by Rep. Justin Slaughter", "date": "2025-03-06", "organization_id": "~{\"classification\": \"lower\"}", "classification": ["filing"], "related_entities": []}, {"description": "First Reading", "date": "2025-03-06", "organization_id": "~{\"classification\": \"lower\"}", "classification": ["reading-1"], "related_entities": []}, {"description": "Referred to Rules Committee", "date": "2025-03-06", "organization_id": "~{\"classification\": \"lower\"}", "classification": [], "related_entities": []}], "sponsorships": [{"name": "Justin Slaughter", "classification": "primary", "entity_type": "person", "primary": true, "person_id": "~{\"chamber\": \"lower\", \"name\": \"Justin Slaughter\"}", "organization_id": null}], "related_bills": [], "versions": [{"note": "Introduced", "links": [{"url": "https://beta.ilga.gov/documents/legislation/104/HB/PDF/10400HB4015.pdf", "media_type": "application/pdf"}, {"url": "https://beta.ilga.gov/Legislation/BillStatus/FullText?LegDocId=203177&DocName=10400HB4015&DocNum=4015&DocTypeID=HB&LegID=163187&GAID=18&SessionID=114&SpecSess=&Session=&Print=1", "media_type": "text/html"}], "date": "", "classification": ""}], "documents": [], "citations": [], "sources": [{"url": "https://beta.ilga.gov/Legislation/BillStatus?DocNum=4015&GAID=18&DocTypeID=HB&LegId=163187&SessionID=114", "note": ""}], "extras": {}, "_id": "74a5a522-1729-11f0-9eaa-86812f74cec2"}