{"legislative_session": "104th", "identifier": "SB1973", "title": "TNC-TRANSPARENCY/DEACTIVATION", "from_organization": "~{\"classification\": \"upper\"}", "classification": ["bill"], "subject": [], "abstracts": [{"note": "", "abstract": "Amends the Transportation Network Providers Act. Provides that if a transportation network company (TNC) rejects an individual applying to be a TNC driver, the TNC shall describe to the applicant, in writing, the reasons for their rejection along with documentation confirming that the applicant maintains one of the disqualifying conditions. Provides that every TNC driver has a right to inspect, copy, and receive copies of the specified documents, with exceptions. Provides that within 24 hours of each trip completion, the TNC must transmit a detailed electronic receipt to the TNC driver. Provides that each week, a TNC must transmit a weekly summary to a driver in writing or electronically containing certain information for the preceding calendar week. Requires a TNC to maintain a written plain-language deactivation policy that provides the policies and procedures for deactivation. Prohibits a TNC from deactivating a TNC driver for: (1) a violation not reasonably understood as part of a TNC's written deactivation policy; (2) a driver's ability to work a minimum number of hours; (3) a driver's acceptance or rejection of a ride, as long as the acceptance or rejection is not for a discriminatory purpose; (4) a driver's good faith statement regarding compensation or working conditions made publicly or privately; or (5) a driver asserting the driver's legal rights under any local, State, or federal law. Requires the TNC to provide notice at the time of deactivation or, for deactivations based on serious misconduct, within 3 days of the deactivation. Requires a TNC to adopt policies ensuring complete reimbursement to TNC drivers for any violations of a parking ordinance of a unit of local government. Provides that it is a violation of the Act for a TNC to retaliate through deactivation or in any other manner against a TNC driver for exercising any rights granted under the Act. Makes other changes. Effective January 1, 2026."}], "other_titles": [], "other_identifiers": [], "actions": [{"description": "Filed with Secretary by Sen. Emil Jones, III", "date": "2025-02-06", "organization_id": "~{\"classification\": \"upper\"}", "classification": ["filing"], "related_entities": []}, {"description": "First Reading", "date": "2025-02-06", "organization_id": "~{\"classification\": \"upper\"}", "classification": ["reading-1"], "related_entities": []}, {"description": "Referred to Assignments", "date": "2025-02-06", "organization_id": "~{\"classification\": \"upper\"}", "classification": [], "related_entities": []}], "sponsorships": [{"name": "Emil Jones, III", "classification": "primary", "entity_type": "person", "primary": true, "person_id": "~{\"chamber\": \"upper\", \"name\": \"Emil Jones, III\"}", "organization_id": null}], "related_bills": [], "versions": [{"note": "Introduced", "links": [{"url": "https://beta.ilga.gov/documents/legislation/104/SB/PDF/10400SB1973.pdf", "media_type": "application/pdf"}, {"url": "https://beta.ilga.gov/Legislation/BillStatus/FullText?LegDocId=201154&DocName=10400SB1973&DocNum=1973&DocTypeID=SB&LegID=161366&GAID=18&SessionID=114&SpecSess=&Session=&Print=1", "media_type": "text/html"}], "date": "", "classification": ""}], "documents": [], "citations": [], "sources": [{"url": "https://beta.ilga.gov/Legislation/BillStatus?DocNum=1973&GAID=18&DocTypeID=SB&LegId=161366&SessionID=114", "note": ""}], "extras": {}, "_id": "a95109b4-172a-11f0-9eaa-86812f74cec2"}