{"legislative_session": "104th", "identifier": "HB1636", "title": "PEN CD-SERS & TRS-DC PLAN", "from_organization": "~{\"classification\": \"lower\"}", "classification": ["bill"], "subject": [], "abstracts": [{"note": "", "abstract": "Amends the State Employees and Downstate Teacher Articles of the Illinois Pension Code. Requires the System to develop and offer a defined contribution plan for active members of the System. Provides that the defined contribution plan shall collect optional employee contributions, employer contributions, and State contributions into individual accounts and shall offer investment options to participants. Provides that there shall be no maximum or minimum contribution requirements. Provides that on an annual basis, the employer of a participant in the defined contribution plan shall deposit in the participant's defined contribution plan account an amount equal to the amount contributed by the participant during the preceding year and the State shall deposit in the participant's defined contribution plan account an amount equal to the amount contributed by the participant during the preceding year. Provides that, if the State is the actual employer of the participant, then the State shall contribute an additional amount equal to the employer's contribution. Provides that a participant in the defined contribution plan may not withdraw moneys from the participant's account while the participant is an active member of the System. Requires the defined contribution plan to be operated in full compliance with any applicable State and federal laws, and requires the System to use generally accepted practices in creating and maintaining the benefit for the best interest of the participants. Makes conforming changes. Provides that any benefit increase resulting from the amendatory Act is excluded from the definition of \"new benefit increase\". Amends the State Mandates Act to require implementation without reimbursement."}], "other_titles": [], "other_identifiers": [], "actions": [{"description": "Filed with the Clerk by Rep. Travis Weaver", "date": "2025-01-23", "organization_id": "~{\"classification\": \"lower\"}", "classification": ["filing"], "related_entities": []}, {"description": "First Reading", "date": "2025-01-28", "organization_id": "~{\"classification\": \"lower\"}", "classification": ["reading-1"], "related_entities": []}, {"description": "Referred to Rules Committee", "date": "2025-01-28", "organization_id": "~{\"classification\": \"lower\"}", "classification": [], "related_entities": []}], "sponsorships": [{"name": "Travis Weaver", "classification": "primary", "entity_type": "person", "primary": true, "person_id": "~{\"chamber\": \"lower\", \"name\": \"Travis Weaver\"}", "organization_id": null}], "related_bills": [], "versions": [{"note": "Introduced", "links": [{"url": "https://beta.ilga.gov/documents/legislation/104/HB/PDF/10400HB1636.pdf", "media_type": "application/pdf"}, {"url": "https://beta.ilga.gov/Legislation/BillStatus/FullText?LegDocId=198157&DocName=10400HB1636&DocNum=1636&DocTypeID=HB&LegID=158367&GAID=18&SessionID=114&SpecSess=&Session=&Print=1", "media_type": "text/html"}], "date": "", "classification": ""}], "documents": [], "citations": [], "sources": [{"url": "https://beta.ilga.gov/Legislation/BillStatus?DocNum=1636&GAID=18&DocTypeID=HB&LegId=158367&SessionID=114", "note": ""}], "extras": {}, "_id": "3c915df8-1728-11f0-9eaa-86812f74cec2"}