{"legislative_session": "104th", "identifier": "SB124", "title": "INS-MOTOR VEHICLE RATES", "from_organization": "~{\"classification\": \"upper\"}", "classification": ["bill"], "subject": [], "abstracts": [{"note": "", "abstract": "Amends the Illinois Insurance Code. Provides that the amendatory Act may be referred to as the Motor Vehicle Insurance Fairness Act. Provides that no insurer shall refuse to issue or renew a policy of automobile insurance based in whole or in part on specified prohibited underwriting or rating factors. Sets forth factors that are prohibited with respect to underwriting and rating a policy of automobile insurance. Sets forth provisions concerning the use of territorial factors. Provides that every insurer selling a policy of automobile insurance in the State shall demonstrate that its marketing, underwriting, rating, claims handling, fraud investigations, and any algorithm or model used for those business practices do not disparately impact any group of customers based on race, color, national or ethnic origin, religion, sex, sexual orientation, disability, gender identity, or gender expression. Provides that no rate shall be approved or remain in effect that is excessive, inadequate, unfairly discriminatory, or otherwise in violation of the provisions. Provides that every insurer that desires to change any rate shall file a complete rate application with the Director of Insurance. Provides that all information provided to the Director under the provisions shall be available for public inspection. Provides that any person may initiate or intervene in any proceeding permitted or established under the provisions and challenge any action of the Director under the provisions. Provides that the Department of Insurance shall adopt rules. Provides that all insurers subject to the provisions shall be assessed a fee of 0.05% of their total earned premium from the prior calendar year, and that the fee shall be payable to the Department no later than July 1 of each calendar year and shall be used by the Department to implement the provisions."}], "other_titles": [], "other_identifiers": [], "actions": [{"description": "Filed with Secretary by Sen. Javier L. Cervantes", "date": "2025-01-17", "organization_id": "~{\"classification\": \"upper\"}", "classification": ["filing"], "related_entities": []}, {"description": "First Reading", "date": "2025-01-17", "organization_id": "~{\"classification\": \"upper\"}", "classification": ["reading-1"], "related_entities": []}, {"description": "Referred to Assignments", "date": "2025-01-17", "organization_id": "~{\"classification\": \"upper\"}", "classification": [], "related_entities": []}], "sponsorships": [{"name": "Javier L. Cervantes", "classification": "primary", "entity_type": "person", "primary": true, "person_id": "~{\"chamber\": \"upper\", \"name\": \"Javier L. Cervantes\"}", "organization_id": null}], "related_bills": [], "versions": [{"note": "Introduced", "links": [{"url": "https://beta.ilga.gov/documents/legislation/104/SB/PDF/10400SB0124.pdf", "media_type": "application/pdf"}, {"url": "https://beta.ilga.gov/Legislation/BillStatus/FullText?LegDocId=197091&DocName=10400SB0124&DocNum=124&DocTypeID=SB&LegID=157301&GAID=18&SessionID=114&SpecSess=&Session=&Print=1", "media_type": "text/html"}], "date": "", "classification": ""}], "documents": [], "citations": [], "sources": [{"url": "https://beta.ilga.gov/Legislation/BillStatus?DocNum=124&GAID=18&DocTypeID=SB&LegId=157301&SessionID=114", "note": ""}], "extras": {}, "_id": "a6831afc-1729-11f0-9eaa-86812f74cec2"}