{"legislative_session": "104th", "identifier": "HB2617", "title": "PREVENT ABUSE AGAINST MOTHERS", "from_organization": "~{\"classification\": \"lower\"}", "classification": ["bill"], "subject": [], "abstracts": [{"note": "", "abstract": "Creates the Coercive Abuse Against Mothers Prevention Act. Provides that it is illegal to coerce or force a pregnant woman to have an abortion. Provides that whoever coerces or forces a pregnant woman to have an abortion is guilty of a petty offense with a fine of $500 and a business offense with a fine of $1,500. Allows a pregnant woman injured by an abuser's violation of the Act to bring a civil suit to recover damages for such injury regardless of whether the abuser is criminally prosecuted and whether the pregnant woman has an abortion. Requires a reproductive health care facility to conspicuously post signs visible to all who enter its waiting, consultation, and procedure rooms specified notices and information. Requires a mandatory reporter to personally report every instance of alleged or suspected coerced abortion to the Department of Children and Family Services or the local law enforcement authority of the county the facility is in. Requires an attending health care professional to orally ask a pregnant woman, in a private room and without any individual accompanying her, if she is being coerced or forced to have an abortion. Provides that any mandatory reporter who has reason to believe a woman is or has been a victim of coercion and willfully and knowingly does not report such coercion, force, attempted coercion, threatened coercion, or threatened force is guilty of a business offense with a fine of $5,000. Provides that any health care professional who willfully violates the mandatory reporting requirements shall be referred to the Illinois State Medical Board for action on whether to suspend or revoke his or her license. Allows a pregnant woman injured by a facility's violation of the Act to bring a civil suit to recover damages for such injury. Makes other changes. Effective 90 days after becoming law."}], "other_titles": [], "other_identifiers": [], "actions": [{"description": "Filed with the Clerk by Rep. Adam M. Niemerg", "date": "2025-02-04", "organization_id": "~{\"classification\": \"lower\"}", "classification": ["filing"], "related_entities": []}, {"description": "First Reading", "date": "2025-02-06", "organization_id": "~{\"classification\": \"lower\"}", "classification": ["reading-1"], "related_entities": []}, {"description": "Referred to Rules Committee", "date": "2025-02-06", "organization_id": "~{\"classification\": \"lower\"}", "classification": [], "related_entities": []}], "sponsorships": [{"name": "Adam M. Niemerg", "classification": "primary", "entity_type": "person", "primary": true, "person_id": "~{\"chamber\": \"lower\", \"name\": \"Adam M. Niemerg\"}", "organization_id": null}], "related_bills": [], "versions": [{"note": "Introduced", "links": [{"url": "https://beta.ilga.gov/documents/legislation/104/HB/PDF/10400HB2617.pdf", "media_type": "application/pdf"}, {"url": "https://beta.ilga.gov/Legislation/BillStatus/FullText?LegDocId=200323&DocName=10400HB2617&DocNum=2617&DocTypeID=HB&LegID=160536&GAID=18&SessionID=114&SpecSess=&Session=&Print=1", "media_type": "text/html"}], "date": "", "classification": ""}], "documents": [], "citations": [], "sources": [{"url": "https://beta.ilga.gov/Legislation/BillStatus?DocNum=2617&GAID=18&DocTypeID=HB&LegId=160536&SessionID=114", "note": ""}], "extras": {}, "_id": "be766c00-1728-11f0-9eaa-86812f74cec2"}