{"legislative_session": "104th", "identifier": "SB1284", "title": "INSURANCE-MEDICAID WAIVER-ACA", "from_organization": "~{\"classification\": \"upper\"}", "classification": ["bill"], "subject": [], "abstracts": [{"note": "", "abstract": "Amends the State Employees Group Insurance Act of 1971. Prohibits the State from applying for any federal waiver that would reduce or eliminate any protection or coverage required under the Patient Protection and Affordable Care Act (Affordable Care Act) that was in effect on January 1, 2017, including, but not limited to, any protection for persons with preexisting conditions and coverage for services identified as essential health benefits under the Affordable Care Act. Provides that the State or an agency of the executive branch may apply for such a waiver only if granted authorization by the General Assembly through joint resolution. Amends the Illinois Insurance Code. Prohibits the State from applying for any federal waiver that would permit an individual or group health insurance plan to reduce or eliminate any protection or coverage required under the Affordable Care Act that was in effect on January 1, 2017, including, but not limited to, any protection for persons with preexisting conditions and coverage for services identified as essential health benefits under the Affordable Care Act. Provides that the State or an agency of the executive branch may apply for such a waiver only if granted authorization by the General Assembly through joint resolution. Amends the Illinois Public Aid Code. Prohibits the State or an agency of the executive branch from applying for any federal Medicaid waiver that would result in more restrictive standards, methodologies, procedures, or other requirements than those that were in effect in Illinois as of January 1, 2017 for the Medical Assistance Program, the Children's Health Insurance Program, or any other medical assistance program in Illinois operating under any existing federal waiver authorized by specified provisions of the Social Security Act. Provides that the State or an agency of the executive branch may apply for such a waiver only if granted authorization by the General Assembly through joint resolution. Effective immediately."}], "other_titles": [], "other_identifiers": [], "actions": [{"description": "Filed with Secretary by Sen. Sue Rezin", "date": "2025-01-28", "organization_id": "~{\"classification\": \"upper\"}", "classification": ["filing"], "related_entities": []}, {"description": "First Reading", "date": "2025-01-28", "organization_id": "~{\"classification\": \"upper\"}", "classification": ["reading-1"], "related_entities": []}, {"description": "Referred to Assignments", "date": "2025-01-28", "organization_id": "~{\"classification\": \"upper\"}", "classification": [], "related_entities": []}], "sponsorships": [{"name": "Sue Rezin", "classification": "primary", "entity_type": "person", "primary": true, "person_id": "~{\"chamber\": \"upper\", \"name\": \"Sue Rezin\"}", "organization_id": null}], "related_bills": [], "versions": [{"note": "Introduced", "links": [{"url": "https://beta.ilga.gov/documents/legislation/104/SB/PDF/10400SB1284.pdf", "media_type": "application/pdf"}, {"url": "https://beta.ilga.gov/Legislation/BillStatus/FullText?LegDocId=198934&DocName=10400SB1284&DocNum=1284&DocTypeID=SB&LegID=159144&GAID=18&SessionID=114&SpecSess=&Session=&Print=1", "media_type": "text/html"}], "date": "", "classification": ""}], "documents": [], "citations": [], "sources": [{"url": "https://beta.ilga.gov/Legislation/BillStatus?DocNum=1284&GAID=18&DocTypeID=SB&LegId=159144&SessionID=114", "note": ""}], "extras": {}, "_id": "4c3d83c4-172a-11f0-9eaa-86812f74cec2"}