{"legislative_session": "104th", "identifier": "HB3430", "title": "NONCONSENUAL TOWING ACT", "from_organization": "~{\"classification\": \"lower\"}", "classification": ["bill"], "subject": [], "abstracts": [{"note": "", "abstract": "Creates the Nonconsensual Towing Act. Creates the Commercial Vehicle Towing Advisory Committee. Sets forth members, terms, compensation, meetings, and record keeping. Provides that the Committee shall: (1) establish rules and standards for the inclusion of a towing and recovery service on the tow list; (2) establish statewide maximum towing and storage rates for nonconsensual tows; (3) require the towing and recovery service to ban the use of per-pound billing for nonconsensual towing; (4) publish a Towing Service Standard Manual; and (5) collect and compile data and information on the number of people who have been towed nonconsensually and the areas where nonconsensual towings have occurred. Requires a towing and recovery service to allow an owner of a commercial motor vehicle or a designee of the owner of the commercial motor vehicle to access the vehicle in a reasonable manner as established by rules adopted by the Committee. Allows a law enforcement officer to use the services of the a tow list. Provides that it is unlawful for: (1) a law enforcement officer to receive compensation or receive any other incentive to select a particular towing and recovery service from the list, hold any financial interest in a towing and recovery service, and recommend any towing and recovery service in the performance of his or her duties; (2) any member or employee of the Committee, Department of Transportation, or Secretary of State to receive compensation from a towing and recovery service for the privilege of being included on the tow list; (3) a towing and recovery service to pay money or other valuable consideration for the privilege of nonconsensual towing commercial motor vehicles; and (4) a towing and recovery service to employ or otherwise compensate individuals whose primary task is to report the presence of unauthorized, improperly, or illegally parked commercial motor vehicles for the purpose of towing or removal and storage. Provides that before a towing and recovery service connects a commercial motor vehicle to a tow truck for a nonconsensual tow, the towing and recovery service shall document the vehicle's condition and the reason for the tow. Prohibits a towing and recovery service from using vehicle immobilization devices except under the direction of law enforcement. Repeals the Act on July 1, 2030. Effective July 1, 2025."}], "other_titles": [], "other_identifiers": [], "actions": [{"description": "Filed with the Clerk by Rep. Norma Hernandez", "date": "2025-02-07", "organization_id": "~{\"classification\": \"lower\"}", "classification": ["filing"], "related_entities": []}, {"description": "First Reading", "date": "2025-02-18", "organization_id": "~{\"classification\": \"lower\"}", "classification": ["reading-1"], "related_entities": []}, {"description": "Referred to Rules Committee", "date": "2025-02-18", "organization_id": "~{\"classification\": \"lower\"}", "classification": [], "related_entities": []}, {"description": "Assigned to Transportation: Vehicles & Safety", "date": "2025-03-11", "organization_id": "~{\"classification\": \"lower\"}", "classification": ["referral-committee"], "related_entities": []}, {"description": "Rule 19(a) / Re-referred to Rules Committee", "date": "2025-03-21", "organization_id": "~{\"classification\": \"lower\"}", "classification": [], "related_entities": []}], "sponsorships": [{"name": "Norma Hernandez", "classification": "primary", "entity_type": "person", "primary": true, "person_id": "~{\"chamber\": \"lower\", \"name\": \"Norma Hernandez\"}", "organization_id": null}], "related_bills": [], "versions": [{"note": "Introduced", "links": [{"url": "https://beta.ilga.gov/documents/legislation/104/HB/PDF/10400HB3430.pdf", "media_type": "application/pdf"}, {"url": "https://beta.ilga.gov/Legislation/BillStatus/FullText?LegDocId=201838&DocName=10400HB3430&DocNum=3430&DocTypeID=HB&LegID=162050&GAID=18&SessionID=114&SpecSess=&Session=&Print=1", "media_type": "text/html"}], "date": "", "classification": ""}], "documents": [], "citations": [], "sources": [{"url": "https://beta.ilga.gov/Legislation/BillStatus?DocNum=3430&GAID=18&DocTypeID=HB&LegId=162050&SessionID=114", "note": ""}], "extras": {}, "_id": "28214f58-1729-11f0-9eaa-86812f74cec2"}