{"legislative_session": "104th", "identifier": "HB2926", "title": "CANNABIS DELIVERY", "from_organization": "~{\"classification\": \"lower\"}", "classification": ["bill"], "subject": [], "abstracts": [{"note": "", "abstract": "Amends the Compassionate Use of Medical Cannabis Program Act. Provides that all cannabis products purchased by a qualifying patient, provisional patient, or designated caregiver from a licensed dispensing organization shall be lawful products (rather than all medical cannabis products purchased by a qualifying patient at a licensed dispensing organization shall be lawful products and a distinction shall be made between medical and non-medical uses, with other requirements). Amends the Cannabis Regulation and Tax Act. Changes and adds definitions. Makes changes to provisions regarding operational requirements and prohibitions. Provides that a dispensing organization shall not sell cannabis or cannabis-infused products to a purchaser unless the purchaser has been verified to be 21 years of age or older, or the person is verified to be a registered qualified patient, provisional patient, or designated caregiver (removing requirements referencing the Compassionate Use of Medical Cannabis Program). Removes prohibitions for a dispensing organization to operate drive-through windows. Provides an exception to the prohibition for a dispensing organization to transport cannabis for delivery. In provisions regarding an inventory control system, adds that all dispensing organizations shall maintain internal, confidential records of all deliveries to any registered qualified patient, provisional patient, or designated caregiver, with certain requirements. In provisions regarding dispensing cannabis, adds a requirement that the agent verify the qualifying patient, provisional patient, or designated caregiver registration card, if applicable. Provides that a dispensing organization may offer pickup or drive-through for cannabis or cannabis-infused products to purchasers over 21 years of age and certain patients and caregivers. Provides that a dispensing organization may offer delivery for cannabis or cannabis-infused products to certain patients and caregivers. Adds requirements to provisions regarding security for a dispensing organization. Adds provisions permitting delivery by dispensing organizations to the residence of a qualifying patient, provisional patient, or designated caregiver, with certain requirements."}], "other_titles": [], "other_identifiers": [], "actions": [{"description": "Filed with the Clerk by Rep. Bob Morgan", "date": "2025-02-05", "organization_id": "~{\"classification\": \"lower\"}", "classification": ["filing"], "related_entities": []}, {"description": "First Reading", "date": "2025-02-06", "organization_id": "~{\"classification\": \"lower\"}", "classification": ["reading-1"], "related_entities": []}, {"description": "Referred to Rules Committee", "date": "2025-02-06", "organization_id": "~{\"classification\": \"lower\"}", "classification": [], "related_entities": []}], "sponsorships": [{"name": "Bob Morgan", "classification": "primary", "entity_type": "person", "primary": true, "person_id": "~{\"chamber\": \"lower\", \"name\": \"Bob Morgan\"}", "organization_id": null}], "related_bills": [], "versions": [{"note": "Introduced", "links": [{"url": "https://beta.ilga.gov/documents/legislation/104/HB/PDF/10400HB2926.pdf", "media_type": "application/pdf"}, {"url": "https://beta.ilga.gov/Legislation/BillStatus/FullText?LegDocId=200917&DocName=10400HB2926&DocNum=2926&DocTypeID=HB&LegID=161129&GAID=18&SessionID=114&SpecSess=&Session=&Print=1", "media_type": "text/html"}], "date": "", "classification": ""}], "documents": [], "citations": [], "sources": [{"url": "https://beta.ilga.gov/Legislation/BillStatus?DocNum=2926&GAID=18&DocTypeID=HB&LegId=161129&SessionID=114", "note": ""}], "extras": {}, "_id": "e685a1a2-1728-11f0-9eaa-86812f74cec2"}