{"legislative_session": "104th", "identifier": "SB1508", "title": "DCFS-OFFICE OF ALUMNI SUPPORT", "from_organization": "~{\"classification\": \"upper\"}", "classification": ["bill"], "subject": [], "abstracts": [{"note": "", "abstract": "Amends the Children and Family Services Act. Requires the Department of Children and Family Services to, no later than July 1, 2026, establish the Office of Alumni Support (Office) to provide assistance, guidance, and support to any former youth in care needing or requesting assistance, guidance, or support. Provides that the Office shall link former youth in care to existing supports, determine what additional supports are necessary to improve outcomes for former youth in care based upon identified needs, including researching existing evidence-based and evidence-informed practice models of providing assistance to former youth in care, and implement necessary changes to provide the additional supports. Provides that current and former youth in care shall provide input, guidance, and direction on the establishment and operation of the Office. Sets forth a list of stakeholders the Department shall engage with when developing the Office. Creates the Former Youth in Care Crisis Support Services Program for the purpose of providing former youth in care in crisis immediate funds to address urgent needs, including, but not limited to, emergency housing, healthcare, food, transportation, and items urgently needed to maintain the former youth in care in a work or educational setting. Provides that the Office of Alumni Support shall manage and operate the program. Requires the Department to submit quarterly progress reports to the General Assembly on the establishment of the Office. Requires the Auditor General to conduct a performance audit to determine if the Department is meeting the requirements of the amendatory Act. Provides that the performance audit shall be conducted 2 years after the effective date of the amendatory Act. Effective immediately."}], "other_titles": [], "other_identifiers": [], "actions": [{"description": "Filed with Secretary by Sen. Sara Feigenholtz", "date": "2025-02-04", "organization_id": "~{\"classification\": \"upper\"}", "classification": ["filing"], "related_entities": []}, {"description": "First Reading", "date": "2025-02-04", "organization_id": "~{\"classification\": \"upper\"}", "classification": ["reading-1"], "related_entities": []}, {"description": "Referred to Assignments", "date": "2025-02-04", "organization_id": "~{\"classification\": \"upper\"}", "classification": [], "related_entities": []}], "sponsorships": [{"name": "Sara Feigenholtz", "classification": "primary", "entity_type": "person", "primary": true, "person_id": "~{\"chamber\": \"upper\", \"name\": \"Sara Feigenholtz\"}", "organization_id": null}], "related_bills": [], "versions": [{"note": "Introduced", "links": [{"url": "https://beta.ilga.gov/documents/legislation/104/SB/PDF/10400SB1508.pdf", "media_type": "application/pdf"}, {"url": "https://beta.ilga.gov/Legislation/BillStatus/FullText?LegDocId=199925&DocName=10400SB1508&DocNum=1508&DocTypeID=SB&LegID=160137&GAID=18&SessionID=114&SpecSess=&Session=&Print=1", "media_type": "text/html"}], "date": "", "classification": ""}], "documents": [], "citations": [], "sources": [{"url": "https://beta.ilga.gov/Legislation/BillStatus?DocNum=1508&GAID=18&DocTypeID=SB&LegId=160137&SessionID=114", "note": ""}], "extras": {}, "_id": "6a209494-172a-11f0-9eaa-86812f74cec2"}